anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
#include <Arduino.h>
#include <Preferences.h>
#include <SPI.h>
#include <TFT_eSPI.h>
#include <Wire.h>

#include <array>
#include <cstddef>
#include <cstdint>
#include <cstdio>
#include <cstring>

#include <esp_system.h>
#include <esp_task_wdt.h>
#include <esp_timer.h>
#include <esp_app_desc.h>
#include <esp_attr.h>
#include <esp_private/system_internal.h>
#include <soc/gpio_struct.h>
#include <mbedtls/sha256.h>
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <freertos/semphr.h>
#include <freertos/task.h>

#include "apps/library/LibraryController.h"
#include "apps/library/SessionCatalog.h"
#include "apps/capture/RadiotapPcap.h"
#include "apps/capture/SubGhzRawCapture.h"
#include "apps/capture/SubGhzRawCsv.h"
#include "apps/capture/WifiFrameCapture.h"
#include "apps/self_test/SelfTestController.h"
#include "apps/spectrum/Cc1101SpectrumController.h"
#include "apps/spectrum/Nrf24SpectrumController.h"
#include "apps/spectrum/SpectrumViewport.h"
#include "apps/survey/ProductSurveyAdmission.h"
#include "apps/survey/SurveyController.h"
#include "apps/survey/SurveyPipeline.h"
#include "apps/survey/SurveySourceController.h"
#include "apps/survey/SurveyWorkflow.h"
#include "boards/esp32_div_v2/BoardProfile.h"
#include "domain/apps/AppCatalog.h"
#include "domain/hardware/HardwareInventory.h"
#include "domain/observations/Observation.h"
#include "drivers/ble/BlePassiveContract.h"
#include "drivers/radio/Cc1101PassiveSpectrum.h"
#include "drivers/radio/Nrf24PassiveSpectrum.h"
#include "drivers/radio/ShieldReceiverIdentity.h"
#include "drivers/wifi/WifiPassiveContract.h"
#include "kernel/runtime/AppRuntime.h"
#include "kernel/runtime/ResourceBroker.h"
#include "kernel/safety/SafetySupervisor.h"
#include "platform/arduino/BoardSafeOutputs.h"
#include "platform/arduino/BoardCc1101PassiveSpectrum.h"
#include "platform/arduino/BoardNrf24PassiveSpectrum.h"
#include "platform/arduino/BoardShieldReceiverProbe.h"
#include "platform/arduino/ArduinoFsSessionStoreIo.h"
#include "platform/arduino/ArduinoLittleFsSessionStoreIo.h"
#include "platform/arduino/BoardSdFilesystem.h"
#include "platform/arduino/BoardStorageAdapter.h"
#include "platform/arduino/BoardTouchInput.h"
#include "platform/arduino/BoardBlePassiveScanner.h"
#include "platform/arduino/BoardSdSpiTransport.h"
#include "platform/arduino/BoardWifiPassiveScanner.h"
#include "platform/arduino/BoardWifiPassiveCapture.h"
#include "platform/arduino/DisposableOtaLittleFs.h"
#include "platform/arduino/RamSessionStoreIo.h"
#include "services/diagnostics/BootReport.h"
#include "services/diagnostics/HilSession.h"
#include "services/survey/IngressTiming.h"
#include "services/survey/ObservationQueue.h"
#include "services/survey/SessionBatchPolicy.h"
#include "services/survey/SourceDegradation.h"
#include "services/survey/SourceTimeline.h"
#include "services/survey/SurveySession.h"
#include "storage/AtomicHead.h"
#include "storage/MediaDiscovery.h"
#include "storage/MountPolicy.h"
#include "storage/ProductStorePolicy.h"
#include "storage/ProductBootRetry.h"
#include "storage/ProductStartRetry.h"
#include "storage/SdReadOnlyProtocol.h"
#include "storage/SdIdentification.h"
#include "storage/SdIdentificationTransport.h"
#include "storage/SdSectorInspection.h"
#include "storage/SdSpiWireCodec.h"
#include "storage/SessionCodec.h"
#include "storage/SessionStore.h"
#include "storage/SessionStoreBoundary.h"
#include "storage/SessionStoreIoRouter.h"
#include "storage/StorageGuard.h"
#include "storage/StorageTiming.h"
#include "ui/Pcf8574ButtonInput.h"
#include "ui/TouchTargets.h"
#include "ui/LanguageController.h"
#include "ui/UiComponents.h"
#include "ui/UiController.h"
#include "ui/UiStrings.h"
#include "ui/VisualTheme.h"
#include "ui/fonts/RobotoCondensedGfx.h"

namespace {

using leshy1::boards::esp32_div_v2::BoardProfile;
using leshy1::apps::library::LibraryController;
using leshy1::apps::library::LibraryEntry;
using leshy1::apps::library::LibraryView;
using leshy1::apps::library::SessionCatalog;
using leshy1::apps::library::SessionIntegrity;
using leshy1::apps::capture::PcapExportResult;
using leshy1::apps::capture::SubGhzRawCapture;
using leshy1::apps::capture::SubGhzRawCapturePlan;
using leshy1::apps::capture::SubGhzRawCaptureState;
using leshy1::apps::capture::SubGhzRawRssiSample;
using leshy1::apps::capture::WifiFrameCapturePlan;
using leshy1::apps::capture::WifiFrameCaptureState;
using leshy1::apps::self_test::SelfTestController;
using leshy1::apps::self_test::SelfTestFacts;
using leshy1::apps::self_test::SelfTestMode;
using leshy1::apps::self_test::SelfTestReport;
using leshy1::apps::self_test::SelfTestResultStatus;
using leshy1::apps::self_test::SelfTestView;
using leshy1::apps::spectrum::Cc1101SpectrumController;
using leshy1::apps::spectrum::Cc1101SpectrumViewState;
using leshy1::apps::spectrum::Nrf24SpectrumController;
using leshy1::apps::spectrum::Nrf24SpectrumMetric;
using leshy1::apps::spectrum::Nrf24SpectrumViewState;
using leshy1::apps::spectrum::SpectrumDisplayMode;
using leshy1::apps::spectrum::SpectrumViewport;
using leshy1::apps::survey::SurveyController;
using leshy1::apps::survey::ObservationHistory;
using leshy1::apps::survey::SurveyFilter;
using leshy1::apps::survey::SurveyPipeline;
using leshy1::apps::survey::SurveyPipelineProgress;
using leshy1::apps::survey::SurveyPipelineStatus;
using leshy1::apps::survey::SurveySetupActivation;
using leshy1::apps::survey::SurveySetupView;
using leshy1::apps::survey::SurveySourceController;
using leshy1::apps::survey::SurveySourceKind;
using leshy1::apps::survey::SurveySourceOption;
using leshy1::apps::survey::SurveySourceScope;
using leshy1::apps::survey::SurveySourceState;
using leshy1::apps::survey::SurveyView;
using leshy1::apps::survey::SurveyWorkflow;
using leshy1::apps::survey::SurveyWorkflowState;
using leshy1::apps::survey::SurveyWorkflowStatus;
using leshy1::domain::apps::AppCatalog;
using leshy1::domain::apps::AppMenuItem;
using leshy1::domain::hardware::CapabilityRecord;
using leshy1::domain::hardware::CapabilityState;
using leshy1::domain::hardware::HardwareInventory;
using leshy1::domain::observations::Observation;
using leshy1::domain::observations::RadioKind;
using leshy1::drivers::ble::BleAdvertisementRecord;
using leshy1::drivers::radio::ShieldReceiverProbeReport;
using leshy1::drivers::radio::ShieldReceiverProbeStatus;
using leshy1::drivers::radio::Cc1101PassiveSample;
using leshy1::drivers::radio::Cc1101PassiveSpectrumPlan;
using leshy1::drivers::radio::Cc1101PassiveSpectrumReport;
using leshy1::drivers::radio::Cc1101PassiveSpectrumStatus;
using leshy1::drivers::radio::Nrf24PassiveSpectrumPlan;
using leshy1::drivers::radio::Nrf24PassiveSpectrumReport;
using leshy1::drivers::radio::Nrf24PassiveSpectrumStatus;
using leshy1::drivers::radio::Nrf24PassiveSweep;
using leshy1::drivers::wifi::WifiScanRecord;
using leshy1::kernel::runtime::AppRuntime;
using leshy1::kernel::runtime::LaunchStatus;
using leshy1::kernel::runtime::Resource;
using leshy1::kernel::runtime::ResourceBroker;
using leshy1::kernel::safety::SafetyReason;
using leshy1::kernel::safety::SafetyRetainedRecord;
using leshy1::kernel::safety::SafetyState;
using leshy1::kernel::safety::SafetySupervisor;
using leshy1::platform::arduino::BoardSafeOutputs;
using leshy1::platform::arduino::BoardCc1101PassiveSpectrum;
using leshy1::platform::arduino::BoardNrf24PassiveSpectrum;
using leshy1::platform::arduino::BoardShieldReceiverProbe;
using leshy1::platform::arduino::ArduinoFsSessionStoreIo;
using leshy1::platform::arduino::ArduinoFsSessionStoreWorkspace;
using leshy1::platform::arduino::ArduinoLittleFsSessionStoreIo;
using leshy1::platform::arduino::BoardSdFilesystem;
using leshy1::platform::arduino::BoardStorageAdapter;
using leshy1::platform::arduino::BoardTouchInput;
using leshy1::platform::arduino::TouchCalibrationSource;
using leshy1::platform::arduino::BoardBlePassiveScanner;
using leshy1::platform::arduino::BoardBlePassiveScanResult;
using leshy1::platform::arduino::BleRecordDisposition;
using leshy1::platform::arduino::BoardSdSpiTransport;
using leshy1::platform::arduino::BoardWifiPassiveScanner;
using leshy1::platform::arduino::BoardWifiPassiveCapture;
using leshy1::platform::arduino::BoardWifiPassiveScanResult;
using leshy1::platform::arduino::DisposableOtaLittleFs;
using leshy1::platform::arduino::WifiRecordDisposition;
using leshy1::platform::arduino::RamSessionStoreIo;
using leshy1::services::diagnostics::BootMetrics;
using leshy1::services::diagnostics::HilSession;
using leshy1::services::diagnostics::HilSessionStatus;
using leshy1::services::survey::SessionState;
using leshy1::services::survey::SessionStatus;
using leshy1::services::survey::CaptureMetadata;
using leshy1::services::survey::CaptureMetadataStatus;
using leshy1::services::survey::FramePayloadFormat;
using leshy1::services::survey::SourceFailureClass;
using leshy1::services::survey::SourceTimeline;
using leshy1::services::survey::SourceTimelineState;
using leshy1::services::survey::SourceTimelineStatus;
using leshy1::services::survey::SourceWindow;
using leshy1::services::survey::SourceWindowReason;
using leshy1::services::survey::SourceWindowState;
using leshy1::services::survey::SurveySession;
using leshy1::ui::UiAction;
using leshy1::ui::UiController;
using leshy1::ui::UiLanguage;
using leshy1::ui::UiTextId;
using leshy1::ui::UiTextRole;
using leshy1::ui::LanguageController;
using leshy1::ui::Pcf8574ButtonInput;
using leshy1::ui::TouchPoint;
using leshy1::ui::TouchTarget;
using leshy1::ui::TouchTargetLayout;
using leshy1::ui::visual::Layout;
using leshy1::ui::visual::Palette;
using leshy1::ui::visual::Components;
using leshy1::ui::visual::Rect;
using leshy1::ui::visual::Tone;

constexpr std::uint32_t kConsoleBaud = 115200;
constexpr std::uint32_t kI2cHz = 100000;
constexpr std::uint8_t kInputProbeMaxAttempts = 8;
constexpr std::uint32_t kInputProbeRetryDelayMs = 5;
constexpr leshy1::kernel::runtime::ResourceOwner kSdIdentificationOwner = 2;
constexpr leshy1::kernel::runtime::ResourceOwner kWifiIngressOwner = 3;
constexpr leshy1::kernel::runtime::ResourceOwner kBootCatalogOwner = 4;
constexpr leshy1::kernel::runtime::ResourceOwner kLittleFsHilOwner = 5;
constexpr std::size_t kSdThroughputSamples = 32;
constexpr std::size_t kWifiIngressMaxSamples = 32;
constexpr std::uint64_t kWifiIngressP99EncodedBytesPerSecond = 546;
constexpr std::uint32_t kStorageRateSafetyMultiplier = 4;
constexpr std::uint64_t kStorageRequiredEncodedBytesPerSecond =
    kWifiIngressP99EncodedBytesPerSecond * kStorageRateSafetyMultiplier;
constexpr std::uint64_t kProductSurveyCommitBytes = 64U * 1024U;
constexpr std::uint64_t kProductSurveyReserveBytes = 1024U * 1024U;
constexpr unsigned kWifiPersistMaxScans = 8;
constexpr const char* kFullGuidedDisposableRunId = "full-guided-v7";
constexpr std::uint64_t kFullGuidedDisposableBytes = 64U * 1024U;
constexpr std::uint64_t kFullGuidedDisposableReserve = 1024U * 1024U;
constexpr const char* kSdSessionStorePrefix =
    "storage.sd.session-store disposable-write ";
constexpr const char* kSdSessionThroughputPrefix =
    "storage.sd.session-store throughput disposable-write ";
constexpr const char* kSdSessionBatchThroughputPrefix =
    "storage.sd.session-store batch-throughput disposable-write ";
constexpr const char* kWifiPersistPrefix =
    "survey.wifi.passive-persist disposable-write ";
constexpr const char* kSdSessionResetPrefix =
    "storage.sd.session-store reset disposable-write ";
constexpr const char* kSdSessionRecoverPrefix =
    "storage.sd.session-store recover disposable-read-only ";
constexpr const char* kSdSessionPowerCutPrefix =
    "storage.sd.session-store power-cut disposable-write ";
constexpr const char* kSdSessionPowerCutRecoverPrefix =
    "storage.sd.session-store power-cut-recover disposable-read-only ";
constexpr const char* kSdReadOnlyMountPrefix =
    "storage.sd.readonly-mount disposable-read-only ";
constexpr const char* kWifiIngressPrefix =
    "survey.wifi.passive-ingress measure passive-only ";
constexpr const char* kProductBootstrapPrefix =
    "storage.product.bootstrap disposable-write ";
constexpr const char* kProductEnrollPrefix =
    "storage.product.enroll disposable-read-only ";
constexpr const char* kLittleFsParityPrefix =
    "storage.littlefs.parity disposable-ota1 ";
constexpr const char* kLittleFsResetPrefix =
    "storage.littlefs.reset disposable-ota1 ";
constexpr const char* kLittleFsResetRecoverPrefix =
    "storage.littlefs.reset recover read-only ";
constexpr const char* kProductEnrollmentNamespace = "leshy1";
constexpr const char* kProductEnrollmentKey = "sd.cid.v1";
constexpr const char* kUiPreferencesNamespace = "leshy1-ui";
constexpr const char* kUiLanguageKey = "lang.v1";
HardwareInventory inventory;
AppCatalog appCatalog;
ResourceBroker resourceBroker;
AppRuntime appRuntime(resourceBroker);
SurveySession surveySession;
SurveyController surveyController(surveySession);
SurveySourceController surveySourceController;
SurveySession librarySession;
SurveySession littleFsResetSession;
LibraryController libraryController;
SessionCatalog sessionCatalog;
leshy1::services::survey::ObservationQueue surveyIngressQueue;
leshy1::storage::SessionStoreWorkspace sessionStoreWorkspace;
ArduinoFsSessionStoreWorkspace sdSessionStoreIoWorkspace;
ArduinoFsSessionStoreWorkspace productSurveyIoWorkspace;
RamSessionStoreIo ramSessionStore;
leshy1::storage::SessionStoreIoRouter surveyStoreRouter(ramSessionStore);
ArduinoFsSessionStoreIo productSurveyStore(productSurveyIoWorkspace);
BoardSdFilesystem productSurveyFilesystem;
SurveyWorkflow surveyWorkflow(surveyController, surveyStoreRouter,
                              sessionStoreWorkspace, librarySession,
                              libraryController, false, true);
SurveyPipeline surveyPipeline(surveyWorkflow, surveyIngressQueue);
SourceTimeline productSurveyTimeline;
BoardStorageAdapter boardStorageAdapter;
leshy1::storage::MediaDiscovery storageDiscovery;
bool storageDiscoveryReady = false;
bool surveyDemoReady = false;
bool libraryDemoReady = false;
const char* lastRuntimeEvent = "idle";
BootMetrics bootMetrics;
char runningAppElfSha256[65] = {};
HilSession hilSession;
TFT_eSPI display;
BoardTouchInput boardTouchInput;
bool touchCalibrationRequiredAtBoot = false;
bool touchCalibrationSucceededAtBoot = false;
UiController uiController;
LanguageController languageController;
SelfTestController selfTestController;
constexpr std::uint8_t kDevicePage = 9;
constexpr std::uint8_t kAboutPage = 10;
constexpr std::uint8_t kDeviceItemCount = 4;
std::uint8_t deviceSelection = 0;
ShieldReceiverProbeReport shieldReceiverProbeReport;
Nrf24SpectrumController nrf24SpectrumController;
Nrf24PassiveSpectrumReport nrf24SpectrumReport;
BoardNrf24PassiveSpectrum boardNrf24Spectrum;
Cc1101SpectrumController cc1101SpectrumController;
Cc1101PassiveSpectrumReport cc1101SpectrumReport;
BoardCc1101PassiveSpectrum boardCc1101Spectrum;
SpectrumViewport spectrumViewport;
std::array<std::uint8_t, SpectrumViewport::kMaxBins> spectrumIntensity{};
std::array<std::uint16_t, Layout::ScreenWidth> spectrumScanline{};
enum class FullGuidedRfStep : std::uint8_t {
    Idle,
    Nrf24Sweep,
    Cc1101Sweep,
    Complete,
    Failed,
    Cancelled,
};
const char* fullGuidedRfStepName(FullGuidedRfStep step) {
    switch (step) {
        case FullGuidedRfStep::Idle: return "idle";
        case FullGuidedRfStep::Nrf24Sweep: return "nrf24_sweep";
        case FullGuidedRfStep::Cc1101Sweep: return "cc1101_sweep";
        case FullGuidedRfStep::Complete: return "complete";
        case FullGuidedRfStep::Failed: return "failed";
        case FullGuidedRfStep::Cancelled: return "cancelled";
    }
    return "unknown";
}
struct FullGuidedRfState final {
    FullGuidedRfStep step = FullGuidedRfStep::Idle;
    bool resourceAcquired = false;
    bool resourceReleased = true;
    bool cleanupComplete = true;
    bool nrf24Complete = false;
    bool nrf24Passed = false;
    bool cc1101Complete = false;
    bool cc1101Passed = false;
    std::uint8_t cc1101Bins = 0;
};
