anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
FullGuidedRfState fullGuidedRfState;
Nrf24PassiveSpectrumReport fullGuidedNrf24Report;
Cc1101PassiveSpectrumReport fullGuidedCc1101Report;
std::uint64_t fullGuidedRfStartAfterUs = 0;
enum class FullGuidedArtifactStep : std::uint8_t {
    Idle,
    Recover,
    LibraryJson,
    LibraryCsv,
    CapturePcap,
    DisposableCommit,
    DisposableRemountExport,
    DisposableCleanup,
    ProductVerify,
    Complete,
    Failed,
    Cancelled,
};
const char* fullGuidedArtifactStepName(FullGuidedArtifactStep step) {
    switch (step) {
        case FullGuidedArtifactStep::Idle: return "idle";
        case FullGuidedArtifactStep::Recover: return "recover";
        case FullGuidedArtifactStep::LibraryJson: return "library_json";
        case FullGuidedArtifactStep::LibraryCsv: return "library_csv";
        case FullGuidedArtifactStep::CapturePcap: return "capture_pcap";
        case FullGuidedArtifactStep::DisposableCommit:
            return "disposable_commit";
        case FullGuidedArtifactStep::DisposableRemountExport:
            return "disposable_remount_export";
        case FullGuidedArtifactStep::DisposableCleanup:
            return "disposable_cleanup";
        case FullGuidedArtifactStep::ProductVerify: return "product_verify";
        case FullGuidedArtifactStep::Complete: return "complete";
        case FullGuidedArtifactStep::Failed: return "failed";
        case FullGuidedArtifactStep::Cancelled: return "cancelled";
    }
    return "unknown";
}
struct FullGuidedArtifactState final {
    FullGuidedArtifactStep step = FullGuidedArtifactStep::Idle;
    char expectedFingerprint[33] = {};
    bool recoveryComplete = false;
    bool recoveryPassed = false;
    bool libraryComplete = false;
    bool libraryPassed = false;
    bool captureComplete = false;
    bool captureApplicable = false;
    bool capturePassed = false;
    bool cleanupComplete = true;
    std::uint32_t generationBefore = 0;
    std::uint32_t generationAfter = 0;
    std::size_t observationsBefore = 0;
    std::size_t observationsAfter = 0;
    std::size_t jsonBytes = 0;
    std::size_t metadataBytes = 0;
    std::size_t csvBytes = 0;
    std::size_t csvRecords = 0;
    std::size_t csvIndex = 0;
    std::size_t pcapBytes = 0;
    std::size_t pcapFrames = 0;
    std::uint32_t pcapFnv1a = 2166136261U;
    std::uint32_t blockedWriteAttempts = 0;
    bool disposableCommitComplete = false;
    bool disposableCommitPassed = false;
    bool disposableRemountComplete = false;
    bool disposableRemountPassed = false;
    bool disposableExportComplete = false;
    bool disposableExportPassed = false;
    bool disposableCleanupComplete = false;
    bool disposableCleanupPassed = false;
    bool productVerifyComplete = false;
    bool productVerifyPassed = false;
    bool disposableResourceAcquired = false;
    bool disposableResourceReleased = true;
    bool disposableIdentityPassed = false;
    bool scratchPreexisting = false;
    bool scratchCreated = false;
    bool scratchRemoved = false;
    bool workflowPassed = true;
    char disposableObservedFingerprint[33] = {};
    char disposableScratchPath[leshy1::storage::kScratchPathMax] = {};
    std::uint32_t disposableGeneration = 0;
    std::size_t disposableObservations = 0;
    std::size_t disposableJsonBytes = 0;
    std::size_t disposableMetadataBytes = 0;
    std::size_t disposableCsvBytes = 0;
    std::size_t disposableCsvRecords = 0;
    std::uint64_t disposableStorageWriteBytes = 0;
    std::uint32_t disposableStorageWriteCalls = 0;
    std::uint32_t disposableFileSyncs = 0;
    std::uint32_t disposableDirectorySyncs = 0;
    std::uint16_t disposableFilesRemoved = 0;
    std::uint32_t productGenerationFinal = 0;
    std::size_t productObservationsFinal = 0;
};
struct FullGuidedPcapSink final {
    std::size_t bytes = 0;
    std::uint32_t fnv1a = 2166136261U;
};
bool writeFullGuidedPcapBytes(const std::uint8_t* data, std::size_t size,
                              void* context) {
    if ((data == nullptr && size != 0) || context == nullptr) return false;
    auto* sink = static_cast<FullGuidedPcapSink*>(context);
    for (std::size_t index = 0; index < size; ++index) {
        sink->fnv1a ^= data[index];
        sink->fnv1a *= 16777619U;
    }
    sink->bytes += size;
    return true;
}
FullGuidedArtifactState fullGuidedArtifactState;
std::uint64_t fullGuidedArtifactStartAfterUs = 0;
enum class RfSpectrumKind : std::uint8_t {
    Nrf24,
    Cc1101,
};
enum class RfSpectrumView : std::uint8_t {
    None,
    SourceMenu,
    SubGhzMenu,
    CcBandMenu,
    SubGhzCaptureBandMenu,
    SubGhzCaptureLive,
    Live,
};
const char* rfSpectrumViewName(RfSpectrumView view) {
    switch (view) {
        case RfSpectrumView::None: return "none";
        case RfSpectrumView::SourceMenu: return "source_menu";
        case RfSpectrumView::SubGhzMenu: return "subghz_menu";
        case RfSpectrumView::CcBandMenu: return "cc_band_menu";
        case RfSpectrumView::SubGhzCaptureBandMenu:
            return "subghz_capture_band_menu";
        case RfSpectrumView::SubGhzCaptureLive:
            return "subghz_capture_live";
        case RfSpectrumView::Live: return "live";
    }
    return "unknown";
}
RfSpectrumView rfSpectrumView = RfSpectrumView::None;
RfSpectrumKind rfSpectrumKind = RfSpectrumKind::Nrf24;
std::uint8_t rfSpectrumSelection = 0;
std::uint8_t subGhzModeSelection = 0;
leshy1::drivers::radio::Cc1101SpectrumBand rfCcBandSelection =
    leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
std::uint64_t nextSpectrumUiRefreshUs = 0;
SubGhzRawCapture subGhzRawCapture;
std::uint64_t nextSubGhzCaptureUiRefreshUs = 0;
std::uint64_t spectrumWaterfallStartedUs = 0;
std::uint64_t spectrumWaterfallCompletedUs = 0;
std::uint32_t spectrumWaterfallRowsEmitted = 0;
std::uint64_t spectrumWaterfallPreviousRowUs = 0;
std::uint64_t spectrumWaterfallRowIntervalTotalUs = 0;
std::uint64_t spectrumWaterfallRowIntervalMaxUs = 0;
std::uint64_t spectrumWaterfallPushTotalUs = 0;
std::uint64_t spectrumWaterfallPushMaxUs = 0;
std::uint64_t spectrumWaterfallRenderTotalUs = 0;
std::uint64_t spectrumWaterfallRenderMaxUs = 0;
std::uint64_t spectrumWaterfallServiceMaxUs = 0;
std::uint64_t nrf24SpectrumChunkMaxUs = 0;
std::uint64_t spectrumLoopPreviousUs = 0;
std::uint64_t spectrumLoopIntervalTotalUs = 0;
std::uint64_t spectrumLoopIntervalMaxUs = 0;
std::uint64_t spectrumLoopCount = 0;
std::uint64_t spectrumTouchPollTotalUs = 0;
std::uint64_t spectrumTouchPollMaxUs = 0;
std::uint64_t spectrumTouchPollCount = 0;
std::uint32_t spectrumWaterfallSourceSweepBaseline = 0;
std::uint32_t spectrumWaterfallLastSourceSweep = 0;
std::uint32_t spectrumWaterfallMeasurementsConsumed = 0;
std::uint32_t spectrumWaterfallMeasurementsSkipped = 0;
std::uint64_t spectrumWaterfallFillElapsedUs() {
    return spectrumWaterfallCompletedUs >= spectrumWaterfallStartedUs
        ? spectrumWaterfallCompletedUs - spectrumWaterfallStartedUs : 0;
}

void resetSpectrumWaterfallTiming() {
    spectrumWaterfallStartedUs = 0;
    spectrumWaterfallCompletedUs = 0;
    spectrumWaterfallRowsEmitted = 0;
    spectrumWaterfallPreviousRowUs = 0;
    spectrumWaterfallRowIntervalTotalUs = 0;
    spectrumWaterfallRowIntervalMaxUs = 0;
    spectrumWaterfallPushTotalUs = 0;
    spectrumWaterfallPushMaxUs = 0;
    spectrumWaterfallRenderTotalUs = 0;
    spectrumWaterfallRenderMaxUs = 0;
    spectrumWaterfallServiceMaxUs = 0;
    spectrumLoopPreviousUs = 0;
    spectrumLoopIntervalTotalUs = 0;
    spectrumLoopIntervalMaxUs = 0;
    spectrumLoopCount = 0;
    spectrumTouchPollTotalUs = 0;
    spectrumTouchPollMaxUs = 0;
    spectrumTouchPollCount = 0;
    spectrumWaterfallSourceSweepBaseline = 0;
    spectrumWaterfallLastSourceSweep = 0;
    spectrumWaterfallMeasurementsConsumed = 0;
    spectrumWaterfallMeasurementsSkipped = 0;
}

