anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void armSpectrumWaterfallForCurrentReceiver();
BoardWifiPassiveCapture wifiFrameCapture;
constexpr WifiFrameCapturePlan kProductWifiFrameCapturePlan{};
std::uint64_t nextCaptureUiRefreshUs = 0;
enum class CapturePersistState : std::uint8_t {
    Result,
    Confirm,
    Saving,
    Saved,
    Failed,
};
struct CaptureStoreEvent final {
    const char* status = "not_started";
    bool valid = false;
    bool cleanupComplete = false;
    std::uint32_t generation = 0;
    leshy1::storage::SessionStoreStatus storeStatus =
        leshy1::storage::SessionStoreStatus::InvalidArgument;
};
CapturePersistState capturePersistState = CapturePersistState::Result;
const char* capturePersistStatus = "volatile";
std::uint32_t capturePersistGeneration = 0;
QueueHandle_t captureStoreEvents = nullptr;
TaskHandle_t captureStoreTaskHandle = nullptr;
CapturePersistState subGhzCapturePersistState = CapturePersistState::Result;
const char* subGhzCapturePersistStatus = "volatile";
std::uint32_t subGhzCapturePersistGeneration = 0;
QueueHandle_t subGhzCaptureStoreEvents = nullptr;
TaskHandle_t subGhzCaptureStoreTaskHandle = nullptr;
const char* capturePersistStateName(CapturePersistState state) {
    switch (state) {
        case CapturePersistState::Result: return "volatile";
        case CapturePersistState::Confirm: return "confirm";
        case CapturePersistState::Saving: return "saving";
        case CapturePersistState::Saved: return "saved";
        case CapturePersistState::Failed: return "failed";
    }
    return "failed";
}
constexpr std::size_t kConsoleCommandCapacity = 192;
constexpr char kLongestConsoleCommand[] =
    "storage.littlefs.reset recover read-only "
    "ffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff "
    "s3-littlefs-reset-20260818-b6 6";
static_assert(sizeof(kLongestConsoleCommand) <= kConsoleCommandCapacity,
              "console command buffer cannot hold the longest command");
char usbCommand[kConsoleCommandCapacity] = {};
char uartCommand[kConsoleCommandCapacity] = {};
std::size_t usbLength = 0;
std::size_t uartLength = 0;
std::uint8_t lastInputRaw = 0xFF;
Pcf8574ButtonInput physicalButtonInput;

struct PhysicalInputEvent final {
    UiAction action = UiAction::Unknown;
    std::uint8_t raw = 0xFF;
    std::uint32_t atMs = 0;
    std::uint64_t atUs = 0;
};

constexpr UBaseType_t kPhysicalInputQueueCapacity = 64;
QueueHandle_t physicalInputEvents = nullptr;
TaskHandle_t physicalInputTaskHandle = nullptr;
portMUX_TYPE physicalInputMux = portMUX_INITIALIZER_UNLOCKED;
std::uint32_t physicalInputQueueDrops = 0;
std::uint32_t physicalInputQueueHighWater = 0;
std::uint32_t physicalInputDispatchedPresses = 0;
UiAction lastPhysicalInputAction = UiAction::Unknown;
bool lastPhysicalInputChanged = false;
std::uint64_t lastPhysicalInputQueueUs = 0;
std::uint64_t maximumPhysicalInputQueueUs = 0;
std::uint64_t lastPhysicalInputRenderUs = 0;
std::uint64_t lastPhysicalInputEndToEndUs = 0;
std::uint64_t maximumPhysicalInputEndToEndUs = 0;
bool physicalInputTaskStarted = false;
std::uint32_t touchHandledPresses = 0;
std::uint32_t touchMissedPresses = 0;
std::uint32_t syntheticTouchPresses = 0;
TouchPoint lastTouchPoint{};
bool lastTouchChanged = false;

struct ProductBootRecoveryState final {
    const char* status = "not_started";
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    bool enrolled = false;
    bool fingerprintMatched = false;
    bool mountedReadOnly = false;
    bool readOnlyGuaranteed = false;
    bool rootExists = false;
    bool opened = false;
    bool catalogAdmitted = false;
    bool cleanupComplete = false;
    leshy1::storage::ProductStoreAccessStatus permitStatus =
        leshy1::storage::ProductStoreAccessStatus::MissingMedia;
    leshy1::apps::library::SessionCatalogResult catalog{};
    std::uint32_t ownedDuring = 0;
    std::uint32_t ownedAfter = 0;
    std::uint32_t blockedWriteAttempts = 0;
    std::uint8_t attempts = 0;
    std::uint8_t transientRetries = 0;
    std::uint8_t timeoutRestarts = 0;
};

ProductBootRecoveryState productBootRecovery;
constexpr std::uint32_t kProductBootRetryRtcMagic = 0x4C425231U;
constexpr std::uint32_t kProductBootWatchdogTestRtcMagic = 0x4C425754U;
RTC_NOINIT_ATTR std::uint32_t productBootRetryRtcMagic;
RTC_NOINIT_ATTR volatile std::uint32_t productBootRetryRestarts;
RTC_NOINIT_ATTR std::uint32_t productBootRetryAppIdentity;
RTC_NOINIT_ATTR volatile std::uint32_t productBootRetryTimeouts;
RTC_NOINIT_ATTR std::uint32_t productBootWatchdogTestRtcState;
RTC_NOINIT_ATTR volatile SafetyRetainedRecord safetyRetainedRtc;
volatile std::uint32_t runtimeSafetyWatchdogArmed = 0;
volatile std::uint32_t runtimeSafetyAppIdentity = 0;
volatile std::uint32_t runtimeSafetyNextTripCount = 1;
volatile std::uint32_t runtimeSafetyNextQuiesceCount = 1;
SafetySupervisor safetySupervisor;
std::uint32_t runningAppIdentity = 0;
bool runtimeSafetyWatchdogReady = false;
constexpr std::uint32_t kLittleFsResetRtcMagic = 0x4C465231U;
struct LittleFsResetRtcState final {
    std::uint32_t magic;
    std::uint32_t boundary;
    std::uint8_t token[32];
};
RTC_NOINIT_ATTR LittleFsResetRtcState littleFsResetRtcState;
TaskHandle_t productBootRecoveryWatchdogTask = nullptr;
bool productBootRecoveryTaskWatchdogAdded = false;
volatile std::uint32_t productBootRecoveryWatchdogArmed = 0;

static_assert(CONFIG_ESP_TASK_WDT_EN && CONFIG_ESP_TASK_WDT_INIT &&
                  CONFIG_ESP_TASK_WDT_PANIC,
              "boot recovery requires the panic-enabled Task WDT");
static_assert(
    leshy1::storage::kProductBootRecoveryHardwareWatchdogMs ==
        CONFIG_ESP_TASK_WDT_TIMEOUT_S * 1000U,
    "boot recovery hardware watchdog policy must match the SDK configuration");

struct ProductSurveyRuntimeState final {
    const char* status = "idle";
    bool selected = false;
    bool backendOpen = false;
    bool identityCleanupComplete = true;
    bool filesystemAttempted = false;
    bool scannerCleanupComplete = true;
    bool cleanupComplete = true;
    std::uint8_t identityAttempts = 0;
    std::uint8_t identityTransientRetries = 0;
    leshy1::storage::SdTransportRunStatus identityStatus =
        leshy1::storage::SdTransportRunStatus::InvalidPlan;
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    std::uint64_t cardCapacityBytes = 0;
    std::uint64_t cachedFreeBytes = 0;
    leshy1::storage::ProductStoreAccessStatus storeStatus =
        leshy1::storage::ProductStoreAccessStatus::MissingMedia;
    leshy1::apps::survey::ProductSurveyAdmissionStatus admissionStatus =
        leshy1::apps::survey::ProductSurveyAdmissionStatus::ExplicitStartRequired;
    BoardWifiPassiveScanResult scan{};
    BoardBlePassiveScanResult bleScan{};
    bool workerReady = false;
    bool sourceActive = false;
    bool sourceStartAttempted = false;
    bool sourceFailureInjected = false;
    bool runtimeSourceFailureInjected = false;
    std::uint8_t runtimeSourceFailureInjectedMask = 0;
    bool storeOpenAttempted = false;
    std::uint64_t storeBytesWritten = 0;
    bool cancelRequestedDuringScan = false;
    std::uint32_t scanCycles = 0;
    std::uint32_t wifiScanCycles = 0;
    std::uint32_t bleScanCycles = 0;
    std::uint64_t startActionUs = 0;
    std::uint64_t stopActionUs = 0;
    std::uint8_t selectedSourceMask = 0;
    std::uint8_t activeSourceMask = 0;
    std::uint8_t unavailableSourceMask = 0;
    const char* timelineStatus = "idle";
    const char* timelineArchiveStatus = "idle";
    const char* timelineFailureStatus = "none";
    const char* timelineFailureStage = "none";
    std::uint64_t timelineFailureEventUs = 0;
    std::uint64_t timelineFailureLatestUs = 0;
    bool timelineHealthy = true;
    std::uint32_t timelineArchivedWindows = 0;
};

