anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool prepareSurveyDemo() {
    return surveyPipeline.resetToSetup() == SurveyPipelineStatus::Ready;
}

bool prepareLibraryDemo() {
    librarySession.reset();
    if (librarySession.start("golden-wifi-lib", 1000) != SessionStatus::Started ||
        !appendGoldenObservations(librarySession) ||
        librarySession.stop(3000) != SessionStatus::Stopped) {
        return false;
    }
    ramSessionStore.reset();
    const leshy1::storage::SessionStoreCommitResult committed =
        leshy1::storage::commitNextSession(ramSessionStore, sessionStoreWorkspace,
                                           librarySession);
    if (!committed.complete()) return false;
    libraryController.clear();
    const leshy1::apps::library::SessionCatalogResult cataloged =
        sessionCatalog.recoverLatest(ramSessionStore, sessionStoreWorkspace,
                                     librarySession, libraryController, false,
                                     true);
    return cataloged.admitted() && cataloged.generation == 1 &&
           cataloged.observations == 3;
}

bool exactCidFingerprint(const char* value) {
    if (value == nullptr || std::strlen(value) != 32) return false;
    for (std::size_t index = 0; index < 32; ++index) {
        const char current = value[index];
        if (!((current >= '0' && current <= '9') ||
              (current >= 'A' && current <= 'F'))) {
            return false;
        }
    }
    return true;
}

void formatCidFingerprint(const leshy1::storage::SdIdentity& identity,
                          char* output, std::size_t capacity) {
    if (output == nullptr || capacity < 33) return;
    output[0] = '\0';
    for (std::size_t index = 0; index < identity.cid.size(); ++index) {
        std::snprintf(output + index * 2, capacity - index * 2, "%02X",
                      static_cast<unsigned>(identity.cid[index]));
    }
}

bool loadProductFingerprint(char* output, std::size_t capacity) {
    if (output == nullptr || capacity < 33) return false;
    output[0] = '\0';
    Preferences preferences;
    if (!preferences.begin(kProductEnrollmentNamespace, true)) return false;
    const std::size_t stored = preferences.getBytesLength(kProductEnrollmentKey);
    const std::size_t read = stored == 33
        ? preferences.getBytes(kProductEnrollmentKey, output, 33) : 0;
    preferences.end();
    if (read != 33 || output[32] != '\0' || !exactCidFingerprint(output)) {
        output[0] = '\0';
        return false;
    }
    return true;
}

bool saveProductFingerprint(const char* fingerprint) {
    if (!exactCidFingerprint(fingerprint)) return false;
    Preferences preferences;
    if (!preferences.begin(kProductEnrollmentNamespace, false)) return false;
    const std::size_t written = preferences.putBytes(
        kProductEnrollmentKey, fingerprint, 33);
    preferences.end();
    char verified[33] = {};
    return written == 33 && loadProductFingerprint(verified, sizeof(verified)) &&
           std::strcmp(verified, fingerprint) == 0;
}

bool clearProductFingerprint() {
    char existing[33] = {};
    if (!loadProductFingerprint(existing, sizeof(existing))) return true;
    Preferences preferences;
    if (!preferences.begin(kProductEnrollmentNamespace, false)) return false;
    const bool removed = preferences.remove(kProductEnrollmentKey);
    preferences.end();
    char verified[33] = {};
    return removed && !loadProductFingerprint(verified, sizeof(verified));
}

UiLanguage loadUiLanguage() {
    Preferences preferences;
    if (!preferences.begin(kUiPreferencesNamespace, true)) {
        return UiLanguage::English;
    }
    const std::uint8_t stored = preferences.getUChar(kUiLanguageKey, 0);
    preferences.end();
    return stored == static_cast<std::uint8_t>(UiLanguage::Russian)
               ? UiLanguage::Russian
               : UiLanguage::English;
}

bool saveUiLanguage(UiLanguage language) {
    Preferences preferences;
    if (!preferences.begin(kUiPreferencesNamespace, false)) return false;
    const std::size_t written = preferences.putUChar(
        kUiLanguageKey, static_cast<std::uint8_t>(language));
    preferences.end();
    return written == sizeof(std::uint8_t);
}

bool closeProductSurveyBackend() {
    productSurveyRuntime.storeBytesWritten = productSurveyStore.bytesWritten();
    productSurveyStore.end();
    const bool filesystemWasMounted = productSurveyFilesystem.mounted();
    if (filesystemWasMounted) productSurveyFilesystem.end();
    surveyStoreRouter.bind(ramSessionStore);
    productSurveyRuntime.backendOpen = false;
    const bool filesystemCleanup =
        !productSurveyRuntime.filesystemAttempted ||
        productSurveyFilesystem.cleanupComplete();
    productSurveyRuntime.cleanupComplete =
        productSurveyRuntime.identityCleanupComplete &&
        productSurveyRuntime.scannerCleanupComplete && filesystemCleanup &&
        !productSurveyFilesystem.mounted() &&
        surveyStoreRouter.boundTo(ramSessionStore);
    return productSurveyRuntime.cleanupComplete;
}

ProductSurveyWorkerControl productSurveyControl() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const ProductSurveyWorkerControl control = productSurveyWorkerControl;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return control;
}

void setProductSurveyControl(ProductSurveyWorkerControl control) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyWorkerControl = control;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool transitionProductSurveyControl(ProductSurveyWorkerControl expected,
                                    ProductSurveyWorkerControl next) {
    bool changed = false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (productSurveyWorkerControl == expected) {
        productSurveyWorkerControl = next;
        changed = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return changed;
}

bool productSurveyStopRequested() {
    const ProductSurveyWorkerControl control = productSurveyControl();
    return control == ProductSurveyWorkerControl::PauseRequested ||
           control == ProductSurveyWorkerControl::StopRequested ||
           control == ProductSurveyWorkerControl::CancelRequested;
}

bool productSurveyCancelRequested() {
    return productSurveyControl() ==
           ProductSurveyWorkerControl::CancelRequested;
}

bool productSurveyScanActive() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool active = productSurveyWorkerScanActive;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return active;
}

bool productSurveySourceUnavailableInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = productSurveySourceUnavailableOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

void setProductSurveySourceUnavailableInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveySourceUnavailableOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool consumeProductSurveySourceUnavailableInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = productSurveySourceUnavailableOnce;
    productSurveySourceUnavailableOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

std::uint8_t productSurveyRuntimeUnavailableInjectionMask() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const std::uint8_t mask = productSurveyRuntimeUnavailableOnceMask;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return mask;
}

void setProductSurveyRuntimeUnavailableInjection(std::uint8_t mask) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyRuntimeUnavailableOnceMask = static_cast<std::uint8_t>(
        mask & leshy1::services::survey::kSupportedSourceMask);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool consumeProductSurveyRuntimeUnavailableInjection(RadioKind source) {
    const std::uint8_t mask = leshy1::services::survey::sourceMask(source);
    bool injected = false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if ((productSurveyRuntimeUnavailableOnceMask & mask) != 0) {
        productSurveyRuntimeUnavailableOnceMask = static_cast<std::uint8_t>(
            productSurveyRuntimeUnavailableOnceMask &
            static_cast<std::uint8_t>(~mask));
        injected = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

