anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    productSurveyStore.end();
    if (productSurveyFilesystem.mounted()) productSurveyFilesystem.end();
    const bool filesystemCleanup = !filesystemAttempted ||
        productSurveyFilesystem.cleanupComplete();
    event.cleanupComplete = identityCleanupComplete && filesystemCleanup &&
        !productSurveyFilesystem.mounted();
    if (!event.cleanupComplete) {
        event.valid = false;
        event.status = "cleanup_failed";
    }
    if (subGhzCaptureStoreEvents != nullptr) {
        xQueueSend(subGhzCaptureStoreEvents, &event, portMAX_DELAY);
    }
    vTaskDelete(nullptr);
}

bool requestSubGhzRawCapturePersist() {
    if (subGhzCapturePersistState != CapturePersistState::Result ||
        subGhzRawCapture.stats().state !=
            SubGhzRawCaptureState::Complete ||
        subGhzRawCapture.pulseCount() == 0) {
        return false;
    }
    if (subGhzCaptureStoreEvents == nullptr ||
        subGhzCaptureStoreTaskHandle != nullptr) {
        subGhzCapturePersistState = CapturePersistState::Failed;
        subGhzCapturePersistStatus = "worker_unavailable";
        lastRuntimeEvent = "subghz_raw_store_worker_unavailable";
        return true;
    }
    const auto storageResources =
        leshy1::kernel::runtime::resourceMask(Resource::Storage);
    if (!resourceBroker.acquire(AppRuntime::kForegroundOwner,
                                storageResources)) {
        subGhzCapturePersistState = CapturePersistState::Failed;
        subGhzCapturePersistStatus = "resources_busy";
        lastRuntimeEvent = "subghz_raw_store_resources_busy";
        return true;
    }
    subGhzCapturePersistState = CapturePersistState::Saving;
    subGhzCapturePersistStatus = "saving";
    const bool started = xTaskCreatePinnedToCore(
        runSubGhzCaptureStoreWorker, "leshy-sub-store", 8192, nullptr, 1,
        &subGhzCaptureStoreTaskHandle, 0) == pdPASS;
    if (!started) {
        resourceBroker.release(AppRuntime::kForegroundOwner,
                               storageResources);
        subGhzCaptureStoreTaskHandle = nullptr;
        subGhzCapturePersistState = CapturePersistState::Failed;
        subGhzCapturePersistStatus = "worker_unavailable";
        lastRuntimeEvent = "subghz_raw_store_worker_unavailable";
    } else {
        lastRuntimeEvent = "subghz_raw_saving";
    }
    return true;
}

void serviceSubGhzRawCapturePersist() {
    if (subGhzCaptureStoreEvents == nullptr) return;
    CaptureStoreEvent event;
    if (xQueueReceive(subGhzCaptureStoreEvents, &event, 0) != pdTRUE) return;
    subGhzCaptureStoreTaskHandle = nullptr;
    resourceBroker.release(
        AppRuntime::kForegroundOwner,
        leshy1::kernel::runtime::resourceMask(Resource::Storage));
    const bool admitted = event.valid && event.cleanupComplete &&
        libraryController.replaceWithOwnedCopy(
            sessionStoreWorkspace.validationSession, librarySession,
            event.generation, SessionIntegrity::Valid, true, false);
    subGhzCapturePersistState = admitted ? CapturePersistState::Saved
                                        : CapturePersistState::Failed;
    subGhzCapturePersistStatus = admitted ? "saved" : event.status;
    subGhzCapturePersistGeneration = admitted ? event.generation : 0;
    lastRuntimeEvent = admitted ? "subghz_raw_saved"
                                : "subghz_raw_store_failed";
    if (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive) {
        renderInteractiveScreen();
    }
}

void releaseProductSurveyAfterTerminal(const char* status, bool returnHome) {
    if (surveyWorkflow.state() == SurveyWorkflowState::Running ||
        surveyWorkflow.state() == SurveyWorkflowState::Setup) {
        surveyPipeline.cancel();
    }
    closeProductSurveyBackend();
    productSurveyRuntime.status = productSurveyRuntime.cleanupComplete
                                      ? status
                                      : "cleanup_failed";
    lastRuntimeEvent = productSurveyRuntime.status;
    if (returnHome && !uiController.isRoot() && uiController.page() == 2) {
        uiController.apply(UiAction::Back,
                           static_cast<std::uint8_t>(appCatalog.size()), false);
    }
    if (appRuntime.running()) appRuntime.stop();
    setProductSurveyControl(ProductSurveyWorkerControl::Idle);
    renderInteractiveScreen();
}

void serviceProductSurveyWorker() {
    if (productSurveyWorkerEvents == nullptr) return;
    bool render = false;
    ProductSurveyWorkerEvent event;
    while (xQueueReceive(productSurveyWorkerEvents, &event, 0) == pdTRUE) {
        applyProductSurveyWorkerReport(event.report);
        if (event.kind != ProductSurveyWorkerEventKind::ScanStarted) {
            productSurveyRuntime.scan = event.scan;
            productSurveyRuntime.bleScan = event.bleScan;
            productSurveyRuntime.scanCycles = event.scanCycles;
            if (event.source == RadioKind::Wifi) {
                productSurveyRuntime.wifiScanCycles = event.sourceScanCycles;
            } else {
                productSurveyRuntime.bleScanCycles = event.sourceScanCycles;
            }
        }
        if (event.kind == ProductSurveyWorkerEventKind::Prepared) {
            std::uint64_t startedUs = event.eventUs;
            if (startedUs == 0) startedUs = 1;
            const SurveyPipelineStatus pipelineStarted = surveyPipeline.start(
                "product-passive-live", startedUs);
            const CaptureMetadataStatus captureConfigured =
                pipelineStarted == SurveyPipelineStatus::Started
                    ? surveySession.configureCaptureMetadata(
                          productCaptureMetadata(
                              productSurveyRuntime.selectedSourceMask))
                    : CaptureMetadataStatus::InvalidState;
            const SourceTimelineStatus timelineStarted =
                pipelineStarted == SurveyPipelineStatus::Started &&
                        captureConfigured == CaptureMetadataStatus::Configured
                    ? productSurveyTimeline.start(
                          productSurveyRuntime.selectedSourceMask, startedUs)
                    : SourceTimelineStatus::InvalidState;
            const auto archiveStarted =
                pipelineStarted == SurveyPipelineStatus::Started &&
                        timelineStarted == SourceTimelineStatus::Started
                    ? surveySession.startTimeline(
                          productSurveyRuntime.selectedSourceMask, startedUs)
                    : leshy1::services::survey::SessionTimelineStatus::NotRunning;
            productSurveyRuntime.timelineArchiveStatus =
                leshy1::services::survey::sessionTimelineStatusName(
                    archiveStarted);
            bool degradationRecorded = true;
            if (pipelineStarted == SurveyPipelineStatus::Started &&
                timelineStarted == SourceTimelineStatus::Started &&
                archiveStarted ==
                    leshy1::services::survey::SessionTimelineStatus::Started) {
                for (const RadioKind source :
                     std::array<RadioKind, 2>{RadioKind::Wifi, RadioKind::Ble}) {
                    if ((event.report.unavailableSourceMask &
                         leshy1::services::survey::sourceMask(source)) == 0) {
                        continue;
                    }
                    const SourceTimelineStatus unavailable =
                        productSurveyTimeline.transition(
                            source, SourceWindowState::Unavailable,
                            SourceWindowReason::DriverUnavailable, startedUs);
                    if (!applyProductSurveyTimelineStatus(
                            unavailable, SourceTimelineStatus::Transitioned,
                            "initial_unavailable", startedUs) ||
                        !drainProductSurveyTimelineWindows()) {
                        degradationRecorded = false;
                        break;
                    }
                }
            }
            if (pipelineStarted != SurveyPipelineStatus::Started ||
                captureConfigured != CaptureMetadataStatus::Configured ||
                !applyProductSurveyTimelineStatus(
                    timelineStarted, SourceTimelineStatus::Started,
                    "timeline_start", startedUs) ||
                archiveStarted !=
                    leshy1::services::survey::SessionTimelineStatus::Started ||
                !degradationRecorded) {
                productSurveyTimeline.reset();
                requestProductSurveyWorkerStop(true);
                productSurveyRuntime.status = "workflow_start_failed";
            } else {
                productSurveyRuntime.status = "running";
                productSurveyRuntime.backendOpen = true;
                productSurveyRuntime.sourceActive = true;
                lastRuntimeEvent = "product_survey_running";
            }
            render = true;
        } else if (event.kind ==
                   ProductSurveyWorkerEventKind::ScanStarted) {
            const SourceTimelineStatus status =
                productSurveyTimeline.transition(
                    event.source, SourceWindowState::Active,
                    SourceWindowReason::None, event.scanStartedUs);
            const bool scanStartReady = applyProductSurveyTimelineStatus(
                    status, SourceTimelineStatus::Transitioned,
                    "scan_start", event.scanStartedUs) &&
                drainProductSurveyTimelineWindows();
            if (!scanStartReady) {
                productSurveyRuntime.status = "timeline_start_failed";
                lastRuntimeEvent = productSurveyRuntime.status;
                requestProductSurveyWorkerStop(true);
            }
            xSemaphoreGive(productSurveyScanStartGate);
        } else if (event.kind == ProductSurveyWorkerEventKind::Scan) {
            if (closeProductSurveyScanWindow(event)) {
                productSurveyRuntime.status =
                    event.report.unavailableSourceMask == 0
                        ? "running" : "running_degraded";
                productSurveyRuntime.sourceActive = true;
                lastRuntimeEvent =
                    event.report.unavailableSourceMask == 0
                        ? "product_survey_scan"
                        : "product_survey_scan_degraded";
            } else {
                productSurveyRuntime.status = "timeline_close_failed";
                lastRuntimeEvent = productSurveyRuntime.status;
                requestProductSurveyWorkerStop(true);
            }
            render = true;
        } else if (event.kind ==
                   ProductSurveyWorkerEventKind::SourceUnavailable) {
            if (closeProductSurveyScanWindow(
                    event, event.failureState, event.failureReason)) {
                productSurveyRuntime.status = "running_degraded";
                productSurveyRuntime.sourceActive =
                    event.report.activeSourceMask != 0;
                lastRuntimeEvent = "product_survey_source_degraded";
            } else {
                productSurveyRuntime.status = "timeline_degrade_failed";
                lastRuntimeEvent = productSurveyRuntime.status;
                requestProductSurveyWorkerStop(true);
            }
            render = true;
        } else if (event.kind == ProductSurveyWorkerEventKind::Paused) {
            const bool windowClosed = closeProductSurveyScanWindow(event);
            productSurveyRuntime.sourceActive = false;
            const SourceTimelineStatus timelineStopped = windowClosed
                ? productSurveyTimeline.stop(event.eventUs)
                : SourceTimelineStatus::InvalidState;
            const bool sourceStopped = windowClosed &&
                applyProductSurveyTimelineStatus(
                    timelineStopped, SourceTimelineStatus::Stopped,
                    "timeline_pause", event.eventUs) &&
                drainProductSurveyTimelineWindows();
            const auto* wifi = productSurveyTimeline.source(RadioKind::Wifi);
            const auto* ble = productSurveyTimeline.source(RadioKind::Ble);
            const auto archiveFinalized =
                sourceStopped && wifi != nullptr && ble != nullptr
                    ? surveySession.finalizeTimeline(
                          event.eventUs, *wifi, *ble,
                          productSurveyTimeline.overflowEvents())
                    : leshy1::services::survey::SessionTimelineStatus::InvalidSummary;
            productSurveyRuntime.timelineArchiveStatus =
                leshy1::services::survey::sessionTimelineStatusName(
                    archiveFinalized);
            if (sourceStopped &&
                archiveFinalized ==
                    leshy1::services::survey::SessionTimelineStatus::Finalized) {
                productSurveyRuntime.status = "paused";
                lastRuntimeEvent = "product_survey_paused";
                setProductSurveyControl(ProductSurveyWorkerControl::Paused);
                render = true;
            } else {
                releaseProductSurveyAfterTerminal("pause_failed", true);
                render = false;
            }
        } else if (event.kind == ProductSurveyWorkerEventKind::Stopped) {
            const bool windowClosed = closeProductSurveyScanWindow(event);
            productSurveyRuntime.sourceActive = false;
            const SourceTimelineStatus timelineStopped = windowClosed
                ? productSurveyTimeline.stop(event.eventUs)
                : SourceTimelineStatus::InvalidState;
            const bool sourceStopped = windowClosed &&
                applyProductSurveyTimelineStatus(
                    timelineStopped, SourceTimelineStatus::Stopped,
                    "timeline_stop", event.eventUs) &&
                drainProductSurveyTimelineWindows();
            const auto* wifi = productSurveyTimeline.source(RadioKind::Wifi);
            const auto* ble = productSurveyTimeline.source(RadioKind::Ble);
            const auto archiveFinalized =
                sourceStopped && wifi != nullptr && ble != nullptr
                    ? surveySession.finalizeTimeline(
                          event.eventUs, *wifi, *ble,
                          productSurveyTimeline.overflowEvents())
                    : leshy1::services::survey::SessionTimelineStatus::InvalidSummary;
            productSurveyRuntime.timelineArchiveStatus =
                leshy1::services::survey::sessionTimelineStatusName(
                    archiveFinalized);
            const bool timelineComplete = sourceStopped &&
                archiveFinalized ==
                    leshy1::services::survey::SessionTimelineStatus::Finalized;
            const SurveyPipelineStatus stopped = timelineComplete
                ? stopProductSurvey() : SurveyPipelineStatus::WorkflowRejected;
            if (!timelineComplete ||
                stopped != SurveyPipelineStatus::Committed) {
                releaseProductSurveyAfterTerminal("commit_failed", true);
                render = false;
            } else {
                setProductSurveyControl(ProductSurveyWorkerControl::Idle);
                render = true;
            }
        } else if (event.kind == ProductSurveyWorkerEventKind::Cancelled) {
            const bool windowClosed = closeProductSurveyScanWindow(event);
            const SourceTimelineStatus cancelled =
                productSurveyTimeline.state() == SourceTimelineState::Running
                    ? productSurveyTimeline.cancel(event.eventUs)
                    : SourceTimelineStatus::Cancelled;
            const bool timelineCancelled = windowClosed &&
                (cancelled == SourceTimelineStatus::Cancelled);
            applyProductSurveyTimelineStatus(
                cancelled, SourceTimelineStatus::Cancelled,
                "timeline_cancel", event.eventUs);
            releaseProductSurveyAfterTerminal(
                timelineCancelled ? "cancelled" : "timeline_cancel_failed",
                true);
            render = false;
        } else {
            const bool windowClosed = closeProductSurveyScanWindow(
                event, SourceWindowState::Fault,
                SourceWindowReason::DriverFault);
            if (!windowClosed) event.report.status = "timeline_fault_failed";
            if (productSurveyTimeline.state() == SourceTimelineState::Running) {
                const SourceTimelineStatus cancelled =
                    productSurveyTimeline.cancel(event.eventUs);
                applyProductSurveyTimelineStatus(
                    cancelled, SourceTimelineStatus::Cancelled,
                    "timeline_failure_cancel", event.eventUs);
            }
            const bool keepVisible = event.report.admissionStatus ==
                leshy1::apps::survey::ProductSurveyAdmissionStatus::SourceUnavailable;
            releaseProductSurveyAfterTerminal(event.report.status, !keepVisible);
            render = false;
        }
    }
    if (drainProductSurveyWorkerObservations()) render = true;
    if (render) renderInteractiveScreen();
}

void recoverProductCatalogForFingerprint(const char* expectedFingerprint,
                                         bool enrollmentPresent) {
    productBootRecovery = {};
    productBootRecovery.status = "invalid_enrollment";
    productBootRecovery.cleanupComplete = true;
    productBootRecovery.enrolled = enrollmentPresent;
    if (!exactCidFingerprint(expectedFingerprint)) return;
    std::snprintf(productBootRecovery.expectedFingerprint,
                  sizeof(productBootRecovery.expectedFingerprint), "%s",
                  expectedFingerprint);

    const bool resourcesAcquired = resourceBroker.acquire(
        kBootCatalogOwner, leshy1::storage::kSdIdentificationResources);
    productBootRecovery.ownedDuring = resourceBroker.ownedBy(kBootCatalogOwner);
    if (!resourcesAcquired) {
        productBootRecovery.status = "resources_unavailable";
        productBootRecovery.cleanupComplete = true;
        return;
    }

    BoardSdSpiTransport identityTransport;
    const bool identityBegun = identityTransport.begin();
    leshy1::storage::SdTransportRunResult identity;
    if (identityBegun) {
        leshy1::storage::SdTransportRunPolicy policy;
        policy.allowPhysical = true;
        policy.explicitlySelected = true;
        policy.identificationOnly = true;
        policy.ownedResources = productBootRecovery.ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), identityTransport,
            policy);
        identityTransport.end();
    }
    const bool identityCleanup = identityTransport.cleanupComplete();
    formatCidFingerprint(identity.identity,
                         productBootRecovery.observedFingerprint,
                         sizeof(productBootRecovery.observedFingerprint));
    productBootRecovery.fingerprintMatched =
        identity.status == leshy1::storage::SdTransportRunStatus::Valid &&
        std::strcmp(productBootRecovery.observedFingerprint,
                    productBootRecovery.expectedFingerprint) == 0;

    BoardSdFilesystem filesystem;
    const bool mounted = productBootRecovery.fingerprintMatched &&
                         filesystem.beginReadOnly();
    productBootRecovery.mountedReadOnly = mounted;
    productBootRecovery.readOnlyGuaranteed =
        mounted && filesystem.readOnlyGuaranteed();
    const std::uint64_t cardCapacity =
        mounted ? filesystem.cardCapacityBytes() : 0;
    const bool capacityMatched = mounted &&
        cardCapacity != 0 && cardCapacity == identity.identity.capacityBytes;
    productBootRecovery.rootExists = mounted && filesystem.exists(
        leshy1::storage::kProductSessionStoreRoot);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = productBootRecovery.observedFingerprint;
    media.capacityBytes = cardCapacity;
    // Recovery never writes, so it does not need an O(media-size) free-space
    // scan. Zero is valid geometry and keeps cold boot bounded.
    media.freeBytes = 0;
    leshy1::storage::ProductStoreRequest request;
    request.operation = leshy1::storage::ProductStoreOperation::RecoverCatalog;
    request.expectedFingerprint = productBootRecovery.expectedFingerprint;
    request.rootPath = leshy1::storage::kProductSessionStoreRoot;
    request.rootExists = productBootRecovery.rootExists;
    request.driverReadOnlyGuaranteed =
        productBootRecovery.readOnlyGuaranteed;
    request.ownedResources = productBootRecovery.ownedDuring;
    const leshy1::storage::ProductStorePermit permit =
        leshy1::storage::authorizeProductStore(media, request);
    productBootRecovery.permitStatus = permit.status;

    if (permit.allowed()) {
        ArduinoFsSessionStoreIo io(filesystem.driveNumber(),
                                   sdSessionStoreIoWorkspace);
        productBootRecovery.opened = io.openExistingReadOnly(permit);
        if (productBootRecovery.opened) {
            productBootRecovery.catalog = sessionCatalog.recoverLatest(
                io, sessionStoreWorkspace, librarySession, libraryController,
                true, false);
            productBootRecovery.catalogAdmitted =
                productBootRecovery.catalog.admitted();
        }
        io.end();
    }
    productBootRecovery.blockedWriteAttempts =
        filesystem.blockedWriteAttempts();
    if (productBootRecovery.fingerprintMatched) filesystem.end();
    const bool filesystemCleanup =
        !productBootRecovery.fingerprintMatched || filesystem.cleanupComplete();
    resourceBroker.releaseAll(kBootCatalogOwner);
    productBootRecovery.ownedAfter = resourceBroker.ownedBy(kBootCatalogOwner);
    productBootRecovery.cleanupComplete = identityCleanup && filesystemCleanup &&
        productBootRecovery.ownedAfter == 0 &&
        productBootRecovery.blockedWriteAttempts == 0;

