anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (!identityBegun || identity.status !=
                              leshy1::storage::SdTransportRunStatus::Valid) {
        productBootRecovery.status = "identity_failed";
    } else if (!productBootRecovery.fingerprintMatched) {
        productBootRecovery.status = "fingerprint_mismatch";
    } else if (!mounted || !productBootRecovery.readOnlyGuaranteed) {
        productBootRecovery.status = "readonly_mount_failed";
    } else if (!permit.allowed()) {
        productBootRecovery.status =
            leshy1::storage::productStoreAccessStatusName(permit.status);
    } else if (!productBootRecovery.opened) {
        productBootRecovery.status = "open_failed";
    } else if (productBootRecovery.catalogAdmitted) {
        productBootRecovery.status = "admitted";
        libraryDemoReady = true;
    } else {
        productBootRecovery.status =
            leshy1::apps::library::sessionCatalogStatusName(
                productBootRecovery.catalog.status);
    }
    if (!productBootRecovery.cleanupComplete) {
        productBootRecovery.status = "cleanup_failed";
    }
}

bool IRAM_ATTR recordProductBootRecoveryTimeout() {
    if (__atomic_exchange_n(&productBootRecoveryWatchdogArmed, 0,
                            __ATOMIC_ACQ_REL) == 0) {
        return false;
    }
    if (productBootRetryRtcMagic == kProductBootRetryRtcMagic &&
        productBootRetryRestarts <
            leshy1::storage::kProductBootMaximumAttempts) {
        ++productBootRetryRestarts;
        ++productBootRetryTimeouts;
    }
    return true;
}

static_assert(BoardProfile::kBuzzerPin == 2 &&
                  BoardProfile::kNrfCePins[0] == 15 &&
                  BoardProfile::kNrfCePins[1] == 47 &&
                  BoardProfile::kNrfCePins[2] == 14,
              "Task-WDT emergency GPIO masks must match the board profile");

void IRAM_ATTR quiesceEmergencyGpioFromIsr() {
    // GPIO2 is the active-high buzzer. GPIO14/15/47 are every declared nRF CE
    // path. Write-one-to-clear is peripheral-local, allocation-free, and does
    // not depend on a healthy scheduler or flash-resident Arduino code.
    GPIO.out_w1tc = (1U << 2U) | (1U << 14U) | (1U << 15U);
    GPIO.out1_w1tc.val = (1U << (47U - 32U));
}

bool IRAM_ATTR recordRuntimeSafetyWatchdogTrip() {
    if (__atomic_exchange_n(&runtimeSafetyWatchdogArmed, 0,
                            __ATOMIC_ACQ_REL) == 0) {
        return false;
    }
    quiesceEmergencyGpioFromIsr();
    const std::uint32_t appIdentity = runtimeSafetyAppIdentity;
    const std::uint32_t reason =
        static_cast<std::uint32_t>(SafetyReason::RuntimeWatchdog);
    const std::uint32_t tripCount = runtimeSafetyNextTripCount;
    const std::uint32_t quiesceCount = runtimeSafetyNextQuiesceCount;
    // Invalidate first and publish magic last. Complements reject a reset in
    // the middle of this bounded RTC write sequence.
    safetyRetainedRtc.magic = 0;
    safetyRetainedRtc.schema = leshy1::kernel::safety::kSafetyRetainedSchema;
    safetyRetainedRtc.appIdentity = appIdentity;
    safetyRetainedRtc.appIdentityInverse = ~appIdentity;
    safetyRetainedRtc.reason = reason;
    safetyRetainedRtc.reasonInverse = ~reason;
    safetyRetainedRtc.tripCount = tripCount;
    safetyRetainedRtc.tripCountInverse = ~tripCount;
    safetyRetainedRtc.quiesceCount = quiesceCount;
    safetyRetainedRtc.quiesceCountInverse = ~quiesceCount;
    safetyRetainedRtc.latchConfirmed = 0;
    safetyRetainedRtc.latchConfirmedInverse = ~1U;
    __atomic_thread_fence(__ATOMIC_RELEASE);
    safetyRetainedRtc.magic = leshy1::kernel::safety::kSafetyRetainedMagic;
    return true;
}

extern "C" void IRAM_ATTR esp_task_wdt_isr_user_handler() {
    // The Task WDT ISR is the last-resort path when the scheduler-based
    // watchdog cannot run. Only claim the already armed recovery attempt and
    // retain its reason; the configured panic path performs the reset.
    if (!recordProductBootRecoveryTimeout()) {
        recordRuntimeSafetyWatchdogTrip();
    }
}

void watchProductBootRecovery(void*) {
    delay(leshy1::storage::kProductBootRecoveryWatchdogMs);
    if (recordProductBootRecoveryTimeout()) {
        // Recovery may hold filesystem or console locks. Do not log, flush,
        // or run shutdown handlers here; retain the reason in RTC and force a
        // digital restart from this independent task.
        esp_restart_noos();
    }
    vTaskDelete(nullptr);
}

bool armProductBootRecoveryWatchdog() {
    productBootRecoveryTaskWatchdogAdded = false;
    const esp_err_t taskWatchdogStatus = esp_task_wdt_status(nullptr);
    if (taskWatchdogStatus == ESP_ERR_NOT_FOUND) {
        if (esp_task_wdt_add(nullptr) != ESP_OK) return false;
        productBootRecoveryTaskWatchdogAdded = true;
    } else if (taskWatchdogStatus != ESP_OK) {
        return false;
    }
    if (esp_task_wdt_reset() != ESP_OK) {
        if (productBootRecoveryTaskWatchdogAdded) {
            esp_task_wdt_delete(nullptr);
            productBootRecoveryTaskWatchdogAdded = false;
        }
        return false;
    }
    __atomic_store_n(&productBootRecoveryWatchdogArmed, 1,
                     __ATOMIC_RELEASE);
    productBootRecoveryWatchdogTask = nullptr;
    if (xTaskCreatePinnedToCore(
            watchProductBootRecovery, "leshy-sd-boot-watch", 2048, nullptr, 3,
            &productBootRecoveryWatchdogTask, 0) != pdPASS) {
        __atomic_store_n(&productBootRecoveryWatchdogArmed, 0,
                         __ATOMIC_RELEASE);
        productBootRecoveryWatchdogTask = nullptr;
        if (productBootRecoveryTaskWatchdogAdded) {
            esp_task_wdt_delete(nullptr);
            productBootRecoveryTaskWatchdogAdded = false;
        }
        return false;
    }
    return true;
}

bool disarmProductBootRecoveryWatchdog() {
    __atomic_store_n(&productBootRecoveryWatchdogArmed, 0,
                     __ATOMIC_RELEASE);
    TaskHandle_t task = productBootRecoveryWatchdogTask;
    productBootRecoveryWatchdogTask = nullptr;
    if (task != nullptr) vTaskDelete(task);
    if (!productBootRecoveryTaskWatchdogAdded) return true;
    productBootRecoveryTaskWatchdogAdded = false;
    return esp_task_wdt_delete(nullptr) == ESP_OK;
}

bool safetyWatchdogResetReason(std::uint32_t reason) {
    return reason == static_cast<std::uint32_t>(ESP_RST_PANIC) ||
           reason == static_cast<std::uint32_t>(ESP_RST_INT_WDT) ||
           reason == static_cast<std::uint32_t>(ESP_RST_TASK_WDT) ||
           reason == static_cast<std::uint32_t>(ESP_RST_WDT);
}

SafetyRetainedRecord snapshotSafetyRetainedRecord() {
    SafetyRetainedRecord record{};
    record.magic = safetyRetainedRtc.magic;
    record.schema = safetyRetainedRtc.schema;
    record.appIdentity = safetyRetainedRtc.appIdentity;
    record.appIdentityInverse = safetyRetainedRtc.appIdentityInverse;
    record.reason = safetyRetainedRtc.reason;
    record.reasonInverse = safetyRetainedRtc.reasonInverse;
    record.tripCount = safetyRetainedRtc.tripCount;
    record.tripCountInverse = safetyRetainedRtc.tripCountInverse;
    record.quiesceCount = safetyRetainedRtc.quiesceCount;
    record.quiesceCountInverse = safetyRetainedRtc.quiesceCountInverse;
    record.latchConfirmed = safetyRetainedRtc.latchConfirmed;
    record.latchConfirmedInverse = safetyRetainedRtc.latchConfirmedInverse;
    return record;
}

void clearSafetyRetainedRecord() {
    safetyRetainedRtc.magic = 0;
    safetyRetainedRtc.schema = 0;
    safetyRetainedRtc.appIdentity = 0;
    safetyRetainedRtc.appIdentityInverse = 0;
    safetyRetainedRtc.reason = 0;
    safetyRetainedRtc.reasonInverse = 0;
    safetyRetainedRtc.tripCount = 0;
    safetyRetainedRtc.tripCountInverse = 0;
    safetyRetainedRtc.quiesceCount = 0;
    safetyRetainedRtc.quiesceCountInverse = 0;
    safetyRetainedRtc.latchConfirmed = 0;
    safetyRetainedRtc.latchConfirmedInverse = 0;
}

void persistSafetyStop(SafetyReason reason, std::uint32_t tripCount,
                       std::uint32_t quiesceCount) {
    const SafetyRetainedRecord record =
        leshy1::kernel::safety::makeSafetyRetainedRecord(
            runningAppIdentity, reason, tripCount, quiesceCount);
    safetyRetainedRtc.magic = 0;
    safetyRetainedRtc.schema = record.schema;
    safetyRetainedRtc.appIdentity = record.appIdentity;
    safetyRetainedRtc.appIdentityInverse = record.appIdentityInverse;
    safetyRetainedRtc.reason = record.reason;
    safetyRetainedRtc.reasonInverse = record.reasonInverse;
    safetyRetainedRtc.tripCount = record.tripCount;
    safetyRetainedRtc.tripCountInverse = record.tripCountInverse;
    safetyRetainedRtc.quiesceCount = record.quiesceCount;
    safetyRetainedRtc.quiesceCountInverse = record.quiesceCountInverse;
    safetyRetainedRtc.latchConfirmed = record.latchConfirmed;
    safetyRetainedRtc.latchConfirmedInverse = record.latchConfirmedInverse;
    safetyRetainedRtc.magic = record.magic;
}

void confirmRetainedSafetyLatch(const SafetyRetainedRecord& record) {
    if (record.latchConfirmed == 1U) return;
    // The ISR already published the target inverse (~1). One aligned store
    // confirms the latch without creating a reset window in which the otherwise
    // valid watchdog record would be rejected.
    safetyRetainedRtc.latchConfirmed = 1U;
    __atomic_thread_fence(__ATOMIC_RELEASE);
}

void latchSafetyStopInTask(SafetyReason reason) {
    BoardSafeOutputs::emergencyQuiesce();
    BoardSdSpiTransport::holdRadioTransmitPathsInactive();
    const std::uint32_t tripCount = safetySupervisor.tripCount() + 1U;
    const std::uint32_t quiesceCount = safetySupervisor.quiesceCount() + 1U;
    persistSafetyStop(reason, tripCount, quiesceCount);
    safetySupervisor.latch(reason, tripCount, quiesceCount);
    runtimeSafetyWatchdogReady = false;
    __atomic_store_n(&runtimeSafetyWatchdogArmed, 0, __ATOMIC_RELEASE);
}

