anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    filesystem.end();
    resourceBroker.releaseAll(kLittleFsHilOwner);
    const std::uint32_t ownedAfter = resourceBroker.ownedBy(kLittleFsHilOwner);
    const bool cleanupComplete = filesystem.cleanupComplete() && ownedAfter == 0;
    if (std::strcmp(status, "reset_not_triggered") == 0) {
        littleFsResetRtcState.magic = 0;
    }
    std::snprintf(
        line, sizeof(sdPhysicalEvidence.line),
        "{\"schema\":\"leshy.storage.littlefs.reset.v1\","
        "\"kind\":\"result\",\"mode\":\"arm\",\"status\":\"%s\","
        "\"run_id\":\"%s\",\"boundary\":%u,\"boundary_name\":\"%s\","
        "\"expected_fingerprint\":\"%s\","
        "\"observed_fingerprint\":\"%s\","
        "\"fingerprint_matched\":%s,\"target_inactive\":%s,"
        "\"format_performed\":%s,\"permit_status\":\"%s\","
        "\"scratch_preexisting\":%s,\"scratch_created\":%s,"
        "\"fixture_ready\":%s,\"prior_unchanged\":%s,"
        "\"continuity_armed\":%s,\"bytes_written\":%llu,"
        "\"file_syncs\":%lu,\"directory_syncs\":%lu,"
        "\"io_failure\":\"%s\",\"io_errno\":%d,"
        "\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"cleanup_complete\":%s,\"ota1_restore_required\":true,"
        "\"product_partition_touched\":false,\"sd_accessed\":false,"
        "\"nvs_touched\":false,\"radio_touched\":false,"
        "\"reset_injection\":true,\"physical_power_cut\":false}",
        status, runId, boundaryNumber,
        leshy1::storage::sessionStoreBoundaryName(boundary),
        expectedFingerprint, observedFingerprint,
        fingerprintMatched ? "true" : "false",
        targetSafe ? "true" : "false",
        filesystem.formatted() ? "true" : "false",
        leshy1::storage::permitStatusName(permit.status),
        scratchPreexisting ? "true" : "false",
        scratchCreated ? "true" : "false",
        fixtureReady ? "true" : "false",
        priorUnchanged ? "true" : "false",
        continuityArmed ? "true" : "false",
        static_cast<unsigned long long>(bytesWritten),
        static_cast<unsigned long>(fileSyncs),
        static_cast<unsigned long>(directorySyncs), ioFailure, ioErrno,
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        cleanupComplete ? "true" : "false");
    reply.println(line);
}

void emitLittleFsResetRecovery(Stream& reply,
                               const char* expectedFingerprint,
                               const char* runId,
                               unsigned boundaryNumber) {
    auto& line = sdPhysicalEvidence.line;
    const leshy1::storage::CommitStage boundary =
        resetBoundaryStage(boundaryNumber);
    const esp_reset_reason_t resetReason = esp_reset_reason();
    const bool softwareReset = resetReason == ESP_RST_SW;
    const bool continuityValid = littleFsResetContinuityValid(
        expectedFingerprint, runId, boundaryNumber);
    const bool idleUi = uiController.isRoot() && !appRuntime.running() &&
        productSurveyControl() == ProductSurveyWorkerControl::Idle;
    DisposableOtaLittleFs filesystem;
    const bool inspected = filesystem.inspect();
    const bool targetSafe = inspected && filesystem.safeInactiveTarget();
    const bool resourcesAcquired = idleUi && targetSafe && softwareReset &&
        continuityValid && resourceBroker.acquire(
            kLittleFsHilOwner,
            leshy1::kernel::runtime::resourceMask(Resource::Storage));
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kLittleFsHilOwner);
    const bool mounted = resourcesAcquired && filesystem.mountReadOnly();
    const std::uint64_t capacityBytes = mounted ? filesystem.totalBytes() : 0;
    const std::uint64_t freeBytes = mounted ? filesystem.freeBytes() : 0;
    char scratchPath[leshy1::storage::kScratchPathMax] = {};
    std::snprintf(scratchPath, sizeof(scratchPath), "%s%s",
                  leshy1::storage::kScratchRoot, runId);
    const bool scratchExists = mounted && filesystem.exists(scratchPath);

    leshy1::storage::MediaIdentity media;
    media.present = mounted && capacityBytes != 0 && freeBytes <= capacityBytes;
    media.kind = leshy1::storage::MediaKind::LittleFs;
    media.fingerprint = expectedFingerprint;
    media.capacityBytes = capacityBytes;
    media.freeBytes = freeBytes;
    leshy1::storage::ExistingScratchReadRequest request;
    request.explicitlySelected = true;
    request.expectedFingerprint = expectedFingerprint;
    request.runId = runId;
    request.scratchExists = scratchExists;
    const leshy1::storage::ReadPermit permit =
        leshy1::storage::authorizeExistingScratchRead(media, request);

    const bool fixtureReady = prepareLittleFsResetFixture();
    leshy1::storage::SessionStoreRecoveryResult recovery;
    StoredGenerationEvidence priorEvidence;
    bool openedReadOnly = false;
    bool priorUnchanged = false;
    std::uint64_t bytesWritten = 0;
    std::uint32_t fileSyncs = 0;
    std::uint32_t directorySyncs = 0;
    const char* ioFailure = "not_started";
    int ioErrno = 0;
    if (permit.allowed() && fixtureReady) {
        ArduinoLittleFsSessionStoreIo io(filesystem);
        openedReadOnly = io.openExistingReadOnly(permit);
        if (openedReadOnly) {
            priorUnchanged = inspectStoredGeneration(
                io, sessionStoreWorkspace, littleFsResetSession, 1,
                &priorEvidence);
            recovery = leshy1::storage::recoverSession(
                io, sessionStoreWorkspace,
                &sessionStoreWorkspace.validationSession);
        }
        bytesWritten = io.bytesWritten();
        fileSyncs = io.fileSyncs();
        directorySyncs = io.directorySyncs();
        ioFailure = io.lastFailure();
        ioErrno = io.lastErrno();
        io.end();
    }

    filesystem.end();
    resourceBroker.releaseAll(kLittleFsHilOwner);
    const std::uint32_t ownedAfter = resourceBroker.ownedBy(kLittleFsHilOwner);
    const bool cleanupComplete = filesystem.cleanupComplete() && ownedAfter == 0;
    const bool generationAllowed = recovery.valid() &&
        resetRecoveredGenerationAllowed(boundaryNumber, recovery.generation);
    const bool valid = leshy1::storage::isSessionStoreBoundary(boundary) &&
        softwareReset && continuityValid && idleUi && targetSafe && mounted &&
        permit.allowed() && fixtureReady && openedReadOnly &&
        generationAllowed && recovery.observations == 3 && priorUnchanged &&
        bytesWritten == 0 && fileSyncs == 0 && directorySyncs == 0 &&
        cleanupComplete;

    std::snprintf(
        line, sizeof(sdPhysicalEvidence.line),
        "{\"schema\":\"leshy.storage.littlefs.reset.v1\","
        "\"kind\":\"result\",\"mode\":\"recovery\","
        "\"status\":\"%s\",\"run_id\":\"%s\",\"boundary\":%u,"
        "\"boundary_name\":\"%s\",\"expected_recovery\":\"%s\","
        "\"reset_reason_code\":%u,\"software_reset\":%s,"
        "\"continuity_valid\":%s,\"target\":\"ota1\","
        "\"target_address\":%lu,\"target_size\":%lu,"
        "\"target_inactive\":%s,\"read_permit_status\":\"%s\","
        "\"scratch_path\":\"%s\",\"scratch_exists\":%s,"
        "\"mounted_read_only\":%s,\"opened_read_only\":%s,"
        "\"session_store_io_writable\":false,"
        "\"recovery_status\":\"%s\",\"recovered_generation\":%lu,"
        "\"generation_allowed\":%s,\"reopened_observations\":%u,"
        "\"a_status\":%u,\"b_status\":%u,\"prior_unchanged\":%s,"
        "\"prior_segment_crc32c\":%lu,"
        "\"prior_manifest_crc32c\":%lu,"
        "\"bytes_written\":%llu,\"file_syncs\":%lu,"
        "\"directory_syncs\":%lu,\"io_failure\":\"%s\","
        "\"io_errno\":%d,\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"cleanup_complete\":%s,\"mount_on_boot\":false,"
        "\"format_allowed\":false,\"existing_paths_deleted\":false,"
        "\"ota1_restore_required\":true,"
        "\"product_partition_touched\":false,\"sd_accessed\":false,"
        "\"nvs_touched\":false,\"radio_touched\":false,"
        "\"reset_injection\":true,\"physical_power_cut\":false}",
        valid ? "valid" : "failed", runId, boundaryNumber,
        leshy1::storage::sessionStoreBoundaryName(boundary),
        resetExpectedRecovery(boundaryNumber),
        static_cast<unsigned>(resetReason), softwareReset ? "true" : "false",
        continuityValid ? "true" : "false",
        static_cast<unsigned long>(filesystem.targetAddress()),
        static_cast<unsigned long>(filesystem.targetSize()),
        targetSafe ? "true" : "false",
        leshy1::storage::readPermitStatusName(permit.status),
        permit.allowed() ? permit.scratchPath : scratchPath,
        scratchExists ? "true" : "false", mounted ? "true" : "false",
        openedReadOnly ? "true" : "false",
        leshy1::storage::sessionStoreStatusName(recovery.status),
        static_cast<unsigned long>(recovery.generation),
        generationAllowed ? "true" : "false",
        static_cast<unsigned>(recovery.observations),
        static_cast<unsigned>(recovery.aStatus),
        static_cast<unsigned>(recovery.bStatus),
        priorUnchanged ? "true" : "false",
        static_cast<unsigned long>(priorEvidence.observedSegmentCrc),
        static_cast<unsigned long>(priorEvidence.observedManifestCrc),
        static_cast<unsigned long long>(bytesWritten),
        static_cast<unsigned long>(fileSyncs),
        static_cast<unsigned long>(directorySyncs), ioFailure, ioErrno,
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        cleanupComplete ? "true" : "false");
    reply.println(line);
}

void broadcast(const char* line) {
    Serial.println(line);
    Serial0.println(line);
}

void emitMetrics() {
    char line[768] = {};
    bootMetrics.heapFree = ESP.getFreeHeap();
    bootMetrics.heapMinimum = ESP.getMinFreeHeap();
    if (leshy1::services::diagnostics::formatBootMetrics(bootMetrics, line, sizeof(line))) {
        broadcast(line);
    }
}

void emitInventory() {
    char line[384] = {};
    for (std::size_t i = 0; i < inventory.size(); ++i) {
        const CapabilityRecord* record = inventory.get(i);
        if (record != nullptr &&
            leshy1::services::diagnostics::formatCapability(*record, line, sizeof(line))) {
            broadcast(line);
        }
    }
}

void emitSafeOutputs(Stream& reply) {
    const bool buzzerInactive = BoardSafeOutputs::buzzerHeldInactive();
    const bool radioCeInactive =
        BoardSafeOutputs::radioTransmitPathsHeldInactive();
    char line[512] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.hardware.safe-outputs.v1\",\"kind\":\"state\","
        "\"buzzer_pin\":%d,\"buzzer_active_level\":\"high\","
        "\"buzzer_mode\":\"output\",\"buzzer_level\":\"%s\","
        "\"buzzer_inactive\":%s,\"nrf_ce_inactive\":%s,"
        "\"software_quiesce_complete\":%s,"
        "\"physical_rail_kill_available\":false,"
        "\"cc1101_hard_kill_available\":false}",
        BoardProfile::kBuzzerPin, buzzerInactive ? "low" : "high",
        buzzerInactive ? "true" : "false",
        radioCeInactive ? "true" : "false",
        buzzerInactive && radioCeInactive ? "true" : "false");
    reply.println(line);
}

void emitSafetyState(Stream& reply) {
    const bool watchdogArmed = runtimeSafetyWatchdogReady &&
        __atomic_load_n(&runtimeSafetyWatchdogArmed, __ATOMIC_ACQUIRE) != 0;
    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.safety.v1\",\"kind\":\"state\","
        "\"state\":\"%s\",\"reason\":\"%s\",\"armed\":%s,"
        "\"latched\":%s,\"clear_pending\":%s,"
        "\"watchdog_timeout_ms\":%lu,\"trip_count\":%lu,"
        "\"emergency_quiesce_count\":%lu,\"reset_reason_code\":%lu,"
        "\"buzzer_inactive\":%s,\"nrf_ce_inactive\":%s,"
        "\"runtime_owner\":\"%s\",\"lease_mask\":%lu,"
        "\"software_only\":true,\"physical_rail_kill_available\":false,"
        "\"thermal_sensor_available\":false,"
        "\"cc1101_hard_kill_available\":false,"
        "\"automatic_clear\":false}",
        leshy1::kernel::safety::safetyStateName(safetySupervisor.state()),
        leshy1::kernel::safety::safetyReasonName(safetySupervisor.reason()),
        watchdogArmed ? "true" : "false",
        safetySupervisor.latched() ? "true" : "false",
        safetySupervisor.clearPending() ? "true" : "false",
        static_cast<unsigned long>(
            leshy1::storage::kProductBootRecoveryHardwareWatchdogMs),
        static_cast<unsigned long>(safetySupervisor.tripCount()),
        static_cast<unsigned long>(safetySupervisor.quiesceCount()),
        static_cast<unsigned long>(bootMetrics.resetReason),
        BoardSafeOutputs::buzzerHeldInactive() ? "true" : "false",
        BoardSafeOutputs::radioTransmitPathsHeldInactive() ? "true" : "false",
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void triggerRuntimeSafetyWatchdogTest(Stream& reply) {
    const bool outputsInactive = BoardSafeOutputs::buzzerHeldInactive() &&
        BoardSafeOutputs::radioTransmitPathsHeldInactive();
    const bool eligible = safetySupervisor.state() == SafetyState::Armed &&
        runtimeSafetyWatchdogReady && outputsInactive &&
        !appRuntime.running() && appRuntime.activeResources() == 0;
    if (!eligible) {
        reply.println(
            "{\"schema\":\"leshy.safety.watchdog_test.v1\","
            "\"kind\":\"error\",\"reason\":\"unsafe_precondition\"}");
        return;
    }
    reply.println(
        "{\"schema\":\"leshy.safety.watchdog_test.v1\","
        "\"kind\":\"armed\",\"status\":\"ready\","
        "\"watchdog_timeout_ms\":5000,\"outputs_inactive\":true,"
        "\"filesystem_write_attempted\":false,"
        "\"physical_write_calls\":0}");
    reply.flush();
    // Deliberately stop feeding the loop task. The independent panic Task WDT
    // must take the ISR quiesce path, retain the reason, and reset the MCU.
    for (;;) delay(1000);
}

void restartLatchedSafetyStopForTest(Stream& reply) {
    const bool eligible = safetySupervisor.latched() &&
        !safetySupervisor.clearPending() && !appRuntime.running() &&
        appRuntime.activeResources() == 0;
    if (!eligible) {
        reply.println(
            "{\"schema\":\"leshy.safety.restart_test.v1\","
            "\"kind\":\"error\",\"reason\":\"unsafe_precondition\"}");
        return;
    }
    BoardSafeOutputs::emergencyQuiesce();
    BoardSdSpiTransport::holdRadioTransmitPathsInactive();
    __atomic_store_n(&runtimeSafetyWatchdogArmed, 0, __ATOMIC_RELEASE);
    reply.println(
        "{\"schema\":\"leshy.safety.restart_test.v1\","
        "\"kind\":\"restart\",\"latch_preserved\":true,"
        "\"outputs_inactive\":true,\"filesystem_write_attempted\":false,"
        "\"physical_write_calls\":0}");
    reply.flush();
    Serial.flush();
    Serial0.flush();
    delay(20);
    esp_restart();
    for (;;) {}
}

