anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderAboutPage(bool clearContent) {
    renderHeader(tr(UiTextId::AboutTitle), clearContent);
    char line[96] = {};
    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    std::snprintf(line, sizeof(line), tr(UiTextId::AboutVersionFormat),
                  LESHY1_VERSION);
    setUiCursor(UiTextRole::Body, 14, 82);
    display.print(line);
    std::snprintf(line, sizeof(line), tr(UiTextId::AboutProfileFormat),
                  BoardProfile::kId);
    setUiCursor(UiTextRole::Body, 14, 116);
    display.print(line);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 168);
    display.print(tr(UiTextId::AboutOpenSource));
}

void runShieldReceiverSelfTestProbe() {
    shieldReceiverProbeReport = {};
    shieldReceiverProbeReport.profileDeclared = BoardProfile::kRfShieldDeclared;
    shieldReceiverProbeReport.gpsExcludedByProfile = !BoardProfile::kGpsDeclared;
    shieldReceiverProbeReport.pn532ExcludedByProfile = !BoardProfile::kPn532Declared;
    const auto radioSpi = leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    if (!resourceBroker.acquire(AppRuntime::kForegroundOwner, radioSpi)) {
        leshy1::drivers::radio::finalizeShieldReceiverProbe(
            &shieldReceiverProbeReport);
        return;
    }
    BoardShieldReceiverProbe probe;
    probe.run(resourceBroker.ownerOf(Resource::RadioSpi) ==
                  AppRuntime::kForegroundOwner,
              &shieldReceiverProbeReport);
    resourceBroker.release(AppRuntime::kForegroundOwner, radioSpi);
    shieldReceiverProbeReport.resourceReleased =
        resourceBroker.ownerOf(Resource::RadioSpi) ==
        leshy1::kernel::runtime::kNoOwner;
}

SelfTestFacts snapshotSelfTestFacts() {
    std::uint32_t inputQueueDrops = 0;
    portENTER_CRITICAL(&physicalInputMux);
    inputQueueDrops = physicalInputQueueDrops;
    portEXIT_CRITICAL(&physicalInputMux);

    const CapabilityRecord* profile = inventory.find("board.profile");
    const CapabilityRecord* persistentSurvey =
        inventory.find("survey.persistent_passive");
    const CapabilityRecord* passiveBle = inventory.find("radio.ble");
    const CapabilityRecord* passiveWifiCapture =
        inventory.find("capture.wifi_passive");
    const CapabilityRecord* persistentLibrary =
        inventory.find("library.persistent_session");
    const CapabilityRecord* persistentWifiCapture =
        inventory.find("capture.wifi_persistent");
    const auto uiOnly = leshy1::kernel::runtime::resourceMask(
        Resource::UiForeground);
    SelfTestFacts facts;
    facts.buildIdentityPresent = std::strlen(runningAppElfSha256) == 64;
    facts.profileMatched = profile != nullptr &&
                           profile->state == CapabilityState::Available;
    facts.displayReady = bootMetrics.displayReadyUs != 0;
    facts.touchFrontendReady = boardTouchInput.ready();
    facts.inputFrontendReady = physicalInputTaskStarted &&
                               bootMetrics.inputDetected;
    facts.inputQueueHealthy = physicalInputEvents != nullptr &&
                              inputQueueDrops == 0;
    facts.buzzerInactive = BoardSafeOutputs::buzzerHeldInactive();
    facts.heapFree = ESP.getFreeHeap();
    facts.heapMinimum = ESP.getMinFreeHeap();
    facts.inputQueueDrops = inputQueueDrops;
    facts.activeResources = appRuntime.activeResources();
    facts.resourceScopeClean = facts.activeResources == uiOnly;
    facts.persistentSurveyReady = persistentSurvey != nullptr &&
        persistentSurvey->state == CapabilityState::Available;
    facts.passiveBleReady = passiveBle != nullptr &&
        passiveBle->state == CapabilityState::Available;
    facts.passiveWifiCaptureReady = passiveWifiCapture != nullptr &&
        passiveWifiCapture->state == CapabilityState::Available;
    facts.enrolledStorageReady = productBootRecovery.enrolled &&
        productBootRecovery.fingerprintMatched &&
        productBootRecovery.catalogAdmitted &&
        productBootRecovery.readOnlyGuaranteed &&
        productBootRecovery.cleanupComplete &&
        productBootRecovery.ownedAfter == 0;
    facts.persistentLibraryReady = persistentLibrary != nullptr &&
        persistentLibrary->state == CapabilityState::Available;
    facts.persistentWifiCaptureReady = persistentWifiCapture != nullptr &&
        persistentWifiCapture->state == CapabilityState::Available;
    facts.gpsDeclared = BoardProfile::kGpsDeclared;
    facts.pn532Declared = BoardProfile::kPn532Declared;
    facts.irDeclared = BoardProfile::kIrDeclared;
    facts.shieldReceiversApplicable = BoardProfile::kRfShieldDeclared;
    facts.shieldReceiverProbeComplete =
        shieldReceiverProbeReport.status == ShieldReceiverProbeStatus::Pass ||
        shieldReceiverProbeReport.status == ShieldReceiverProbeStatus::Partial ||
        shieldReceiverProbeReport.status == ShieldReceiverProbeStatus::Failed;
    facts.shieldReceiverProbePassed =
        shieldReceiverProbeReport.status == ShieldReceiverProbeStatus::Pass &&
        shieldReceiverProbeReport.resourceReleased &&
        shieldReceiverProbeReport.cleanupComplete;
    facts.nrf24SpectrumExerciseComplete = fullGuidedRfState.nrf24Complete;
    facts.nrf24SpectrumExercisePassed = fullGuidedRfState.nrf24Passed;
    facts.cc1101SpectrumExerciseComplete = fullGuidedRfState.cc1101Complete;
    facts.cc1101SpectrumExercisePassed = fullGuidedRfState.cc1101Passed;
    facts.persistentRecoveryAuditComplete =
        fullGuidedArtifactState.recoveryComplete;
    facts.persistentRecoveryAuditPassed =
        fullGuidedArtifactState.recoveryPassed;
    facts.libraryExportAuditComplete = fullGuidedArtifactState.libraryComplete;
    facts.libraryExportAuditPassed = fullGuidedArtifactState.libraryPassed;
    facts.capturePcapAuditComplete = fullGuidedArtifactState.captureComplete;
    facts.capturePcapAuditApplicable =
        fullGuidedArtifactState.captureApplicable;
    facts.capturePcapAuditPassed = fullGuidedArtifactState.capturePassed;
    facts.disposableCommitComplete =
        fullGuidedArtifactState.disposableCommitComplete;
    facts.disposableCommitPassed =
        fullGuidedArtifactState.disposableCommitPassed;
    facts.disposableRemountComplete =
        fullGuidedArtifactState.disposableRemountComplete;
    facts.disposableRemountPassed =
        fullGuidedArtifactState.disposableRemountPassed;
    facts.disposableExportComplete =
        fullGuidedArtifactState.disposableExportComplete;
    facts.disposableExportPassed =
        fullGuidedArtifactState.disposableExportPassed;
    facts.disposableCleanupComplete =
        fullGuidedArtifactState.disposableCleanupComplete;
    facts.disposableCleanupPassed =
        fullGuidedArtifactState.disposableCleanupPassed &&
        fullGuidedArtifactState.productVerifyComplete &&
        fullGuidedArtifactState.productVerifyPassed;
    facts.disposableStorageWriteCalls =
        fullGuidedArtifactState.disposableStorageWriteCalls;
    facts.disposableStorageWriteBytes =
        fullGuidedArtifactState.disposableStorageWriteBytes;
    return facts;
}

void renderLanguageRow(std::uint8_t index) {
    const UiTextId labels[2] = {UiTextId::LanguageEnglish,
                                UiTextId::LanguageRussian};
    const UiTextId notes[2] = {UiTextId::LanguageEnglishNote,
                               UiTextId::LanguageRussianNote};
    if (index >= 2) return;
    renderMenuRow(Components::choiceRow(index), tr(labels[index]),
                  tr(notes[index]), languageController.selection() == index,
                  true,
                  languageController.active() ==
                          (index == 0 ? UiLanguage::English
                                      : UiLanguage::Russian)
                      ? Tone::Positive
                      : Tone::Neutral);
}

