anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderLanguagePage(bool clearContent) {
    renderHeader(tr(UiTextId::LanguageTitle), clearContent);
    for (std::uint8_t index = 0; index < 2; ++index) {
        renderLanguageRow(index);
    }
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 207);
    display.print(tr(UiTextId::LanguagePersisted));
}

void renderCapturePage(bool clearContent) {
    const auto stats = wifiFrameCapture.stats();
    char line[64] = {};
    if (stats.state == WifiFrameCaptureState::Idle) {
        renderHeader(tr(UiTextId::CaptureSetup), clearContent);
        renderMetric(0, tr(UiTextId::CaptureSource), Tone::Positive);
        renderMetric(1, tr(UiTextId::CaptureChannels));
        renderMetric(2, tr(UiTextId::CaptureLimit));
        renderMetric(3, tr(UiTextId::CaptureSnaplen));
        display.setTextColor(Palette::TextMuted, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 207);
        display.print(tr(UiTextId::CaptureStartNote));
        return;
    }

    if (stats.state == WifiFrameCaptureState::Running) {
        renderHeader(tr(UiTextId::CaptureRunning), clearContent);
    } else if (stats.state == WifiFrameCaptureState::Complete) {
        const UiTextId title =
            capturePersistState == CapturePersistState::Confirm
                ? UiTextId::CaptureSaveConfirm
                : capturePersistState == CapturePersistState::Saving
                      ? UiTextId::CaptureSaving
                      : capturePersistState == CapturePersistState::Saved
                            ? UiTextId::CaptureSaved
                            : capturePersistState == CapturePersistState::Failed
                                  ? UiTextId::CaptureSaveFailed
                                  : UiTextId::CaptureResult;
        renderHeader(tr(title), clearContent);
    } else {
        renderHeader(tr(UiTextId::CaptureError), clearContent);
    }
    std::snprintf(line, sizeof(line), tr(UiTextId::CaptureFramesFormat),
                  static_cast<unsigned long>(stats.framesAccepted),
                  static_cast<unsigned>(kProductWifiFrameCapturePlan.maximumFrames));
    renderMetric(0, line,
                 stats.state == WifiFrameCaptureState::Failed
                     ? Tone::Danger : Tone::Positive);
    std::snprintf(line, sizeof(line), tr(UiTextId::CaptureBytesFormat),
                  static_cast<unsigned long>(stats.payloadBytes));
    renderMetric(1, line);
    std::snprintf(line, sizeof(line), tr(UiTextId::CaptureDropsFormat),
                  static_cast<unsigned long>(stats.framesDroppedCapacity +
                                             stats.framesDroppedInvalid));
    renderMetric(2, line,
                 stats.framesDroppedCapacity + stats.framesDroppedInvalid == 0
                     ? Tone::Positive : Tone::Warning);
    std::snprintf(line, sizeof(line), tr(UiTextId::CaptureChannelFormat),
                  static_cast<unsigned>(wifiFrameCapture.currentChannel()));
    renderMetric(3, line);
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 207);
    if (stats.state == WifiFrameCaptureState::Running) {
        display.print(tr(UiTextId::CaptureStopNote));
    } else if (stats.state == WifiFrameCaptureState::Complete) {
        const UiTextId firstNote =
            capturePersistState == CapturePersistState::Confirm
                ? UiTextId::CapturePrivacyNote
                : capturePersistState == CapturePersistState::Saving
                      ? UiTextId::CaptureSavingNote
                      : capturePersistState == CapturePersistState::Saved
                            ? UiTextId::CaptureSavedNote
                            : capturePersistState == CapturePersistState::Failed
                                  ? UiTextId::CaptureSaveFailedNote
                                  : UiTextId::CapturePcapNote;
        display.print(tr(firstNote));
        setUiCursor(UiTextRole::Meta, 14, 222);
        if (capturePersistState == CapturePersistState::Confirm) {
            display.print(tr(UiTextId::CaptureConfirmNote));
        } else if (capturePersistState == CapturePersistState::Saved) {
            std::snprintf(line, sizeof(line), "GEN %lu | %s",
                          static_cast<unsigned long>(capturePersistGeneration),
                          capturePersistStatus);
            display.print(line);
        } else if (capturePersistState == CapturePersistState::Failed) {
            display.print(capturePersistStatus);
        } else if (capturePersistState == CapturePersistState::Result) {
            display.print(tr(UiTextId::CaptureScrubNote));
        }
    } else {
        display.print(tr(UiTextId::CaptureFailureNote));
    }
}

void renderSelfTestModeRow(std::uint8_t index) {
    const UiTextId labels[2] = {UiTextId::Quick, UiTextId::FullGuided};
    const UiTextId notes[2] = {UiTextId::QuickNote, UiTextId::FullNote};
    if (index >= 2) return;
    const bool selected = selfTestController.selection() == index;
    renderMenuRow(Components::choiceRow(index), tr(labels[index]),
                  tr(notes[index]), selected, true,
                  index == 0 ? Tone::Positive : Tone::Warning);
}

void renderSelfTestPage(bool clearContent) {
    char line[96] = {};
    if (selfTestController.view() == SelfTestView::ModeMenu) {
        renderHeader(tr(UiTextId::SelfTestTitle), clearContent);
        for (std::uint8_t index = 0; index < 2; ++index) {
            renderSelfTestModeRow(index);
        }
        display.setTextColor(Palette::TextMuted, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 207);
        display.print(tr(UiTextId::SelfTestNoBoot));
        return;
    }

    if (selfTestController.view() == SelfTestView::Preflight) {
        renderHeader(tr(UiTextId::FullPreflight), clearContent);
        renderMetric(0, tr(UiTextId::QuickChecks9));
        renderMetric(1, tr(UiTextId::CapabilityPlanStaged));
        renderMetric(2, tr(UiTextId::SideEffectsNone));
        renderMetric(3, tr(UiTextId::ResultBlocked), Tone::Warning);
        display.setTextColor(Palette::TextMuted, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 203);
        display.print(tr(UiTextId::GuidedLater));
        return;
    }

    if (selfTestController.view() == SelfTestView::VisualCheck) {
        renderHeader(tr(UiTextId::VisualCheckTitle), clearContent);
        constexpr UiTextId states[SelfTestController::kVisualStateCount] = {
            UiTextId::VisualDialog,
            UiTextId::VisualUnavailable,
            UiTextId::VisualDegraded,
            UiTextId::VisualError,
            UiTextId::VisualRunning,
        };
        constexpr UiTextId details[SelfTestController::kVisualStateCount] = {
            UiTextId::VisualDialogDetail,
            UiTextId::VisualUnavailableDetail,
            UiTextId::VisualDegradedDetail,
            UiTextId::VisualErrorDetail,
            UiTextId::VisualRunningDetail,
        };
        constexpr Tone tones[SelfTestController::kVisualStateCount] = {
            Tone::Focus, Tone::Muted, Tone::Warning, Tone::Danger, Tone::Positive,
        };
        const std::uint8_t state = selfTestController.visualState();
        renderStateCard(tr(states[state]), tr(details[state]), tones[state], state);
        return;
    }

    if (selfTestController.view() == SelfTestView::ActiveChecks) {
        const bool artifactPhase =
            fullGuidedRfState.step == FullGuidedRfStep::Complete;
        renderHeader(tr(artifactPhase ? UiTextId::FullActiveDataTitle
                                     : UiTextId::FullActiveTitle),
                     clearContent);
        if (artifactPhase) {
            const bool disposablePhase =
                fullGuidedArtifactState.step ==
                    FullGuidedArtifactStep::DisposableCommit ||
                fullGuidedArtifactState.step ==
                    FullGuidedArtifactStep::DisposableRemountExport ||
                fullGuidedArtifactState.step ==
                    FullGuidedArtifactStep::DisposableCleanup ||
                fullGuidedArtifactState.step ==
                    FullGuidedArtifactStep::ProductVerify;
            if (disposablePhase) {
                renderMetric(
                    0,
                    fullGuidedArtifactState.disposableCommitPassed
                        ? tr(UiTextId::FullActiveScratchPass)
                        : tr(UiTextId::FullActiveScratchRun),
                    fullGuidedArtifactState.disposableCommitPassed
                        ? Tone::Positive : Tone::Warning);
                renderMetric(
                    1,
                    fullGuidedArtifactState.disposableExportPassed
                        ? tr(UiTextId::FullActiveRemountPass)
                        : tr(UiTextId::FullActiveRemountRun),
                    fullGuidedArtifactState.disposableExportPassed
                        ? Tone::Positive : Tone::Warning);
                renderMetric(
                    2,
                    fullGuidedArtifactState.disposableCleanupPassed &&
                            fullGuidedArtifactState.productVerifyPassed
                        ? tr(UiTextId::FullActiveCleanupPass)
                        : tr(UiTextId::FullActiveCleanupRun),
                    fullGuidedArtifactState.disposableCleanupPassed &&
                            fullGuidedArtifactState.productVerifyPassed
                        ? Tone::Positive : Tone::Warning);
                display.setTextColor(Palette::TextMuted, Palette::Canvas);
                setUiCursor(UiTextRole::Meta, 14, 207);
                display.print(tr(UiTextId::FullActiveDataSafety));
                return;
            }
            renderMetric(
                0,
                fullGuidedArtifactState.recoveryPassed
                    ? tr(UiTextId::FullActiveStoragePass)
                    : tr(UiTextId::FullActiveStorageRun),
                fullGuidedArtifactState.recoveryPassed ? Tone::Positive
                                                       : Tone::Warning);
            renderMetric(
                1,
                fullGuidedArtifactState.libraryPassed
                    ? tr(UiTextId::FullActiveLibraryPass)
                    : tr(UiTextId::FullActiveLibraryRun),
                fullGuidedArtifactState.libraryPassed ? Tone::Positive
                                                      : Tone::Warning);
            renderMetric(2, tr(UiTextId::FullActiveCaptureRun), Tone::Warning);
            display.setTextColor(Palette::TextMuted, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 14, 207);
            display.print(tr(UiTextId::FullActiveDataSafety));
            return;
        }
        if (fullGuidedRfState.step == FullGuidedRfStep::Idle) {
            renderMetric(0, tr(UiTextId::FullActivePreparing), Tone::Warning);
        } else {
            renderMetric(
                0,
                fullGuidedRfState.nrf24Passed
                    ? tr(UiTextId::FullActiveNrfPass)
                    : tr(UiTextId::FullActiveNrfRunning),
                fullGuidedRfState.nrf24Passed ? Tone::Positive
                                               : Tone::Warning);
        }
        std::snprintf(line, sizeof(line), tr(UiTextId::FullActiveCcFormat),
                      static_cast<unsigned>(fullGuidedRfState.cc1101Bins));
        renderMetric(1, line,
                     fullGuidedRfState.cc1101Passed ? Tone::Positive
                                                    : Tone::Warning);
        display.setTextColor(Palette::TextMuted, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 207);
        display.print(tr(UiTextId::FullActiveSafety));
        return;
    }

    const SelfTestReport& report = selfTestController.report();
    renderHeader(report.status == SelfTestResultStatus::Pass
                     ? tr(UiTextId::SelfTestPass)
                     : (report.status == SelfTestResultStatus::Fail
                            ? tr(UiTextId::SelfTestFail)
                            : tr(UiTextId::SelfTestBlocked)),
                 clearContent);
    renderMetric(0,
                 report.mode == SelfTestMode::Quick ? tr(UiTextId::ModeQuick)
                                                    : tr(UiTextId::ModeFull),
                 report.status == SelfTestResultStatus::Pass
                     ? Tone::Positive
                     : (report.status == SelfTestResultStatus::Fail
                            ? Tone::Danger
                            : Tone::Warning));
    std::snprintf(line, sizeof(line), tr(UiTextId::ChecksFormat),
                  static_cast<unsigned>(report.passed),
                  static_cast<unsigned>(report.checkCount));
    renderMetric(1, line);
    std::snprintf(line, sizeof(line), tr(UiTextId::FailBlockedFormat),
                  static_cast<unsigned>(report.failed),
                  static_cast<unsigned>(report.blocked),
                  static_cast<unsigned>(report.notApplicable));
    renderMetric(2, line);
    std::snprintf(line, sizeof(line), tr(UiTextId::HeapMinFormat),
                  static_cast<unsigned long>(report.facts.heapMinimum / 1024U));
    renderMetric(3, line);
    std::snprintf(line, sizeof(line), tr(UiTextId::InputDropsFormat),
                  static_cast<unsigned long>(report.facts.inputQueueDrops));
    renderMetric(4, line);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 218);
    display.print(tr(report.readOnly ? UiTextId::SelfTestReportUsb
                                    : UiTextId::SelfTestReportActiveUsb));
}

