anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderOverview(bool clearContent) {
    char line[80] = {};
    renderHeader(tr(UiTextId::DiagnosticsTitle), clearContent);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 82);
    display.print(tr(UiTextId::ProfileN16));

    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    std::snprintf(line, sizeof(line), tr(UiTextId::FlashFormat),
                  static_cast<unsigned long>(bootMetrics.flashBytes / 1024U));
    setUiCursor(UiTextRole::Body, 14, 120);
    display.print(line);
    std::snprintf(line, sizeof(line), tr(UiTextId::HeapFreeFormat),
                  static_cast<unsigned long>(ESP.getFreeHeap() / 1024U));
    setUiCursor(UiTextRole::Body, 14, 144);
    display.print(line);
    std::snprintf(line, sizeof(line), tr(UiTextId::UiReadyFormat),
                  static_cast<unsigned long long>(bootMetrics.interactiveReadyUs));
    setUiCursor(UiTextRole::Body, 14, 168);
    display.print(line);

}

UiTextId safetyReasonTextId() {
    switch (safetySupervisor.reason()) {
        case SafetyReason::RuntimeWatchdog:
            return UiTextId::SafetyWatchdogReason;
        case SafetyReason::SupervisorUnavailable:
            return UiTextId::SafetySupervisorReason;
        case SafetyReason::OutputInvariant:
        default:
            return UiTextId::SafetyOutputReason;
    }
}

void renderSafetyStop(bool clearContent) {
    renderHeader(tr(UiTextId::SafetyStopTitle), clearContent);
    display.setTextColor(Palette::Danger, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 52);
    display.print(tr(safetyReasonTextId()));

    display.fillRoundRect(Layout::Edge, 88, Layout::ContentWidth, 82,
                          Layout::Radius, Palette::Surface);
    display.setTextColor(Palette::Positive, Palette::Surface);
    setUiCursor(UiTextRole::Body, 20, 101);
    display.print(tr(UiTextId::SafetyOutputsStopped));
    display.setTextColor(Palette::Warning, Palette::Surface);
    setUiCursor(UiTextRole::Meta, 20, 137);
    display.print(tr(UiTextId::SafetyPowerWarning));

    display.setTextColor(Palette::TextPrimary, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 202);
    display.print(tr(safetySupervisor.clearPending()
                         ? UiTextId::SafetyClearConfirm
                         : UiTextId::SafetyClearPrompt));
    if (safetySupervisor.clearPending()) {
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 240);
        display.print(tr(UiTextId::SafetyClearCancel));
    }
}

constexpr std::size_t kVisibleSurveyRows = 2;
constexpr std::int16_t kSurveyFilterY = 101;
constexpr std::int16_t kSurveyRowsY = 132;

std::size_t surveyFirstVisible(std::size_t selection) {
    return selection < kVisibleSurveyRows
        ? 0
        : selection - kVisibleSurveyRows + 1;
}

void renderSurveyListRow(std::size_t index, std::size_t firstVisible) {
    const Observation* observation = surveyController.visibleAt(index);
    if (observation == nullptr) return;
    const std::int32_t y =
        kSurveyRowsY + static_cast<std::int32_t>(index - firstVisible) * 40;
    const bool selected = !surveyController.filterFocused() &&
                          surveyController.selection() == index;
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Surface;
    display.fillRoundRect(Layout::Edge, y, Layout::ContentWidth, 36,
                          Layout::Radius, background);
    renderFocusCue({Layout::Edge, static_cast<std::int16_t>(y),
                    Layout::ContentWidth, 36}, selected);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    setUiCursor(UiTextRole::Body,
                Layout::Edge + kInteractiveRowTextInset, y - 2);
    char visibleLabel[24] = {};
    const std::size_t visibleLength = observation->labelLength < 15U
        ? observation->labelLength : 15U;
    if (visibleLength == 0) {
        std::strcpy(visibleLabel, tr(UiTextId::Hidden));
    } else {
        std::memcpy(visibleLabel, observation->label.data(), visibleLength);
        if (observation->labelLength > visibleLength) {
            visibleLabel[visibleLength - 1U] = '~';
        }
    }
    display.print(visibleLabel);
    char line[96] = {};
    display.setTextColor(Palette::Positive, background);
    if (observation->radio == RadioKind::Ble) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleRssiFormat),
                      static_cast<int>(observation->rssiDbm));
    } else {
        std::snprintf(line, sizeof(line), tr(UiTextId::ChannelRssiFormat),
                      static_cast<unsigned>(observation->channel),
                      static_cast<int>(observation->rssiDbm));
    }
    setUiCursor(UiTextRole::Meta, 146, y + 13);
    display.print(line);
}

UiTextId surveyFilterLabel(SurveyFilter filter) {
    switch (filter) {
        case SurveyFilter::Wifi: return UiTextId::FilterWifi;
        case SurveyFilter::Ble: return UiTextId::FilterBle;
        case SurveyFilter::All:
        default: return UiTextId::FilterAll;
    }
}

UiTextId surveyFilterBarFormat(SurveyFilter filter) {
    switch (filter) {
        case SurveyFilter::Wifi: return UiTextId::FilterBarWifiFormat;
        case SurveyFilter::Ble: return UiTextId::FilterBarBleFormat;
        case SurveyFilter::All:
        default: return UiTextId::FilterBarAllFormat;
    }
}

void renderSurveyFilterBar() {
    const bool selected = surveyController.filterFocused();
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Surface;
    display.fillRoundRect(Layout::Edge, kSurveyFilterY, Layout::ContentWidth, 26,
                          Layout::Radius, background);
    renderFocusCue({Layout::Edge, kSurveyFilterY, Layout::ContentWidth, 26},
                   selected);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    char line[64] = {};
    std::snprintf(line, sizeof(line), tr(surveyFilterBarFormat(
                      surveyController.filter())),
                  static_cast<unsigned>(surveyController.visibleSize()));
    setUiCursor(UiTextRole::Body,
                Layout::Edge + kInteractiveRowTextInset,
                kSurveyFilterY + 3);
    display.print(line);
}

void renderSurveyFilterOption(std::uint8_t index) {
    if (index > static_cast<std::uint8_t>(SurveyFilter::Ble)) return;
    const SurveyFilter filter = static_cast<SurveyFilter>(index);
    char note[48] = {};
    std::snprintf(note, sizeof(note), tr(UiTextId::FilterCountFormat),
                  static_cast<unsigned>(surveyController.filterCount(filter)));
    renderMenuRow(Components::choiceRow(index), tr(surveyFilterLabel(filter)),
                  note, surveyController.draftFilter() == filter, true,
                  filter == surveyController.filter() ? Tone::Positive
                                                       : Tone::Neutral);
}

void renderRssiHistory(const ObservationHistory& history) {
    if (!history.valid || history.retainedSamples == 0) return;
    char line[64] = {};
    std::snprintf(line, sizeof(line), tr(UiTextId::RssiHistoryFormat),
                  static_cast<unsigned>(history.sampleCount),
                  static_cast<int>(history.minimumRssiDbm),
                  static_cast<int>(history.maximumRssiDbm));
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 199);
    display.print(line);

    constexpr std::int16_t x = 136;
    constexpr std::int16_t y = 187;
    constexpr std::int16_t width = 90;
    constexpr std::int16_t height = 35;
    display.drawRoundRect(x, y, width, height, Layout::Radius, Palette::Divider);
    const auto pointY = [&](std::int16_t rssi) {
        const std::int16_t bounded = rssi < -100 ? -100 : (rssi > -20 ? -20 : rssi);
        return static_cast<std::int16_t>(
            y + height - 3 - ((bounded + 100) * (height - 6)) / 80);
    };
    if (history.retainedSamples == 1) {
        display.fillCircle(x + width / 2, pointY(history.samples[0]), 2,
                           Palette::Focus);
        return;
    }
    for (std::uint8_t index = 1; index < history.retainedSamples; ++index) {
        const std::int16_t previousX = static_cast<std::int16_t>(
            x + 3 + ((index - 1U) * (width - 6)) /
                        (history.retainedSamples - 1U));
        const std::int16_t currentX = static_cast<std::int16_t>(
            x + 3 + (index * (width - 6)) /
                        (history.retainedSamples - 1U));
        display.drawLine(previousX, pointY(history.samples[index - 1U]),
                         currentX, pointY(history.samples[index]),
                         Palette::Focus);
    }
}

