anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
UiTextId surveySourceLabel(const SurveySourceOption& source) {
    return source.kind == SurveySourceKind::Wifi
        ? UiTextId::SourceWifiRow : UiTextId::SourceBleRow;
}

UiTextId surveySourceNote(const SurveySourceOption& source) {
    if (source.state == SurveySourceState::Available) {
        return source.selected ? UiTextId::SourceOnReady
                               : UiTextId::SourceOffReady;
    }
    if (source.state == SurveySourceState::Conflicted) {
        return UiTextId::SourceConflicted;
    }
    if (source.state == SurveySourceState::Fault) {
        return UiTextId::SourceFault;
    }
    return UiTextId::SourceDriverPending;
}

Rect surveyPlanRowBounds(std::uint8_t index) {
    return Components::choiceRow(index);
}

void renderSurveyPlanRow(std::uint8_t index) {
    if (index >= surveySourceController.planItemCount()) return;
    char note[48] = {};
    const bool selected = surveySourceController.selection() == index;
    if (surveySourceController.scope() != SurveySourceScope::All) {
        const bool wifi = surveySourceController.scope() ==
                          SurveySourceScope::WifiOnly;
        const bool ready = surveySourceController.canStart();
        renderMenuRow(surveyPlanRowBounds(index),
                      tr(wifi ? UiTextId::WifiScanStart
                              : UiTextId::BleScanStart),
                      tr(ready ? UiTextId::StartReady
                               : UiTextId::StartNeedsSource),
                      selected, ready,
                      ready ? Tone::Positive : Tone::Warning);
        return;
    }
    if (index == 0) {
        if (surveySourceController.simulatedPreview() &&
            surveySourceController.selectedCount() == 0) {
            std::snprintf(note, sizeof(note), "%s", tr(UiTextId::SourcesPreview));
        } else {
            std::snprintf(note, sizeof(note), tr(UiTextId::SourcesCountFormat),
                          static_cast<unsigned>(
                              surveySourceController.selectedCount()),
                          static_cast<unsigned>(
                              SurveySourceController::kSourceCount));
        }
        renderMenuRow(surveyPlanRowBounds(index), tr(UiTextId::PlanSources),
                      note, selected, true, Tone::Positive);
        return;
    }
    if (index == 1) {
        const bool available = BoardProfile::kRfShieldDeclared &&
            !BoardProfile::kGpsDeclared && !BoardProfile::kPn532Declared;
        renderMenuRow(surveyPlanRowBounds(index), tr(UiTextId::PlanSpectrum),
                      tr(available ? UiTextId::SpectrumReady
                                   : UiTextId::SpectrumUnavailable),
                      selected, available,
                      available ? Tone::Positive : Tone::Warning);
        return;
    }
    const bool preparing =
        std::strcmp(productSurveyRuntime.status, "preparing") == 0;
    const bool cancelling =
        std::strcmp(productSurveyRuntime.status, "cancelling") == 0;
    const bool ready = surveySourceController.canStart() &&
                       !preparing && !cancelling;
    const UiTextId startNote = preparing
        ? UiTextId::StartPreparing
        : (cancelling
               ? UiTextId::StartCancelling
               : (!ready
                      ? UiTextId::StartNeedsSource
                      : (surveySourceController.simulatedPreview()
                             ? UiTextId::StartPreview
                             : UiTextId::StartReady)));
    renderMenuRow(surveyPlanRowBounds(index), tr(UiTextId::PlanStart),
                  tr(startNote), selected, ready,
                  ready ? Tone::Positive : Tone::Warning);
}

void renderSurveySourceRow(std::uint8_t index) {
    const SurveySourceOption* source = surveySourceController.get(index);
    if (source == nullptr) return;
    const bool selected = surveySourceController.selection() == index;
    renderMenuRow(Components::choiceRow(index), tr(surveySourceLabel(*source)),
                  tr(surveySourceNote(*source)), selected,
                  source->available(),
                  source->selected ? Tone::Positive : Tone::Muted);
}

void renderRfSpectrumSourceRow(std::uint8_t index) {
    if (index >= 2) return;
    const bool selected = rfSpectrumSelection == index;
    const bool available = BoardProfile::kRfShieldDeclared &&
        !BoardProfile::kGpsDeclared && !BoardProfile::kPn532Declared;
    renderMenuRow(Components::choiceRow(index),
                  tr(index == 0 ? UiTextId::SpectrumNrf24
                                : UiTextId::SpectrumCc1101),
                  tr(available ? UiTextId::SpectrumRxReady
                               : UiTextId::SpectrumUnavailable),
                  selected, available,
                  available ? Tone::Positive : Tone::Muted);
}

void renderRfSpectrumSourceMenu(bool clearContent) {
    renderHeader(tr(UiTextId::SpectrumSources), clearContent);
    renderRfSpectrumSourceRow(0);
    renderRfSpectrumSourceRow(1);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 207);
    display.print(tr(UiTextId::SpectrumRxOnly));
}

void renderSubGhzModeMenu(bool clearContent) {
    renderHeader(tr(UiTextId::SubGhzModes), clearContent);
    renderMenuRow(Components::choiceRow(0), tr(UiTextId::SubGhzSpectrum),
                  tr(UiTextId::SubGhzSpectrumNote),
                  subGhzModeSelection == 0, true, Tone::Positive);
    renderMenuRow(Components::choiceRow(1), tr(UiTextId::SubGhzRaw),
                  tr(UiTextId::SubGhzRawNote),
                  subGhzModeSelection == 1, true, Tone::Positive);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 207);
    display.print(tr(UiTextId::SpectrumRxOnly));
}

leshy1::drivers::radio::Cc1101SpectrumBand ccBandFromIndex(
    std::uint8_t index) {
    const std::uint8_t count = static_cast<std::uint8_t>(
        leshy1::drivers::radio::Cc1101SpectrumBand::Count);
    return static_cast<leshy1::drivers::radio::Cc1101SpectrumBand>(
        index < count ? index : 0);
}

std::uint8_t ccBandSelectionIndex() {
    return static_cast<std::uint8_t>(rfCcBandSelection);
}

