anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderRfCcBandRow(std::uint8_t index) {
    if (index >= static_cast<std::uint8_t>(
            leshy1::drivers::radio::Cc1101SpectrumBand::Count)) return;
    const auto band = ccBandFromIndex(index);
    const auto plan = leshy1::drivers::radio::cc1101PassiveSpectrumPlan(band);
    char label[40] = {};
    char note[48] = {};
    std::snprintf(label, sizeof(label),
                  tr(UiTextId::CcSpectrumBandChoiceFormat),
                  leshy1::drivers::radio::cc1101SpectrumBandName(band));
    std::snprintf(note, sizeof(note),
                  tr(UiTextId::CcSpectrumBandRangeFormat),
                  static_cast<unsigned long>(plan.firstKHz / 1000U),
                  static_cast<unsigned long>(plan.firstKHz % 1000U),
                  static_cast<unsigned long>(plan.lastKHz / 1000U),
                  static_cast<unsigned long>(plan.lastKHz % 1000U));
    renderMenuRow(Components::homeRow(index), label, note,
                  rfCcBandSelection == band, true, Tone::Positive);
}

void renderRfCcBandMenu(bool clearContent) {
    renderHeader(tr(UiTextId::CcSpectrumBands), clearContent);
    for (std::uint8_t index = 0; index < 4; ++index) {
        renderRfCcBandRow(index);
    }
}

std::uint32_t subGhzCaptureFrequencyKHz(
    leshy1::drivers::radio::Cc1101SpectrumBand band) {
    switch (band) {
        case leshy1::drivers::radio::Cc1101SpectrumBand::Band315:
            return 315000;
        case leshy1::drivers::radio::Cc1101SpectrumBand::Band433:
            return 433920;
        case leshy1::drivers::radio::Cc1101SpectrumBand::Band868:
            return 868350;
        case leshy1::drivers::radio::Cc1101SpectrumBand::Band915:
            return 915000;
        case leshy1::drivers::radio::Cc1101SpectrumBand::Count:
            break;
    }
    return 433920;
}

void renderSubGhzCaptureBandMenu(bool clearContent) {
    renderHeader(tr(UiTextId::SubGhzRawBands), clearContent);
    for (std::uint8_t index = 0; index < 4; ++index) {
        renderRfCcBandRow(index);
    }
}

void renderSubGhzRawCapturePage(bool clearContent) {
    const auto& stats = subGhzRawCapture.stats();
    const UiTextId title = stats.state == SubGhzRawCaptureState::Waiting
        ? UiTextId::SubGhzRawWaiting
        : stats.state == SubGhzRawCaptureState::Capturing
              ? UiTextId::SubGhzRawCapturing
              : stats.state == SubGhzRawCaptureState::Complete
                    ? UiTextId::SubGhzRawComplete
                    : stats.state == SubGhzRawCaptureState::TimedOut
                          ? UiTextId::SubGhzRawTimedOut
                          : stats.state ==
                                    SubGhzRawCaptureState::SignalTooLong
                                ? UiTextId::SubGhzRawTooLong
                          : UiTextId::SubGhzRawFailed;
    renderHeader(tr(title), clearContent);
    char line[96] = {};
    const auto& plan = subGhzRawCapture.plan();
    std::snprintf(line, sizeof(line), tr(UiTextId::SubGhzRawFrequencyFormat),
                  static_cast<unsigned long>(plan.frequencyKHz / 1000U),
                  static_cast<unsigned long>(plan.frequencyKHz % 1000U));
    renderMetric(0, line, Tone::Positive);
    std::snprintf(line, sizeof(line), tr(UiTextId::SubGhzRawThresholdFormat),
                  static_cast<int>(plan.thresholdDbm));
    renderMetric(1, line);
    std::snprintf(line, sizeof(line), tr(UiTextId::SubGhzRawPulsesFormat),
                  static_cast<unsigned long>(stats.pulsesAccepted));
    renderMetric(2, line,
                 stats.state == SubGhzRawCaptureState::Complete
                     ? Tone::Positive : Tone::Warning);
    std::snprintf(line, sizeof(line), tr(UiTextId::SubGhzRawSamplesFormat),
                  static_cast<unsigned long>(stats.samples));
    renderMetric(3, line);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 207);
    display.print(tr(stats.state == SubGhzRawCaptureState::Complete
                         ? subGhzCapturePersistState ==
                                   CapturePersistState::Saving
                               ? UiTextId::CaptureSavingNote
                               : subGhzCapturePersistState ==
                                         CapturePersistState::Saved
                                     ? UiTextId::CaptureSavedNote
                                     : subGhzCapturePersistState ==
                                               CapturePersistState::Failed
                                           ? UiTextId::CaptureSaveFailedNote
                                           : UiTextId::SubGhzRawCompleteNote
                         : stats.state == SubGhzRawCaptureState::TimedOut
                               ? UiTextId::SubGhzRawNoSignalNote
                               : stats.state ==
                                         SubGhzRawCaptureState::SignalTooLong
                                     ? UiTextId::SubGhzRawTooLongNote
                               : UiTextId::SubGhzRawWaitingNote));
    setUiCursor(UiTextRole::Meta, 14, 221);
    display.print(tr(UiTextId::SubGhzRawFskLater));
}

constexpr std::int16_t kSpectrumOverlayY = Layout::HeaderHeight;
constexpr std::int16_t kSpectrumOverlayHeight = 28;
constexpr std::int16_t kSpectrumAxisHeight = 15;
constexpr std::int16_t kSpectrumAxisY =
    Layout::FooterDividerY - kSpectrumAxisHeight;
constexpr std::int16_t kSpectrumGraphY =
    kSpectrumOverlayY + kSpectrumOverlayHeight;
constexpr std::int16_t kSpectrumGraphHeight =
    kSpectrumAxisY - kSpectrumGraphY;
static_assert(kSpectrumGraphHeight == SpectrumViewport::kHistoryRows,
              "each waterfall sample must occupy exactly one TFT row");
static_assert(Layout::ScreenWidth == SpectrumViewport::kDisplayColumns,
              "the expanded spectrum scanline must span the TFT width");
constexpr std::uint16_t kSpectrumNoSignal =
    leshy1::ui::visual::rgb565(0, 0, 0);
constexpr std::uint16_t kWifiChannelDivider =
    leshy1::ui::visual::rgb565(24, 44, 40);
constexpr std::uint16_t kWifiPrimaryChannelDivider =
    leshy1::ui::visual::rgb565(104, 84, 16);
constexpr std::uint8_t kSpectrumQuietThreshold = 8;

std::int16_t wifiChannelCenterX(std::uint8_t channel) {
    const std::uint16_t frequencyMhz = static_cast<std::uint16_t>(
        2412U + static_cast<std::uint16_t>(channel - 1U) * 5U);
    return static_cast<std::int16_t>(
        (static_cast<std::uint32_t>(frequencyMhz - 2402U) *
             (Layout::ScreenWidth - 1) + 41U) /
        82U);
}

std::uint16_t spectrumTone(std::uint8_t intensity) {
    if (intensity < kSpectrumQuietThreshold) return kSpectrumNoSignal;
    if (intensity < 64U) {
        return leshy1::ui::visual::rgb565(
            0, static_cast<std::uint8_t>(intensity * 2U), 196);
    }
    if (intensity < 128U) {
        return leshy1::ui::visual::rgb565(
            0, static_cast<std::uint8_t>(128U + intensity),
            static_cast<std::uint8_t>(255U - (intensity - 64U) * 3U));
    }
    if (intensity < 192U) {
        return leshy1::ui::visual::rgb565(
            static_cast<std::uint8_t>((intensity - 128U) * 4U), 255, 0);
    }
    return leshy1::ui::visual::rgb565(
        255, static_cast<std::uint8_t>(255U - (intensity - 192U) * 4U), 0);
}

std::uint16_t wifiChannelGridTone(std::int16_t x,
                                  std::uint8_t intensity) {
    const std::uint16_t signal = spectrumTone(intensity);
    if (intensity >= kSpectrumQuietThreshold) return signal;
    for (std::uint8_t channel = 1; channel <= 13; ++channel) {
        if (x != wifiChannelCenterX(channel)) continue;
        return channel == 1 || channel == 6 || channel == 11
            ? kWifiPrimaryChannelDivider : kWifiChannelDivider;
    }
    return signal;
}

const char* spectrumDisplayModeText() {
    return tr(spectrumViewport.mode() == SpectrumDisplayMode::Spectrum
                  ? UiTextId::SpectrumDisplaySpectrum
                  : UiTextId::SpectrumDisplayWaterfall);
}

std::size_t activeSpectrumBins() {
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? Cc1101SpectrumController::kBinCount
        : Nrf24SpectrumController::kChannelCount;
}

std::uint8_t activeSpectrumIntensity(std::size_t bin) {
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? cc1101SpectrumController.intensity(bin)
        : nrf24SpectrumController.displayIntensity(bin);
}

bool pushActiveSpectrumHistory() {
    const std::size_t bins = activeSpectrumBins();
    for (std::size_t bin = 0; bin < bins; ++bin) {
        spectrumIntensity[bin] = activeSpectrumIntensity(bin);
    }
    return spectrumViewport.push(spectrumIntensity.data(), bins);
}

