anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void prepareWaterfallScanline(std::size_t row) {
    for (std::int16_t x = 0; x < Layout::ScreenWidth; ++x) {
        const std::uint8_t intensity = spectrumViewport.intensity(
            row, static_cast<std::size_t>(x));
        spectrumScanline[static_cast<std::size_t>(x)] =
            rfSpectrumKind == RfSpectrumKind::Nrf24
                ? wifiChannelGridTone(x, intensity)
                : spectrumTone(intensity);
    }
}

void renderWaterfallSlot(std::size_t row) {
    if (!spectrumViewport.rowValid(row)) return;
    prepareWaterfallScanline(row);
    const std::int16_t firstY = kSpectrumGraphY +
        static_cast<std::int32_t>(row) * kSpectrumGraphHeight /
            SpectrumViewport::kHistoryRows;
    const std::int16_t nextY = kSpectrumGraphY +
        static_cast<std::int32_t>(row + 1U) * kSpectrumGraphHeight /
            SpectrumViewport::kHistoryRows;
    for (std::int16_t y = firstY; y < nextY; ++y) {
        display.pushImage(0, y, Layout::ScreenWidth, 1,
                          spectrumScanline.data());
    }
}

void renderWaterfallCursor() {
    const std::int16_t y = kSpectrumGraphY +
        static_cast<std::int32_t>(spectrumViewport.nextRow()) *
            kSpectrumGraphHeight / SpectrumViewport::kHistoryRows;
    display.drawFastHLine(0, y < kSpectrumAxisY ? y : kSpectrumGraphY,
                          Layout::ScreenWidth, Palette::Divider);
}

void renderSpectrumWaterfall() {
    display.fillRect(0, kSpectrumGraphY, Layout::ScreenWidth,
                     kSpectrumGraphHeight, kSpectrumNoSignal);
    for (std::size_t row = 0; row < SpectrumViewport::kHistoryRows; ++row) {
        renderWaterfallSlot(row);
    }
    renderWaterfallCursor();
}

void renderLatestWaterfallRow() {
    renderWaterfallSlot(spectrumViewport.latestRow());
    renderWaterfallCursor();
}

void renderSpectrumBars() {
    display.fillRect(0, kSpectrumGraphY, Layout::ScreenWidth,
                     kSpectrumGraphHeight, Palette::Surface);
    const std::size_t bins = activeSpectrumBins();
    for (std::size_t bin = 0; bin < bins; ++bin) {
        spectrumIntensity[bin] = activeSpectrumIntensity(bin);
    }
    for (std::int16_t x = 0; x < Layout::ScreenWidth; ++x) {
        const std::uint8_t intensity = SpectrumViewport::resample(
            spectrumIntensity.data(), bins, static_cast<std::size_t>(x));
        const std::int16_t height = intensity == 0
            ? 1
            : static_cast<std::int16_t>(1 +
                  static_cast<std::uint32_t>(intensity) *
                      (kSpectrumGraphHeight - 1) / 255U);
        display.drawFastVLine(x, kSpectrumAxisY - height, height,
                              spectrumTone(intensity));
    }
}

void renderActiveSpectrumData() {
    if (spectrumViewport.mode() == SpectrumDisplayMode::Waterfall) {
        renderSpectrumWaterfall();
    } else {
        renderSpectrumBars();
    }
}

void renderSpectrumModeAtRight() {
    const char* mode = spectrumDisplayModeText();
    selectUiFont(UiTextRole::Meta);
    const std::int16_t width = display.textWidth(mode);
    display.setTextColor(Palette::Focus, Palette::Surface);
    setUiCursor(UiTextRole::Meta, Layout::ScreenWidth - 4 - width,
                kSpectrumOverlayY);
    display.print(mode);
}

void renderSpectrumLegend(UiTextId receiverState, Tone tone,
                          UiTextId quietId = UiTextId::SpectrumLegendQuiet,
                          UiTextId strongId = UiTextId::SpectrumLegendStrong,
                          UiTextId metricId = UiTextId::Count) {
    display.fillRect(0, kSpectrumOverlayY, Layout::ScreenWidth,
                     kSpectrumOverlayHeight, Palette::Surface);
    display.setTextColor(tone == Tone::Danger ? Palette::Danger
                                              : Palette::Positive,
                         Palette::Surface);
    setUiCursor(UiTextRole::Meta, 4, kSpectrumOverlayY);
    display.print(tr(receiverState));
    if (metricId != UiTextId::Count) {
        display.print(tr(UiTextId::SpectrumModeSeparator));
        display.print(tr(metricId));
    }
    renderSpectrumModeAtRight();

    constexpr std::int16_t kLegendGap = 5;
    constexpr std::int16_t kLegendTop = kSpectrumOverlayY + 14;
    constexpr std::int16_t kLegendBarTop = kLegendTop + 3;
    constexpr std::int16_t kLegendBarHeight = 7;
    const char* quiet = tr(quietId);
    const char* strong = tr(strongId);
    selectUiFont(UiTextRole::Meta);
    const std::int16_t quietWidth = display.textWidth(quiet);
    const std::int16_t strongWidth = display.textWidth(strong);
    const std::int16_t strongX = Layout::ScreenWidth - 4 - strongWidth;
    const std::int16_t barX = 4 + quietWidth + kLegendGap;
    const std::int16_t barWidth = strongX - kLegendGap - barX;
    display.setTextColor(Palette::TextSecondary, Palette::Surface);
    setUiCursor(UiTextRole::Meta, 4, kLegendTop);
    display.print(quiet);
    setUiCursor(UiTextRole::Meta, strongX, kLegendTop);
    display.print(strong);
    for (std::int16_t x = 0; x < barWidth; ++x) {
        const std::uint8_t intensity = static_cast<std::uint8_t>(
            static_cast<std::uint32_t>(x) * 255U /
            static_cast<std::uint32_t>(barWidth - 1));
        display.drawFastVLine(barX + x, kLegendBarTop, kLegendBarHeight,
                              spectrumTone(intensity));
    }
}

void renderNrf24SpectrumLegend() {
    const Nrf24SpectrumViewState state = nrf24SpectrumController.state();
    const bool traffic = nrf24SpectrumController.metric() ==
        Nrf24SpectrumMetric::Traffic;
    renderSpectrumLegend(
        state == Nrf24SpectrumViewState::Running
            ? UiTextId::SpectrumOverlayRunning
            : (state == Nrf24SpectrumViewState::Paused
                   ? UiTextId::SpectrumOverlayPaused : UiTextId::SpectrumFault),
        state == Nrf24SpectrumViewState::Fault ? Tone::Danger : Tone::Positive,
        traffic ? UiTextId::SpectrumLegendBaseline
                : UiTextId::SpectrumLegendQuiet,
        traffic ? UiTextId::SpectrumLegendBurst
                : UiTextId::SpectrumLegendStrong,
        traffic ? UiTextId::SpectrumMetricTraffic
                : UiTextId::SpectrumMetricSignal);
}

void renderNrf24SpectrumAxis() {
    display.fillRect(0, kSpectrumAxisY, Layout::ScreenWidth,
                     kSpectrumAxisHeight, Palette::Canvas);
    selectUiFont(UiTextRole::Meta);
    for (std::uint8_t channel = 1; channel <= 13; ++channel) {
        const std::int16_t centerX = wifiChannelCenterX(channel);
        const bool primary = channel == 1 || channel == 6 || channel == 11;
        display.drawFastVLine(centerX, kSpectrumAxisY, 2,
            primary ? kWifiPrimaryChannelDivider : kWifiChannelDivider);
        char label[3] = {};
        std::snprintf(label, sizeof(label), "%u",
                      static_cast<unsigned>(channel));
        const std::int16_t width = display.textWidth(label);
        display.setTextColor(primary ? Palette::Warning : Palette::TextMuted,
                             Palette::Canvas);
        setUiCursor(UiTextRole::Meta, centerX - width / 2,
                    kSpectrumAxisY + 2);
        display.print(label);
    }
}

void renderNrf24SpectrumPage(bool clearContent) {
    renderHeader(tr(UiTextId::SpectrumTitle), clearContent);
    renderActiveSpectrumData();
    renderNrf24SpectrumLegend();
    renderNrf24SpectrumAxis();
}

void formatCcFrequency(std::uint32_t frequencyKHz, char* output,
                       std::size_t capacity) {
    if (output == nullptr || capacity == 0) return;
    std::snprintf(output, capacity, "%lu.%03lu",
                  static_cast<unsigned long>(frequencyKHz / 1000U),
                  static_cast<unsigned long>(frequencyKHz % 1000U));
}

void renderCc1101SpectrumAxis() {
    display.fillRect(0, kSpectrumAxisY, Layout::ScreenWidth,
                     kSpectrumAxisHeight, Palette::Canvas);
    const Cc1101PassiveSpectrumPlan plan = cc1101SpectrumController.plan();
    char first[16] = {};
    char middle[16] = {};
    char last[16] = {};
    formatCcFrequency(plan.firstKHz, first, sizeof(first));
    formatCcFrequency(plan.firstKHz + (plan.lastKHz - plan.firstKHz) / 2U,
                      middle, sizeof(middle));
    formatCcFrequency(plan.lastKHz, last, sizeof(last));
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    selectUiFont(UiTextRole::Meta);
    setUiCursor(UiTextRole::Meta, 2, kSpectrumAxisY);
    display.print(first);
    setUiCursor(UiTextRole::Meta,
                (Layout::ScreenWidth - display.textWidth(middle)) / 2,
                kSpectrumAxisY);
    display.print(middle);
    setUiCursor(UiTextRole::Meta,
                Layout::ScreenWidth - 2 - display.textWidth(last),
                kSpectrumAxisY);
    display.print(last);
}

