anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderCc1101SpectrumLegend() {
    const Cc1101SpectrumViewState state = cc1101SpectrumController.state();
    renderSpectrumLegend(
        state == Cc1101SpectrumViewState::Running
            ? UiTextId::CcSpectrumOverlayRunning
            : (state == Cc1101SpectrumViewState::Paused
                   ? UiTextId::CcSpectrumOverlayPaused : UiTextId::SpectrumFault),
        state == Cc1101SpectrumViewState::Fault ? Tone::Danger : Tone::Positive);
}

void renderCc1101SpectrumPage(bool clearContent) {
    renderHeader(tr(UiTextId::CcSpectrumTitle), clearContent);
    renderActiveSpectrumData();
    renderCc1101SpectrumLegend();
    renderCc1101SpectrumAxis();
}

void renderInventoryPage(bool clearContent) {
    char line[96] = {};
    if (rfSpectrumView == RfSpectrumView::SourceMenu) {
        renderRfSpectrumSourceMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SubGhzMenu) {
        renderSubGhzModeMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::CcBandMenu) {
        renderRfCcBandMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) {
        renderSubGhzCaptureBandMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive) {
        renderSubGhzRawCapturePage(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::Live) {
        if (rfSpectrumKind == RfSpectrumKind::Cc1101) {
            renderCc1101SpectrumPage(clearContent);
        } else {
            renderNrf24SpectrumPage(clearContent);
        }
        return;
    }
    if (productSurveySourceUnavailableVisible()) {
        renderHeader(tr(UiTextId::SurveyUnavailable), clearContent);
        display.setTextColor(Palette::Danger, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 82);
        display.print(tr(UiTextId::SourceUnavailableReason));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 116);
        display.print(tr(UiTextId::NoSessionCreated));
        setUiCursor(UiTextRole::Body, 14, 150);
        display.print(tr(UiTextId::PriorLibraryPreserved));
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 207);
        display.print(tr(UiTextId::BackNoRetry));
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Setup) {
        if (surveySourceController.view() == SurveySetupView::Sources) {
            renderHeader(tr(UiTextId::SurveySources), clearContent);
            for (std::uint8_t index = 0;
                 index < SurveySourceController::kSourceCount; ++index) {
                renderSurveySourceRow(index);
            }
        } else {
            const UiTextId title = surveySourceController.scope() ==
                    SurveySourceScope::WifiOnly
                ? UiTextId::WifiScanSetup
                : (surveySourceController.scope() ==
                           SurveySourceScope::BleOnly
                       ? UiTextId::BleScanSetup
                       : UiTextId::SurveySetup);
            renderHeader(tr(title), clearContent);
            for (std::uint8_t index = 0;
                 index < surveySourceController.planItemCount(); ++index) {
                renderSurveyPlanRow(index);
            }
        }
        if (surveySourceController.view() == SurveySetupView::Sources) {
            display.setTextColor(Palette::Positive, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 14, 207);
            display.print(surveyWorkflow.simulated()
                              ? tr(UiTextId::FifoNoRf)
                              : tr(UiTextId::FifoRxOnly));
        }
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Result) {
        renderHeader(tr(UiTextId::SurveyCommitted), clearContent);
        display.setTextColor(Palette::Focus, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 80);
        display.print(surveySession.id());
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        std::snprintf(line, sizeof(line), tr(UiTextId::ObservationsFormat),
                      static_cast<unsigned>(surveySession.size()));
        setUiCursor(UiTextRole::Body, 14, 120);
        display.print(line);
        std::snprintf(line, sizeof(line), tr(UiTextId::GenerationFormat),
                      static_cast<unsigned long>(surveyWorkflow.generation()));
        setUiCursor(UiTextRole::Body, 14, 148);
        display.print(line);
        setUiCursor(UiTextRole::Body, 14, 176);
        display.print(surveyWorkflow.persistent()
                          ? tr(UiTextId::StorageProduct)
                          : tr(UiTextId::StorageRamOnly));
        const SurveyPipelineProgress progress = surveyPipeline.progress();
        std::snprintf(line, sizeof(line), tr(UiTextId::PipelineFormat),
                      static_cast<unsigned>(progress.queueHighWater),
                      static_cast<unsigned long long>(progress.dropped));
        setUiCursor(UiTextRole::Meta, 14, 196);
        display.print(line);
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 211);
        display.print(tr(UiTextId::OneCommit));
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Error) {
        renderHeader(tr(UiTextId::SurveyError), clearContent);
        display.setTextColor(Palette::Danger, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 82);
        display.print(leshy1::apps::survey::surveyWorkflowStatusName(
            surveyWorkflow.lastStatus()));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 122);
        display.print(tr(UiTextId::PriorLibraryPreserved));
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 207);
        display.print(tr(UiTextId::BackNoRetry));
        return;
    }
    if (surveyController.view() == SurveyView::Filter) {
        renderHeader(tr(UiTextId::SurveyFilter), clearContent);
        for (std::uint8_t index = 0;
             index <= static_cast<std::uint8_t>(SurveyFilter::Ble); ++index) {
            renderSurveyFilterOption(index);
        }
        return;
    }
    if (surveyController.view() == SurveyView::Detail) {
        renderHeader(tr(UiTextId::SurveyDetail), clearContent);
        const Observation* observation = surveyController.selected();
        if (observation == nullptr) return;
        display.setTextFont(4);
        activeDisplayFont = ActiveDisplayFont::None;
        display.setTextColor(Palette::Focus, Palette::Canvas);
        display.setCursor(14, 88);
        display.print(observation->label.data());
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        if (observation->radio == RadioKind::Ble) {
            setUiCursor(UiTextRole::Body, 14, 122);
            display.print(tr(UiTextId::BleSource));
            std::snprintf(
                line, sizeof(line), tr(UiTextId::BleAddressFormat),
                static_cast<unsigned>(observation->identity[0]),
                static_cast<unsigned>(observation->identity[1]),
                static_cast<unsigned>(observation->identity[2]),
                static_cast<unsigned>(observation->identity[3]),
                static_cast<unsigned>(observation->identity[4]),
                static_cast<unsigned>(observation->identity[5]));
            setUiCursor(UiTextRole::Meta, 14, 151);
            display.print(line);
        } else {
            std::snprintf(line, sizeof(line), tr(UiTextId::ChannelFormat),
                          static_cast<unsigned>(observation->channel));
            setUiCursor(UiTextRole::Body, 14, 122);
            display.print(line);
            std::snprintf(line, sizeof(line), tr(UiTextId::FrequencyFormat),
                          static_cast<unsigned long>(observation->frequencyKhz));
            setUiCursor(UiTextRole::Body, 14, 148);
            display.print(line);
        }
        std::snprintf(line, sizeof(line), tr(UiTextId::RssiFormat),
                      static_cast<int>(observation->rssiDbm));
        setUiCursor(UiTextRole::Body, 14, 174);
        display.print(line);
        const ObservationHistory history = surveyController.selectedHistory();
        if (history.valid) {
            renderRssiHistory(history);
        } else {
            display.setTextColor(Palette::Positive, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 14, 203);
            display.print(surveyWorkflow.simulated()
                              ? tr(UiTextId::SimulatedData)
                              : tr(UiTextId::RealPassive));
        }
        return;
    }

