anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    renderHeader(tr(UiTextId::SurveyRunning), clearContent);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 70);
    if (std::strcmp(productSurveyRuntime.status, "paused") == 0) {
        display.print(tr(UiTextId::SurveyPaused));
    } else if (std::strcmp(productSurveyRuntime.status, "pausing") == 0) {
        display.print(tr(UiTextId::SurveyPausing));
    } else if (std::strcmp(productSurveyRuntime.status, "stopping") == 0) {
        display.print(tr(UiTextId::SurveyStopping));
    } else if (std::strcmp(productSurveyRuntime.status, "cancelling") == 0) {
        display.print(tr(UiTextId::SurveyCancelling));
    } else if (!surveyWorkflow.simulated() &&
               productSurveyTimeline.state() == SourceTimelineState::Running) {
        const std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        const auto* wifi = productSurveyTimeline.source(RadioKind::Wifi);
        const auto* ble = productSurveyTimeline.source(RadioKind::Ble);
        const bool both = wifi != nullptr && wifi->selected &&
                          ble != nullptr && ble->selected;
        std::int16_t sourceY = both ? 63 : 70;
        if (wifi != nullptr && wifi->selected) {
            const bool unavailable =
                wifi->state == SourceWindowState::Unavailable ||
                wifi->state == SourceWindowState::Fault;
            display.setTextColor(
                unavailable ? Palette::Warning : Palette::Positive,
                Palette::Canvas);
            if (unavailable) {
                std::snprintf(line, sizeof(line), "%s",
                              tr(UiTextId::TimelineWifiUnavailable));
            } else {
                const UiTextId stateFormat =
                    wifi->state == SourceWindowState::Active
                        ? UiTextId::TimelineWifiActiveFormat
                        : UiTextId::TimelineWifiWaitingFormat;
                std::snprintf(
                    line, sizeof(line), tr(stateFormat),
                    static_cast<unsigned>(productSurveyTimeline.dutyPermille(
                        RadioKind::Wifi, nowUs) / 10U));
            }
            setUiCursor(UiTextRole::Meta, 14, sourceY);
            display.print(line);
            sourceY += 13;
        }
        if (ble != nullptr && ble->selected) {
            const bool unavailable =
                ble->state == SourceWindowState::Unavailable ||
                ble->state == SourceWindowState::Fault;
            display.setTextColor(
                unavailable ? Palette::Warning : Palette::Positive,
                Palette::Canvas);
            if (unavailable) {
                std::snprintf(line, sizeof(line), "%s",
                              tr(UiTextId::TimelineBleUnavailable));
            } else {
                const UiTextId stateFormat =
                    ble->state == SourceWindowState::Active
                        ? UiTextId::TimelineBleActiveFormat
                        : UiTextId::TimelineBleWaitingFormat;
                std::snprintf(
                    line, sizeof(line), tr(stateFormat),
                    static_cast<unsigned>(productSurveyTimeline.dutyPermille(
                        RadioKind::Ble, nowUs) / 10U));
            }
            setUiCursor(UiTextRole::Meta, 14, sourceY);
            display.print(line);
        }
    } else {
        display.print(surveyWorkflow.simulated()
                          ? tr(UiTextId::RunningSimulated)
                          : tr(UiTextId::RunningPassive));
    }
    display.setTextColor(Palette::Positive, Palette::Canvas);
    const SurveyPipelineProgress progress = surveyPipeline.progress();
    std::snprintf(line, sizeof(line), tr(UiTextId::FifoFormat),
                  static_cast<unsigned>(progress.queueDepth),
                  static_cast<unsigned>(progress.queueHighWater),
                  static_cast<unsigned long long>(progress.dropped));
    setUiCursor(UiTextRole::Meta, 14,
                productSurveyTimeline.selectedMask() == 3 ? 89 : 82);
    display.print(line);
    renderSurveyFilterBar();
    const std::size_t selection = surveyController.selection();
    const std::size_t firstVisible = surveyFirstVisible(selection);
    const std::size_t endVisible =
        surveyController.visibleSize() < firstVisible + kVisibleSurveyRows
            ? surveyController.visibleSize()
            : firstVisible + kVisibleSurveyRows;
    for (std::size_t index = firstVisible; index < endVisible; ++index) {
        renderSurveyListRow(index, firstVisible);
    }
}

void renderLibraryListRow(std::size_t index) {
    const LibraryEntry* entry = libraryController.get(index);
    if (entry == nullptr || entry->session == nullptr) return;
    const std::int32_t y = 94 + static_cast<std::int32_t>(index) * 48;
    const bool selected = libraryController.selection() == index;
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Surface;
    display.fillRoundRect(Layout::Edge, y, Layout::ContentWidth,
                          Layout::RowHeight, Layout::Radius, background);
    renderFocusCue({Layout::Edge, static_cast<std::int16_t>(y),
                    Layout::ContentWidth, Layout::RowHeight}, selected);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    setUiCursor(UiTextRole::Body,
                Layout::Edge + kInteractiveRowTextInset, y - 1);
    display.print(entry->session->id());
    char line[96] = {};
    display.setTextColor(Palette::Positive, background);
    const auto& capture = entry->session->captureMetadata();
    std::snprintf(line, sizeof(line),
                  tr(capture.subGhzRawCaptured
                         ? UiTextId::LibraryRawRowFormat
                         : capture.framePayloadCaptured
                               ? UiTextId::LibraryCaptureRowFormat
                               : UiTextId::LibraryRowFormat),
                  static_cast<unsigned>(capture.subGhzRawCaptured
                      ? capture.subGhzPulseRecords
                      : capture.framePayloadCaptured
                            ? capture.framePayloadRecords
                            : entry->session->size()),
                  static_cast<unsigned long>(entry->generation),
                  leshy1::apps::library::sessionIntegrityName(entry->integrity));
    setUiCursor(UiTextRole::Meta,
                Layout::Edge + kInteractiveRowTextInset, y + 23);
    display.print(line);
}

void renderLibraryPage(bool clearContent) {
    char line[96] = {};
    const LibraryEntry* selected = libraryController.selected();
    const bool persistent = selected != nullptr && selected->persistent;
    if (libraryController.view() == LibraryView::ExportReady) {
        renderHeader(tr(UiTextId::ExportReady), clearContent);
        if (selected == nullptr || selected->session == nullptr) return;
        display.setTextColor(Palette::Focus, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 80);
        display.print(selected->session->id());
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 111);
        display.print(tr(UiTextId::CaptureImmutable));
        setUiCursor(UiTextRole::Body, 14, 132);
        display.print(tr(UiTextId::FormatSummaryReady));
        setUiCursor(UiTextRole::Body, 14, 155);
        const auto& capture = selected->session->captureMetadata();
        const bool rawFrames = capture.framePayloadCaptured;
        display.print(tr(capture.subGhzRawCaptured
                             ? UiTextId::FormatPulseCsvReady
                             : rawFrames ? UiTextId::FormatCsvNoObservations
                                         : UiTextId::FormatCsvReady));
        setUiCursor(UiTextRole::Meta, 14, 180);
        display.print(tr(capture.subGhzRawCaptured
                             ? UiTextId::FormatPcapNotApplicable
                             : rawFrames ? UiTextId::FormatPcapReady
                                         : UiTextId::FormatPcapNoFrames));
        setUiCursor(UiTextRole::Meta, 14, 201);
        display.print(tr(UiTextId::TransportSerial));
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 219);
        display.print(persistent ? tr(UiTextId::PersistentMedia)
                                 : tr(UiTextId::BoundedRamSource));
        return;
    }
    if (libraryController.view() == LibraryView::SessionDetail) {
        renderHeader(tr(UiTextId::SessionDetail), clearContent);
        if (selected == nullptr || selected->session == nullptr) return;
        display.setTextColor(Palette::Focus, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 80);
        display.print(selected->session->id());
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        std::snprintf(line, sizeof(line), tr(UiTextId::GenerationFormat),
                      static_cast<unsigned long>(selected->generation));
        setUiCursor(UiTextRole::Body, 14, 116);
        display.print(line);
        const auto& capture = selected->session->captureMetadata();
        if (capture.subGhzRawCaptured) {
            std::snprintf(
                line, sizeof(line), tr(UiTextId::RawPayloadFormat),
                static_cast<unsigned>(capture.subGhzPulseRecords),
                static_cast<unsigned long>(capture.subGhzPulseBytes));
        } else if (capture.framePayloadCaptured) {
            std::snprintf(
                line, sizeof(line), tr(UiTextId::CapturePayloadFormat),
                static_cast<unsigned>(capture.framePayloadRecords),
                static_cast<unsigned long long>(capture.framePayloadBytes));
        } else {
            std::snprintf(line, sizeof(line), tr(UiTextId::ObservationsFormat),
                          static_cast<unsigned>(selected->session->size()));
        }
        setUiCursor(UiTextRole::Body, 14, 142);
        display.print(line);
        std::snprintf(line, sizeof(line), tr(UiTextId::IntegrityFormat),
                      leshy1::apps::library::sessionIntegrityName(selected->integrity));
        setUiCursor(UiTextRole::Body, 14, 168);
        display.print(line);
        const auto& timeline = selected->session->timeline();
        if (timeline.present && timeline.finalized) {
            const std::uint64_t elapsed = timeline.stoppedUs - timeline.startedUs;
            const std::uint16_t wifiDuty = elapsed == 0
                ? 0
                : static_cast<std::uint16_t>(
                      timeline.sources[0].activeUs >= elapsed
                          ? 100
                          : (timeline.sources[0].activeUs * 100U) / elapsed);
            const std::uint16_t bleDuty = elapsed == 0
                ? 0
                : static_cast<std::uint16_t>(
                      timeline.sources[1].activeUs >= elapsed
                          ? 100
                          : (timeline.sources[1].activeUs * 100U) / elapsed);
            std::snprintf(
                line, sizeof(line), tr(UiTextId::TimelineStoredFormat),
                static_cast<unsigned long>(timeline.totalWindows),
                static_cast<unsigned>(selected->session->timelineWindowCount()));
            setUiCursor(UiTextRole::Body, 14, 188);
            display.print(line);
            std::snprintf(line, sizeof(line), tr(UiTextId::TimelineDutyFormat),
                          static_cast<unsigned>(wifiDuty),
                          static_cast<unsigned>(bleDuty));
            setUiCursor(UiTextRole::Meta, 14, 207);
            display.print(line);
        }
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14,
                    timeline.present && timeline.finalized ? 222 : 199);
        display.print(
            !persistent
                ? tr(UiTextId::RamVolatile)
                : (selected->integrity ==
                           leshy1::apps::library::SessionIntegrity::Valid
                       ? tr(UiTextId::PersistentValid)
                       : tr(UiTextId::PersistentRecovered)));
        return;
    }

    renderHeader(tr(UiTextId::LibraryOffline), clearContent);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 70);
    display.print(persistent ? tr(UiTextId::PersistentSession)
                             : tr(UiTextId::SimulatedRam));
    for (std::size_t index = 0; index < libraryController.size(); ++index) {
        renderLibraryListRow(index);
    }
}

struct UiRenderSnapshot final {
    bool valid = false;
    std::uint8_t page = 0;
    std::uint8_t rootSelection = 0;
    std::uint8_t deviceSelection = 0;
    std::uint8_t languageSelection = 0;
    std::uint8_t selfTestView = 0;
    std::uint8_t selfTestSelection = 0;
    std::uint8_t rfSpectrumView = 0;
    std::uint8_t rfSpectrumSelection = 0;
    std::uint8_t subGhzModeSelection = 0;
    std::uint8_t rfCcBandSelection = 0;
    std::uint8_t rfSpectrumDisplayMode = 0;
    std::uint8_t surveyState = 0;
    std::uint8_t surveySetupView = 0;
    std::uint8_t surveySetupSelection = 0;
    std::uint8_t surveySourceMask = 0;
    std::uint8_t surveyView = 0;
    std::uint8_t surveyFilter = 0;
    std::uint8_t surveyDraftFilter = 0;
    bool surveyFilterFocused = false;
    std::size_t surveySelection = 0;
    std::size_t surveySize = 0;
    std::size_t surveyVisibleSize = 0;
    std::uint8_t libraryView = 0;
    std::size_t librarySelection = 0;
    std::size_t librarySize = 0;
};

UiRenderSnapshot renderedUi{};

