anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (uiController.page() == 6 &&
        selfTestController.view() == SelfTestView::ModeMenu &&
        renderedUi.selfTestView ==
            static_cast<std::uint8_t>(SelfTestView::ModeMenu)) {
        const std::uint8_t current = selfTestController.selection();
        if (renderedUi.selfTestSelection == current) return false;
        renderSelfTestModeRow(renderedUi.selfTestSelection);
        renderSelfTestModeRow(current);
        return true;
    }
    return false;
}

void renderInteractiveScreen(bool clearContent) {
    std::uint64_t startedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    display.startWrite();
    const bool incremental = !safetySupervisor.latched() && !clearContent &&
                             renderSelectionDelta();
    if (!incremental) {
        clearContent = true;
        if (safetySupervisor.latched()) {
            renderSafetyStop(clearContent);
        } else if (uiController.isRoot()) {
            renderHome(clearContent);
        } else if (uiController.page() == 1) {
            renderOverview(clearContent);
        } else if (uiController.page() == 2) {
            renderInventoryPage(clearContent);
        } else if (uiController.page() == 3) {
            renderLibraryPage(clearContent);
        } else if (uiController.page() == 4) {
            renderCapturePage(clearContent);
        } else if (uiController.page() == 5) {
            renderLanguagePage(clearContent);
        } else if (uiController.page() == 6) {
            renderSelfTestPage(clearContent);
        } else if (uiController.page() == kDevicePage) {
            renderDevicePage(clearContent);
        } else {
            renderAboutPage(clearContent);
        }
        const Rect divider = Components::footerDivider();
        display.drawFastHLine(divider.x, divider.y, divider.width,
                              Palette::Divider);
        renderNavigationFooter();
        // As in 0.x MenuScreen::repaint, focus movement leaves chrome untouched.
    }
    display.endWrite();
    renderedUi = captureUiRenderSnapshot();
    const std::uint64_t finishedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    lastUiRenderWasIncremental = incremental;
    lastUiRenderUs = finishedUs >= startedUs ? finishedUs - startedUs : 0;
}

bool startNrf24Spectrum() {
    nrf24SpectrumController.reset();
    spectrumViewport.reset(Nrf24SpectrumController::kChannelCount);
    nrf24SpectrumReport = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const Nrf24PassiveSpectrumPlan plan =
        leshy1::drivers::radio::defaultNrf24PassiveSpectrumPlan();
    const bool hardwareReady = boardNrf24Spectrum.begin(
        owned, plan, &nrf24SpectrumReport);
    const bool started = hardwareReady && nrf24SpectrumController.start(
        nrf24SpectrumReport.detectedModules, startedUs);
    if (!started) {
        boardNrf24Spectrum.end();
        nrf24SpectrumController.fail();
    }
    rfSpectrumKind = RfSpectrumKind::Nrf24;
    rfSpectrumView = RfSpectrumView::Live;
    nextSpectrumUiRefreshUs = startedUs;
    resetSpectrumWaterfallTiming();
    armSpectrumWaterfallForCurrentReceiver();
    nrf24SpectrumChunkMaxUs = 0;
    lastRuntimeEvent = started ? "nrf24_spectrum_running"
                               : "nrf24_spectrum_start_failed";
    return true;
}

bool stopNrf24Spectrum(bool returnToSourceMenu) {
    const bool cleanup = boardNrf24Spectrum.end();
    if (nrf24SpectrumController.state() != Nrf24SpectrumViewState::Idle) {
        nrf24SpectrumController.stop();
    }
    rfSpectrumView = returnToSourceMenu ? RfSpectrumView::SourceMenu
                                        : RfSpectrumView::None;
    nextSpectrumUiRefreshUs = 0;
    lastRuntimeEvent = cleanup ? "nrf24_spectrum_stopped"
                               : "nrf24_spectrum_cleanup_failed";
    return true;
}

void serviceNrf24Spectrum() {
    if (rfSpectrumView != RfSpectrumView::Live ||
        rfSpectrumKind != RfSpectrumKind::Nrf24 ||
        nrf24SpectrumController.state() !=
            Nrf24SpectrumViewState::Running) {
        return;
    }
    Nrf24PassiveSweep sweep;
    const bool valid = boardNrf24Spectrum.sampleChunk(&sweep) &&
                       nrf24SpectrumController.ingest(sweep);
    if (!valid) {
        boardNrf24Spectrum.end();
        nrf24SpectrumController.fail();
        lastRuntimeEvent = "nrf24_spectrum_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    const std::uint64_t chunkUs = sweep.endedUs - sweep.startedUs;
    if (chunkUs > nrf24SpectrumChunkMaxUs) {
        nrf24SpectrumChunkMaxUs = chunkUs;
    }
    const std::uint64_t refreshUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (!uiController.isRoot() && uiController.page() == 2 &&
        spectrumViewport.mode() == SpectrumDisplayMode::Spectrum &&
        refreshUs >= nextSpectrumUiRefreshUs) {
        display.startWrite();
        renderSpectrumBars();
        display.endWrite();
        nextSpectrumUiRefreshUs = refreshUs + 100000ULL;
    }
}

bool startCc1101Spectrum(
    leshy1::drivers::radio::Cc1101SpectrumBand band) {
    cc1101SpectrumController.reset();
    spectrumViewport.reset(Cc1101SpectrumController::kBinCount);
    cc1101SpectrumReport = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const bool hardwareReady = boardCc1101Spectrum.begin(
        owned, &cc1101SpectrumReport);
    const bool started = hardwareReady &&
        cc1101SpectrumController.start(band, startedUs);
    if (!started) {
        boardCc1101Spectrum.end();
        cc1101SpectrumController.fail();
    }
    rfSpectrumKind = RfSpectrumKind::Cc1101;
    rfSpectrumView = RfSpectrumView::Live;
    nextSpectrumUiRefreshUs = startedUs;
    resetSpectrumWaterfallTiming();
    armSpectrumWaterfallForCurrentReceiver();
    lastRuntimeEvent = started ? "cc1101_spectrum_running"
                               : "cc1101_spectrum_start_failed";
    return true;
}

bool stopCc1101Spectrum(bool returnToSourceMenu) {
    const bool cleanup = boardCc1101Spectrum.end();
    if (cc1101SpectrumController.state() !=
        Cc1101SpectrumViewState::Idle) {
        cc1101SpectrumController.stop();
    }
    rfSpectrumView = returnToSourceMenu ? RfSpectrumView::CcBandMenu
                                        : RfSpectrumView::None;
    nextSpectrumUiRefreshUs = 0;
    lastRuntimeEvent = cleanup ? "cc1101_spectrum_stopped"
                               : "cc1101_spectrum_cleanup_failed";
    return true;
}

bool stopCurrentSpectrum(bool returnToSourceMenu) {
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? stopCc1101Spectrum(returnToSourceMenu)
        : stopNrf24Spectrum(returnToSourceMenu);
}

void serviceCc1101Spectrum() {
    if (rfSpectrumView != RfSpectrumView::Live ||
        rfSpectrumKind != RfSpectrumKind::Cc1101 ||
        cc1101SpectrumController.state() !=
            Cc1101SpectrumViewState::Running) {
        return;
    }
    Cc1101PassiveSample sample;
    const bool valid = boardCc1101Spectrum.sample(
        cc1101SpectrumController.plan(),
        cc1101SpectrumController.nextBin(), &sample) &&
        cc1101SpectrumController.ingest(sample);
    if (!valid) {
        boardCc1101Spectrum.end();
        cc1101SpectrumController.fail();
        lastRuntimeEvent = "cc1101_spectrum_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    const std::uint64_t refreshUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (cc1101SpectrumController.nextBin() == 0 &&
        !uiController.isRoot() && uiController.page() == 2 &&
        spectrumViewport.mode() == SpectrumDisplayMode::Spectrum &&
        refreshUs >= nextSpectrumUiRefreshUs) {
        display.startWrite();
        renderSpectrumBars();
        display.endWrite();
        nextSpectrumUiRefreshUs = refreshUs + 100000ULL;
    }
}

bool startSubGhzRawCapture(
    leshy1::drivers::radio::Cc1101SpectrumBand band) {
    subGhzRawCapture.reset();
    subGhzCapturePersistState = CapturePersistState::Result;
    subGhzCapturePersistStatus = "volatile";
    subGhzCapturePersistGeneration = 0;
    cc1101SpectrumReport = {};
    SubGhzRawCapturePlan plan;
    plan.frequencyKHz = subGhzCaptureFrequencyKHz(band);
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const bool hardwareReady = boardCc1101Spectrum.begin(
        owned, &cc1101SpectrumReport) &&
        boardCc1101Spectrum.lockReceive(plan.frequencyKHz);
    const bool started = hardwareReady &&
        subGhzRawCapture.begin(plan, startedUs);
    if (!started) {
        boardCc1101Spectrum.end();
        if (subGhzRawCapture.stats().state ==
            SubGhzRawCaptureState::Waiting) {
            subGhzRawCapture.fail(-1, startedUs);
        }
    }
    rfCcBandSelection = band;
    rfSpectrumKind = RfSpectrumKind::Cc1101;
    rfSpectrumView = RfSpectrumView::SubGhzCaptureLive;
    nextSubGhzCaptureUiRefreshUs = startedUs;
    lastRuntimeEvent = started ? "subghz_raw_waiting"
                               : "subghz_raw_start_failed";
    return true;
}

bool stopSubGhzRawCapture(bool returnToModes) {
    const std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const auto state = subGhzRawCapture.stats().state;
    if (state == SubGhzRawCaptureState::Waiting ||
        state == SubGhzRawCaptureState::Capturing) {
        subGhzRawCapture.cancel(nowUs == 0U ? 1U : nowUs);
    }
    const bool cleanup = boardCc1101Spectrum.end();
    nextSubGhzCaptureUiRefreshUs = 0;
    rfSpectrumView = returnToModes ? RfSpectrumView::SubGhzMenu
                                   : RfSpectrumView::None;
    lastRuntimeEvent = cleanup ? "subghz_raw_stopped"
                               : "subghz_raw_cleanup_failed";
    return true;
}

void serviceSubGhzRawCapture() {
    if (rfSpectrumView != RfSpectrumView::SubGhzCaptureLive) return;
    const auto state = subGhzRawCapture.stats().state;
    if (state != SubGhzRawCaptureState::Waiting &&
        state != SubGhzRawCaptureState::Capturing) {
        return;
    }
    std::int16_t rssiDbm = 0;
    std::uint64_t sampleUs = 0;
    if (!boardCc1101Spectrum.sampleRssi(&rssiDbm, &sampleUs)) {
        const std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        subGhzRawCapture.fail(-2, nowUs == 0U ? 1U : nowUs);
        boardCc1101Spectrum.end();
        lastRuntimeEvent = "subghz_raw_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    subGhzRawCapture.ingest({sampleUs, rssiDbm});
    subGhzRawCapture.service(sampleUs);
    const auto after = subGhzRawCapture.stats().state;
    const bool terminal = after != SubGhzRawCaptureState::Waiting &&
        after != SubGhzRawCaptureState::Capturing;
    if (terminal) {
        const bool cleanup = boardCc1101Spectrum.end();
        lastRuntimeEvent = !cleanup
            ? "subghz_raw_cleanup_failed"
            : after == SubGhzRawCaptureState::Complete
                  ? "subghz_raw_complete"
                  : after == SubGhzRawCaptureState::TimedOut
                        ? "subghz_raw_no_signal"
                        : after == SubGhzRawCaptureState::SignalTooLong
                              ? "subghz_raw_signal_too_long"
                              : "subghz_raw_terminal";
    }
    // Display transfers are deliberately suspended once the first edge starts
    // the capture.  A full TFT refresh is long enough to create false pulse
    // widths; measurement integrity takes precedence until the terminal gap.
    if (terminal ||
        (after == SubGhzRawCaptureState::Waiting &&
         sampleUs >= nextSubGhzCaptureUiRefreshUs)) {
        nextSubGhzCaptureUiRefreshUs = sampleUs + 200000ULL;
        renderInteractiveScreen(true);
    }
}

bool activeSpectrumRunning() {
    if (rfSpectrumView != RfSpectrumView::Live) return false;
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? cc1101SpectrumController.state() ==
              Cc1101SpectrumViewState::Running
        : nrf24SpectrumController.state() ==
              Nrf24SpectrumViewState::Running;
}

bool activeReceiveSampling() {
    const auto rawState = subGhzRawCapture.stats().state;
    return activeSpectrumRunning() ||
        (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive &&
         (rawState == SubGhzRawCaptureState::Waiting ||
          rawState == SubGhzRawCaptureState::Capturing));
}

std::uint32_t activeSpectrumSweeps() {
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? cc1101SpectrumController.sweeps()
        : nrf24SpectrumController.sweeps();
}

