anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void finishFullGuidedActiveChecks(bool success) {
    const bool nrfCleanup = boardNrf24Spectrum.end();
    const bool ccCleanup = boardCc1101Spectrum.end();
    releaseFullGuidedRfResource();
    fullGuidedRfState.cleanupComplete = nrfCleanup && ccCleanup &&
        fullGuidedRfState.resourceReleased;
    restoreFullGuidedLibraryView();
    const bool storageReleased =
        resourceBroker.ownerOf(Resource::Storage) ==
            leshy1::kernel::runtime::kNoOwner &&
        resourceBroker.ownerOf(Resource::RadioSpi) ==
            leshy1::kernel::runtime::kNoOwner;
    fullGuidedArtifactState.cleanupComplete =
        productBootRecovery.cleanupComplete && storageReleased &&
        libraryController.view() == LibraryView::SessionList &&
        fullGuidedArtifactState.blockedWriteAttempts == 0 &&
        fullGuidedArtifactState.disposableCleanupPassed &&
        fullGuidedArtifactState.productVerifyPassed;
    const bool passed = success && fullGuidedRfState.cleanupComplete &&
        fullGuidedArtifactState.cleanupComplete;
    fullGuidedArtifactState.step = passed
        ? FullGuidedArtifactStep::Complete : FullGuidedArtifactStep::Failed;
    const std::uint64_t finishedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    selfTestController.completeActiveChecks(snapshotSelfTestFacts(), finishedUs);
    lastRuntimeEvent = passed ? "self_test_active_artifact_complete"
                              : "self_test_active_checks_failed";
    renderInteractiveScreen(true);
}

void startFullGuidedArtifactChecks() {
    fullGuidedArtifactState = {};
    fullGuidedArtifactState.cleanupComplete = false;
    fullGuidedArtifactState.generationBefore =
        productBootRecovery.catalog.generation;
    fullGuidedArtifactState.observationsBefore =
        productBootRecovery.catalog.observations;
    std::snprintf(fullGuidedArtifactState.expectedFingerprint,
                  sizeof(fullGuidedArtifactState.expectedFingerprint), "%s",
                  productBootRecovery.expectedFingerprint);
    std::snprintf(fullGuidedArtifactState.disposableScratchPath,
                  sizeof(fullGuidedArtifactState.disposableScratchPath),
                  "%s%s", leshy1::storage::kScratchRoot,
                  kFullGuidedDisposableRunId);
    if (!productBootRecovery.enrolled ||
        !exactCidFingerprint(fullGuidedArtifactState.expectedFingerprint)) {
        fullGuidedArtifactState.recoveryComplete = true;
        finishFullGuidedActiveChecks(false);
        return;
    }
    fullGuidedArtifactState.step = FullGuidedArtifactStep::Recover;
    fullGuidedArtifactStartAfterUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) + 500000ULL;
    lastRuntimeEvent = "self_test_active_storage_recover";
    renderInteractiveScreen(true);
}

void finishFullGuidedRfChecks(bool success) {
    const bool nrfCleanup = boardNrf24Spectrum.end();
    const bool ccCleanup = boardCc1101Spectrum.end();
    releaseFullGuidedRfResource();
    fullGuidedRfState.cleanupComplete = nrfCleanup && ccCleanup &&
        fullGuidedRfState.resourceReleased;
    fullGuidedRfState.step = success && fullGuidedRfState.cleanupComplete
        ? FullGuidedRfStep::Complete : FullGuidedRfStep::Failed;
    if (!success || !fullGuidedRfState.cleanupComplete) {
        finishFullGuidedActiveChecks(false);
        return;
    }
    startFullGuidedArtifactChecks();
}

void startFullGuidedRfChecks() {
    fullGuidedRfState = {};
    fullGuidedRfState.resourceReleased = false;
    fullGuidedRfState.cleanupComplete = false;
    fullGuidedNrf24Report = {};
    fullGuidedCc1101Report = {};
    const auto radioSpi =
        leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    fullGuidedRfState.resourceAcquired =
        resourceBroker.acquire(AppRuntime::kForegroundOwner, radioSpi);
    if (!fullGuidedRfState.resourceAcquired) {
        fullGuidedRfState.nrf24Complete = true;
        finishFullGuidedRfChecks(false);
        return;
    }
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    if (!boardNrf24Spectrum.begin(
            owned,
            leshy1::drivers::radio::defaultNrf24PassiveSpectrumPlan(),
            &fullGuidedNrf24Report)) {
        fullGuidedRfState.nrf24Complete = true;
        finishFullGuidedRfChecks(false);
        return;
    }
    fullGuidedRfState.step = FullGuidedRfStep::Nrf24Sweep;
    lastRuntimeEvent = "self_test_active_nrf24";
}

bool cancelFullGuidedRfChecks() {
    const bool nrfCleanup = boardNrf24Spectrum.end();
    const bool ccCleanup = boardCc1101Spectrum.end();
    releaseFullGuidedRfResource();
    fullGuidedRfState.cleanupComplete = nrfCleanup && ccCleanup &&
        fullGuidedRfState.resourceReleased;
    bool disposableCleanup = true;
    if (fullGuidedArtifactState.scratchCreated &&
        !fullGuidedArtifactState.scratchRemoved) {
        disposableCleanup = runFullGuidedDisposableCleanup();
    }
    if (fullGuidedArtifactState.recoveryComplete) {
        char expectedFingerprint[33] = {};
        std::snprintf(expectedFingerprint, sizeof(expectedFingerprint), "%s",
                      fullGuidedArtifactState.expectedFingerprint);
        recoverProductCatalogForFingerprint(expectedFingerprint, true);
    }
    fullGuidedRfState.step = FullGuidedRfStep::Cancelled;
    fullGuidedArtifactState.step = FullGuidedArtifactStep::Cancelled;
    restoreFullGuidedLibraryView();
    fullGuidedArtifactState.cleanupComplete =
        productBootRecovery.cleanupComplete &&
        resourceBroker.ownerOf(Resource::Storage) ==
            leshy1::kernel::runtime::kNoOwner &&
        fullGuidedRfState.resourceReleased &&
        libraryController.view() == LibraryView::SessionList &&
        disposableCleanup;
    fullGuidedRfStartAfterUs = 0;
    fullGuidedArtifactStartAfterUs = 0;
    lastRuntimeEvent = fullGuidedRfState.cleanupComplete &&
                               fullGuidedArtifactState.cleanupComplete
        ? "self_test_active_cancelled"
        : "self_test_active_cancel_failed";
    return fullGuidedRfState.cleanupComplete &&
        fullGuidedArtifactState.cleanupComplete;
}

void serviceFullGuidedArtifactChecks() {
    if (fullGuidedRfState.step != FullGuidedRfStep::Complete) return;
    if (fullGuidedArtifactState.step == FullGuidedArtifactStep::Recover) {
        const std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs < fullGuidedArtifactStartAfterUs) return;
        fullGuidedArtifactStartAfterUs = 0;
        char expectedFingerprint[33] = {};
        std::snprintf(expectedFingerprint, sizeof(expectedFingerprint), "%s",
                      fullGuidedArtifactState.expectedFingerprint);
        recoverProductCatalogForFingerprint(expectedFingerprint, true);
        fullGuidedArtifactState.recoveryComplete = true;
        fullGuidedArtifactState.generationAfter =
            productBootRecovery.catalog.generation;
        fullGuidedArtifactState.observationsAfter =
            productBootRecovery.catalog.observations;
        fullGuidedArtifactState.blockedWriteAttempts =
            productBootRecovery.blockedWriteAttempts;
        fullGuidedArtifactState.recoveryPassed =
            std::strcmp(productBootRecovery.status, "admitted") == 0 &&
            productBootRecovery.catalogAdmitted &&
            productBootRecovery.readOnlyGuaranteed &&
            productBootRecovery.cleanupComplete &&
            productBootRecovery.ownedAfter == 0 &&
            productBootRecovery.blockedWriteAttempts == 0 &&
            fullGuidedArtifactState.generationAfter ==
                fullGuidedArtifactState.generationBefore &&
            fullGuidedArtifactState.observationsAfter ==
                fullGuidedArtifactState.observationsBefore;
        if (!fullGuidedArtifactState.recoveryPassed) {
            finishFullGuidedActiveChecks(false);
            return;
        }
        const LibraryEntry* entry = libraryController.selected();
        if (entry == nullptr || entry->session == nullptr ||
            !entry->persistent ||
            entry->generation != fullGuidedArtifactState.generationAfter ||
            !libraryController.openSelected() ||
            !libraryController.requestExport()) {
            fullGuidedArtifactState.libraryComplete = true;
            finishFullGuidedActiveChecks(false);
            return;
        }
        fullGuidedArtifactState.step = FullGuidedArtifactStep::LibraryJson;
        lastRuntimeEvent = "self_test_active_library_json";
        renderInteractiveScreen(true);
        return;
    }
    if (fullGuidedArtifactState.step == FullGuidedArtifactStep::LibraryJson) {
        const auto json = libraryController.formatSelectedJsonExport(
            diagnosticJson, sizeof(diagnosticJson));
        const bool jsonValid = json.valid() && json.bytes != 0 &&
            std::strstr(diagnosticJson, "\"status\":\"valid\"") != nullptr;
        fullGuidedArtifactState.jsonBytes = json.bytes;
        const auto metadata = libraryController.formatSelectedCaptureMetadata(
            diagnosticJson, sizeof(diagnosticJson));
        const bool metadataValid = metadata.valid() && metadata.bytes != 0 &&
            std::strstr(diagnosticJson, "\"immutable\":true") != nullptr;
        fullGuidedArtifactState.metadataBytes = metadata.bytes;
        if (!jsonValid || !metadataValid) {
            fullGuidedArtifactState.libraryComplete = true;
            finishFullGuidedActiveChecks(false);
            return;
        }
        fullGuidedArtifactState.step = FullGuidedArtifactStep::LibraryCsv;
        lastRuntimeEvent = "self_test_active_library_csv";
        renderInteractiveScreen(true);
        return;
    }
    if (fullGuidedArtifactState.step == FullGuidedArtifactStep::LibraryCsv) {
        char row[256] = {};
        if (fullGuidedArtifactState.csvBytes == 0) {
            const auto header = libraryController.formatSelectedCsvHeader(
                row, sizeof(row));
            if (!header.valid() || header.bytes == 0) {
                fullGuidedArtifactState.libraryComplete = true;
                finishFullGuidedActiveChecks(false);
                return;
            }
            fullGuidedArtifactState.csvBytes = header.bytes;
        }
        const LibraryEntry* entry = libraryController.selected();
        if (entry == nullptr || entry->session == nullptr) {
            fullGuidedArtifactState.libraryComplete = true;
            finishFullGuidedActiveChecks(false);
            return;
        }
        if (fullGuidedArtifactState.csvIndex < entry->session->size()) {
            const auto record = libraryController.formatSelectedCsvRow(
                fullGuidedArtifactState.csvIndex, row, sizeof(row));
            if (!record.valid() || record.bytes == 0) {
                fullGuidedArtifactState.libraryComplete = true;
                finishFullGuidedActiveChecks(false);
                return;
            }
            fullGuidedArtifactState.csvBytes += record.bytes;
            ++fullGuidedArtifactState.csvRecords;
            ++fullGuidedArtifactState.csvIndex;
            return;
        }
        fullGuidedArtifactState.libraryComplete = true;
        fullGuidedArtifactState.libraryPassed =
            fullGuidedArtifactState.csvRecords == entry->session->size();
        if (!fullGuidedArtifactState.libraryPassed) {
            finishFullGuidedActiveChecks(false);
            return;
        }
        fullGuidedArtifactState.step = FullGuidedArtifactStep::CapturePcap;
        lastRuntimeEvent = "self_test_active_capture_pcap";
        renderInteractiveScreen(true);
        return;
    }
    if (fullGuidedArtifactState.step == FullGuidedArtifactStep::CapturePcap) {
        fullGuidedArtifactState.captureComplete = true;
        const LibraryEntry* entry = libraryController.selected();
        if (entry == nullptr || entry->session == nullptr) {
            finishFullGuidedActiveChecks(false);
            return;
        }
        const auto& capture = entry->session->captureMetadata();
        fullGuidedArtifactState.captureApplicable =
            capture.present && capture.framePayloadCaptured;
        if (!fullGuidedArtifactState.captureApplicable) {
            fullGuidedArtifactState.workflowPassed = true;
            fullGuidedArtifactState.step =
                FullGuidedArtifactStep::DisposableCommit;
            lastRuntimeEvent = "self_test_disposable_commit";
            renderInteractiveScreen(true);
            return;
        }
        leshy1::storage::PersistedWifiFrameCaptureView persisted;
        const auto opened = leshy1::storage::openPersistedWifiFrameCapture(
            *entry->session, sessionStoreWorkspace.segment.data(),
            sessionStoreWorkspace.segmentSize, &persisted);
        const auto& source = static_cast<
            const leshy1::domain::captures::WifiFrameSource&>(persisted);
        const std::size_t expectedBytes = opened ==
                leshy1::storage::SessionCodecStatus::Valid
            ? leshy1::apps::capture::radiotapPcapSize(source) : 0;
        FullGuidedPcapSink sink;
        const PcapExportResult pcap = opened ==
                leshy1::storage::SessionCodecStatus::Valid
            ? leshy1::apps::capture::writeRadiotapPcap(
                  source, writeFullGuidedPcapBytes, &sink)
            : PcapExportResult{};
        fullGuidedArtifactState.pcapBytes = sink.bytes;
        fullGuidedArtifactState.pcapFrames = pcap.framesWritten;
        fullGuidedArtifactState.pcapFnv1a = sink.fnv1a;
        fullGuidedArtifactState.capturePassed = pcap.valid &&
            persisted.frameCount() != 0 &&
            pcap.framesWritten == persisted.frameCount() &&
            pcap.framesWritten == capture.framePayloadRecords &&
            pcap.bytesWritten == expectedBytes && sink.bytes == expectedBytes;
        fullGuidedArtifactState.workflowPassed =
            fullGuidedArtifactState.capturePassed;
        fullGuidedArtifactState.step =
            fullGuidedArtifactState.capturePassed
                ? FullGuidedArtifactStep::DisposableCommit
                : FullGuidedArtifactStep::DisposableCleanup;
        lastRuntimeEvent = fullGuidedArtifactState.capturePassed
            ? "self_test_disposable_commit"
            : "self_test_capture_pcap_failed";
        renderInteractiveScreen(true);
        return;
    }
    if (fullGuidedArtifactState.step ==
        FullGuidedArtifactStep::DisposableCommit) {
        runFullGuidedDisposableCommit();
        return;
    }
    if (fullGuidedArtifactState.step ==
        FullGuidedArtifactStep::DisposableRemountExport) {
        runFullGuidedDisposableRemountExport();
        return;
    }
    if (fullGuidedArtifactState.step ==
        FullGuidedArtifactStep::DisposableCleanup) {
        runFullGuidedDisposableCleanup();
        return;
    }
    if (fullGuidedArtifactState.step ==
        FullGuidedArtifactStep::ProductVerify) {
        runFullGuidedProductVerify();
        return;
    }
}

void serviceFullGuidedRfChecks() {
    if (selfTestController.view() != SelfTestView::ActiveChecks) return;
    if (fullGuidedRfState.step == FullGuidedRfStep::Complete) {
        serviceFullGuidedArtifactChecks();
        return;
    }
    if (fullGuidedRfState.step == FullGuidedRfStep::Idle) {
        const std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs < fullGuidedRfStartAfterUs) return;
        startFullGuidedRfChecks();
        return;
    }
    if (fullGuidedRfState.step == FullGuidedRfStep::Nrf24Sweep) {
        Nrf24PassiveSweep sweep;
        const bool swept = boardNrf24Spectrum.sweep(&sweep);
        const bool cleanup = boardNrf24Spectrum.end();
        fullGuidedRfState.nrf24Complete = true;
        fullGuidedRfState.nrf24Passed = swept && sweep.valid && cleanup &&
            fullGuidedNrf24Report.sweeps == 1 &&
            fullGuidedNrf24Report.cleanupComplete;
        if (!fullGuidedRfState.nrf24Passed) {
            finishFullGuidedRfChecks(false);
            return;
        }
        const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
            AppRuntime::kForegroundOwner;
        if (!boardCc1101Spectrum.begin(owned, &fullGuidedCc1101Report)) {
            fullGuidedRfState.cc1101Complete = true;
            finishFullGuidedRfChecks(false);
            return;
        }
        fullGuidedRfState.step = FullGuidedRfStep::Cc1101Sweep;
        lastRuntimeEvent = "self_test_active_cc1101";
        renderInteractiveScreen(true);
        return;
    }
    if (fullGuidedRfState.step == FullGuidedRfStep::Cc1101Sweep) {
        const Cc1101PassiveSpectrumPlan plan =
            leshy1::drivers::radio::cc1101PassiveSpectrumPlan(
                leshy1::drivers::radio::Cc1101SpectrumBand::Band433);
        Cc1101PassiveSample sample;
        const bool sampled = boardCc1101Spectrum.sample(
            plan, fullGuidedRfState.cc1101Bins, &sample);
        if (!sampled || !sample.valid) {
            fullGuidedRfState.cc1101Complete = true;
            finishFullGuidedRfChecks(false);
            return;
        }
        ++fullGuidedRfState.cc1101Bins;
        if (fullGuidedRfState.cc1101Bins <
            Cc1101PassiveSpectrumPlan::kBinCount) {
            return;
        }
        const bool cleanup = boardCc1101Spectrum.end();
        fullGuidedRfState.cc1101Complete = true;
        fullGuidedRfState.cc1101Passed = cleanup &&
            fullGuidedCc1101Report.samples ==
                Cc1101PassiveSpectrumPlan::kBinCount &&
            fullGuidedCc1101Report.cleanupComplete;
        finishFullGuidedRfChecks(fullGuidedRfState.cc1101Passed);
    }
}

void releaseWifiFrameCaptureRfLease() {
    resourceBroker.release(
        AppRuntime::kForegroundOwner,
        leshy1::kernel::runtime::resourceMask(Resource::EspRf));
}

