anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool startWifiFrameCapture() {
    wifiFrameCapture.reset();
    capturePersistState = CapturePersistState::Result;
    capturePersistStatus = "volatile";
    capturePersistGeneration = 0;
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool started =
        wifiFrameCapture.begin(kProductWifiFrameCapturePlan, startedUs);
    nextCaptureUiRefreshUs = startedUs + 500000ULL;
    lastRuntimeEvent = started ? "capture_running" : "capture_start_failed";
    if (!started) releaseWifiFrameCaptureRfLease();
    return true;
}

bool stopWifiFrameCapture() {
    std::uint64_t endedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (endedUs == 0U) endedUs = 1U;
    const bool cleanup = wifiFrameCapture.stop(endedUs);
    releaseWifiFrameCaptureRfLease();
    const auto state = wifiFrameCapture.stats().state;
    lastRuntimeEvent =
        state == WifiFrameCaptureState::Complete && cleanup
            ? "capture_complete"
            : "capture_failed";
    return true;
}

void serviceWifiFrameCapture() {
    const auto before = wifiFrameCapture.stats();
    if (before.state != WifiFrameCaptureState::Running) return;
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    wifiFrameCapture.service(nowUs);
    const auto after = wifiFrameCapture.stats();
    const bool terminal = after.state != WifiFrameCaptureState::Running;
    if (terminal) {
        releaseWifiFrameCaptureRfLease();
        lastRuntimeEvent = after.state == WifiFrameCaptureState::Complete &&
                                   wifiFrameCapture.cleanupComplete()
                               ? "capture_complete"
                               : "capture_failed";
    }
    if (uiController.page() == 4 &&
        (terminal || nowUs >= nextCaptureUiRefreshUs)) {
        nextCaptureUiRefreshUs = nowUs + 500000ULL;
        renderInteractiveScreen(true);
    }
}

void emitUiState(Stream& reply, UiAction action, bool changed) {
    auto& line = diagnosticJson;
    line[0] = '\0';
    const AppMenuItem* selected = appCatalog.get(uiController.selection());
    const LibraryEntry* selectedLibrary = libraryController.selected();
    std::snprintf(line, sizeof(line),
                  "{\"schema\":\"leshy.ui.v1\",\"kind\":\"state\","
                  "\"action\":\"%s\",\"changed\":%s,\"page\":\"%s\","
                  "\"parent_page\":\"%s\",\"device_selection\":%u,"
                  "\"selection\":%u,\"selected_id\":\"%s\","
                  "\"selected_enabled\":%s,\"reason\":\"%s\","
                  "\"language\":\"%s\",\"language_selection\":%u,"
                  "\"revision\":%lu,\"safety_state\":\"%s\","
                  "\"safety_reason\":\"%s\",\"safety_latched\":%s,"
                  "\"safety_clear_pending\":%s,\"render_mode\":\"%s\","
                  "\"render_us\":%llu}",
                  leshy1::ui::uiActionName(action), changed ? "true" : "false",
                  safetySupervisor.latched()
                      ? "safe_mode"
                      : leshy1::ui::probePageName(uiController.page()),
                  leshy1::ui::probePageName(uiController.parentPage()),
                  static_cast<unsigned>(deviceSelection),
                  static_cast<unsigned>(uiController.selection()),
                  selected == nullptr ? "none" : selected->id,
                  selected != nullptr && selected->enabled ? "true" : "false",
                  selected == nullptr ? "missing selection" : selected->reason,
                  leshy1::ui::uiLanguageName(languageController.active()),
                  static_cast<unsigned>(languageController.selection()),
                  static_cast<unsigned long>(uiController.revision()),
                  leshy1::kernel::safety::safetyStateName(
                      safetySupervisor.state()),
                  leshy1::kernel::safety::safetyReasonName(
                      safetySupervisor.reason()),
                  safetySupervisor.latched() ? "true" : "false",
                  safetySupervisor.clearPending() ? "true" : "false",
                  lastUiRenderWasIncremental ? "incremental" : "full",
                  static_cast<unsigned long long>(lastUiRenderUs));
    const std::size_t length = std::strlen(line);
    if (length > 0 && length + 3500 < sizeof(line)) {
        const SurveyPipelineProgress pipelineProgress = surveyPipeline.progress();
        const auto* wifiTimeline =
            productSurveyTimeline.source(RadioKind::Wifi);
        const auto* bleTimeline =
            productSurveyTimeline.source(RadioKind::Ble);
        const auto* storedTimeline =
            selectedLibrary != nullptr && selectedLibrary->session != nullptr
                ? &selectedLibrary->session->timeline() : nullptr;
        std::uint64_t timelineAsOfUs =
            productSurveyTimeline.state() == SourceTimelineState::Running
                ? static_cast<std::uint64_t>(esp_timer_get_time())
                : productSurveyTimeline.endedUs();
        if (timelineAsOfUs == 0) timelineAsOfUs = 1;
        const SelfTestReport& selfTestReport = selfTestController.report();
        const SelfTestMode visibleSelfTestMode =
            selfTestController.view() == SelfTestView::Result
                ? selfTestReport.mode
                : selfTestController.selectedMode();
        line[length - 1] = '\0';
        std::snprintf(line + length - 1, sizeof(line) - length + 1,
                      ",\"runtime_event\":\"%s\",\"runtime_owner\":\"%s\","
                      "\"lease_mask\":%lu,\"survey_simulated\":%s,"
                      "\"survey_view\":\"%s\",\"survey_workflow_state\":\"%s\","
                      "\"survey_workflow_status\":\"%s\",\"survey_running\":%s,"
                      "\"survey_observations\":%u,\"survey_selection\":%u,"
                      "\"survey_generation\":%lu,\"survey_persistent\":%s,"
                      "\"survey_pipeline_status\":\"%s\","
                      "\"survey_received\":%llu,\"survey_forwarded\":%llu,"
                      "\"survey_dropped\":%llu,\"survey_queue_depth\":%u,"
                      "\"survey_queue_high_water\":%u,"
                      "\"survey_batch_trigger\":\"%s\","
                      "\"survey_setup_view\":\"%s\","
                      "\"survey_setup_selection\":%u,"
                      "\"survey_source_selected_mask\":%u,"
                      "\"survey_source_selected_count\":%u,"
                      "\"survey_source_can_start\":%s,"
                      "\"survey_source_wifi_state\":\"%s\","
                      "\"survey_source_ble_state\":\"%s\","
                      "\"survey_timeline_state\":\"%s\","
                      "\"survey_timeline_status\":\"%s\","
                      "\"survey_timeline_archive_status\":\"%s\","
                      "\"survey_timeline_healthy\":%s,"
                      "\"survey_timeline_failure_status\":\"%s\","
                      "\"survey_timeline_failure_stage\":\"%s\","
                      "\"survey_timeline_failure_event_us\":%llu,"
                      "\"survey_timeline_failure_latest_us\":%llu,"
                      "\"survey_timeline_archived_windows\":%lu,"
                      "\"survey_timeline_persisted\":%s,"
                      "\"survey_timeline_persisted_windows\":%lu,"
                      "\"survey_timeline_retained_windows\":%u,"
                      "\"survey_timeline_evicted_windows\":%lu,"
                      "\"survey_timeline_selected_mask\":%u,"
                      "\"survey_timeline_queue_depth\":%u,"
                      "\"survey_timeline_queue_high_water\":%u,"
                      "\"survey_timeline_overflow\":%llu,"
                      "\"survey_timeline_wifi_state\":\"%s\","
                      "\"survey_timeline_wifi_duty_permille\":%u,"
                      "\"survey_timeline_wifi_accepted\":%llu,"
                      "\"survey_timeline_wifi_dropped\":%llu,"
                      "\"survey_timeline_ble_state\":\"%s\","
                      "\"survey_timeline_ble_duty_permille\":%u,"
                      "\"survey_timeline_ble_accepted\":%llu,"
                      "\"survey_timeline_ble_dropped\":%llu,"
                      "\"survey_product_selected_source_mask\":%u,"
                      "\"survey_product_active_source_mask\":%u,"
                      "\"survey_product_unavailable_source_mask\":%u,"
                      "\"survey_product_selected\":%s,"
                      "\"survey_product_status\":\"%s\","
                      "\"survey_product_backend_open\":%s,"
                      "\"survey_product_storage_mounted\":%s,"
                      "\"survey_product_store_status\":\"%s\","
                      "\"survey_product_admission_status\":\"%s\","
                      "\"survey_product_expected_cid\":\"%s\","
                      "\"survey_product_observed_cid\":\"%s\","
                      "\"survey_product_identity_status\":\"%s\","
                      "\"survey_product_identity_attempts\":%u,"
                      "\"survey_product_identity_transient_retries\":%u,"
                      "\"survey_product_capacity_bytes\":%llu,"
                      "\"survey_product_cached_free_bytes\":%llu,"
                      "\"survey_scan_status\":\"%s\","
                      "\"survey_scan_reported\":%u,"
                      "\"survey_scan_read\":%u,"
                      "\"survey_scan_accepted\":%u,"
                      "\"survey_scan_rejected\":%u,"
                      "\"survey_scan_dropped\":%u,"
                      "\"survey_ble_scan_status\":\"%s\","
                      "\"survey_ble_scan_reported\":%u,"
                      "\"survey_ble_scan_read\":%u,"
                      "\"survey_ble_scan_accepted\":%u,"
                      "\"survey_ble_scan_rejected\":%u,"
                      "\"survey_ble_scan_dropped\":%u,"
                      "\"survey_product_cleanup_complete\":%s,"
                      "\"survey_product_worker_ready\":%s,"
                      "\"survey_product_source_active\":%s,"
                      "\"survey_product_source_start_attempted\":%s,"
                      "\"survey_product_source_failure_injected\":%s,"
                      "\"survey_product_source_injection_armed\":%s,"
                      "\"survey_product_runtime_source_failure_injected\":%s,"
                      "\"survey_product_runtime_source_failure_injected_mask\":%u,"
                      "\"survey_product_runtime_source_injection_armed_mask\":%u,"
                      "\"survey_product_store_open_attempted\":%s,"
                      "\"survey_product_store_bytes_written\":%llu,"
                      "\"survey_product_scan_active\":%s,"
                      "\"survey_product_cancel_requested_during_scan\":%s,"
                      "\"survey_product_scan_cycles\":%lu,"
                      "\"survey_product_wifi_scan_cycles\":%lu,"
                      "\"survey_product_ble_scan_cycles\":%lu,"
                      "\"survey_product_start_action_us\":%llu,"
                      "\"survey_product_stop_action_us\":%llu,"
                      "\"library_simulated\":%s,\"library_view\":\"%s\","
                      "\"library_entries\":%u,\"library_generation\":%lu,"
                      "\"library_persistent\":%s,"
                      "\"self_test_view\":\"%s\","
                      "\"self_test_visual_state\":\"%s\","
                      "\"self_test_mode\":\"%s\","
                      "\"self_test_status\":\"%s\","
                      "\"self_test_checks\":%u,\"self_test_passed\":%u,"
                      "\"self_test_failed\":%u,\"self_test_blocked\":%u,"
                      "\"self_test_not_applicable\":%u,"
                      "\"self_test_read_only\":%s,"
                      "\"self_test_active_step\":\"%s\","
                      "\"self_test_active_cc_bins\":%u,"
                      "\"self_test_artifact_step\":\"%s\","
                      "\"self_test_artifact_recovery_complete\":%s,"
                      "\"self_test_artifact_library_complete\":%s,"
                      "\"self_test_artifact_capture_complete\":%s,"
                      "\"self_test_artifact_pcap_frames\":%u}",
                      lastRuntimeEvent, appRuntime.activeApp(),
                      static_cast<unsigned long>(appRuntime.activeResources()),
                      surveyWorkflow.simulated() ? "true" : "false",
                      leshy1::apps::survey::surveyViewName(
                          surveyController.view()),
                      leshy1::apps::survey::surveyWorkflowStateName(
                          surveyWorkflow.state()),
                      leshy1::apps::survey::surveyWorkflowStatusName(
                          surveyWorkflow.lastStatus()),
                      surveySession.state() == SessionState::Running ? "true" : "false",
                      static_cast<unsigned>(surveySession.size()),
                      static_cast<unsigned>(surveyController.selection()),
                      static_cast<unsigned long>(surveyWorkflow.generation()),
                      surveyWorkflow.persistent() ? "true" : "false",
                      leshy1::apps::survey::surveyPipelineStatusName(
                          surveyPipeline.lastStatus()),
                      static_cast<unsigned long long>(pipelineProgress.received),
                      static_cast<unsigned long long>(pipelineProgress.forwarded),
                      static_cast<unsigned long long>(pipelineProgress.dropped),
                      static_cast<unsigned>(pipelineProgress.queueDepth),
                      static_cast<unsigned>(pipelineProgress.queueHighWater),
                      leshy1::services::survey::sessionBatchTriggerName(
                          pipelineProgress.trigger),
                      leshy1::apps::survey::surveySetupViewName(
                          surveySourceController.view()),
                      static_cast<unsigned>(
                          surveySourceController.selection()),
                      static_cast<unsigned>(
                          surveySourceController.selectedMask()),
                      static_cast<unsigned>(
                          surveySourceController.selectedCount()),
                      surveySourceController.canStart() ? "true" : "false",
                      leshy1::apps::survey::surveySourceStateName(
                          surveySourceController.find(SurveySourceKind::Wifi) ==
                                  nullptr
                              ? SurveySourceState::Unavailable
                              : surveySourceController.find(
                                    SurveySourceKind::Wifi)->state),
                      leshy1::apps::survey::surveySourceStateName(
                          surveySourceController.find(SurveySourceKind::Ble) ==
                                  nullptr
                              ? SurveySourceState::Unavailable
                              : surveySourceController.find(
                                    SurveySourceKind::Ble)->state),
                      leshy1::services::survey::sourceTimelineStateName(
                          productSurveyTimeline.state()),
                      productSurveyRuntime.timelineStatus,
                      productSurveyRuntime.timelineArchiveStatus,
                      productSurveyRuntime.timelineHealthy ? "true" : "false",
                      productSurveyRuntime.timelineFailureStatus,
                      productSurveyRuntime.timelineFailureStage,
                      static_cast<unsigned long long>(
                          productSurveyRuntime.timelineFailureEventUs),
                      static_cast<unsigned long long>(
                          productSurveyRuntime.timelineFailureLatestUs),
                      static_cast<unsigned long>(
                          productSurveyRuntime.timelineArchivedWindows),
                      storedTimeline != nullptr && storedTimeline->present &&
                              storedTimeline->finalized
                          ? "true" : "false",
                      static_cast<unsigned long>(
                          storedTimeline == nullptr
                              ? 0 : storedTimeline->totalWindows),
                      static_cast<unsigned>(
                          selectedLibrary == nullptr ||
                                  selectedLibrary->session == nullptr
                              ? 0
                              : selectedLibrary->session->timelineWindowCount()),
                      static_cast<unsigned long>(
                          storedTimeline == nullptr
                              ? 0 : storedTimeline->evictedWindows),
                      static_cast<unsigned>(
                          productSurveyTimeline.selectedMask()),
                      static_cast<unsigned>(
                          productSurveyTimeline.queuedWindows()),
                      static_cast<unsigned>(
                          productSurveyTimeline.windowHighWater()),
                      static_cast<unsigned long long>(
                          productSurveyTimeline.overflowEvents()),
                      leshy1::services::survey::sourceWindowStateName(
                          wifiTimeline == nullptr
                              ? SourceWindowState::Unselected
                              : wifiTimeline->state),
                      static_cast<unsigned>(
                          productSurveyTimeline.dutyPermille(
                              RadioKind::Wifi, timelineAsOfUs)),
                      static_cast<unsigned long long>(
                          wifiTimeline == nullptr ? 0 : wifiTimeline->accepted),
                      static_cast<unsigned long long>(
                          wifiTimeline == nullptr ? 0 : wifiTimeline->dropped),
                      leshy1::services::survey::sourceWindowStateName(
                          bleTimeline == nullptr
                              ? SourceWindowState::Unselected
                              : bleTimeline->state),
                      static_cast<unsigned>(
                          productSurveyTimeline.dutyPermille(
                              RadioKind::Ble, timelineAsOfUs)),
                      static_cast<unsigned long long>(
                          bleTimeline == nullptr ? 0 : bleTimeline->accepted),
                      static_cast<unsigned long long>(
                          bleTimeline == nullptr ? 0 : bleTimeline->dropped),
                      static_cast<unsigned>(
                          productSurveyRuntime.selectedSourceMask),
                      static_cast<unsigned>(
                          productSurveyRuntime.activeSourceMask),
                      static_cast<unsigned>(
                          productSurveyRuntime.unavailableSourceMask),
                      productSurveyRuntime.selected ? "true" : "false",
                      productSurveyRuntime.status,
                      productSurveyRuntime.backendOpen ? "true" : "false",
                      productSurveyFilesystem.mounted() ? "true" : "false",
                      leshy1::storage::productStoreAccessStatusName(
                          productSurveyRuntime.storeStatus),
                      leshy1::apps::survey::productSurveyAdmissionStatusName(
                          productSurveyRuntime.admissionStatus),
                      productSurveyRuntime.expectedFingerprint,
                      productSurveyRuntime.observedFingerprint,
                      leshy1::storage::sdTransportRunStatusName(
                          productSurveyRuntime.identityStatus),
                      static_cast<unsigned>(
                          productSurveyRuntime.identityAttempts),
                      static_cast<unsigned>(
                          productSurveyRuntime.identityTransientRetries),
                      static_cast<unsigned long long>(
                          productSurveyRuntime.cardCapacityBytes),
                      static_cast<unsigned long long>(
                          productSurveyRuntime.cachedFreeBytes),
                      leshy1::platform::arduino::boardWifiScanStatusName(
                          productSurveyRuntime.scan.status),
                      static_cast<unsigned>(
                          productSurveyRuntime.scan.recordsReported),
                      static_cast<unsigned>(
                          productSurveyRuntime.scan.recordsRead),
                      static_cast<unsigned>(productSurveyRuntime.scan.accepted),
                      static_cast<unsigned>(productSurveyRuntime.scan.rejected),
                      static_cast<unsigned>(productSurveyRuntime.scan.dropped),
                      leshy1::platform::arduino::boardBleScanStatusName(
                          productSurveyRuntime.bleScan.status),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.recordsReported),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.recordsRead),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.accepted),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.rejected),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.dropped),
                      productSurveyRuntime.cleanupComplete ? "true" : "false",
                      productSurveyRuntime.workerReady ? "true" : "false",
                      productSurveyRuntime.sourceActive ? "true" : "false",
                      productSurveyRuntime.sourceStartAttempted ? "true" : "false",
                      productSurveyRuntime.sourceFailureInjected ? "true" : "false",
                      productSurveySourceUnavailableInjectionArmed()
                          ? "true" : "false",
                      productSurveyRuntime.runtimeSourceFailureInjected
                          ? "true" : "false",
                      static_cast<unsigned>(
                          productSurveyRuntime.runtimeSourceFailureInjectedMask),
                      static_cast<unsigned>(
                          productSurveyRuntimeUnavailableInjectionMask()),
                      productSurveyRuntime.storeOpenAttempted ? "true" : "false",
                      static_cast<unsigned long long>(
                          productSurveyRuntime.storeBytesWritten),
                      productSurveyScanActive() ? "true" : "false",
                      productSurveyRuntime.cancelRequestedDuringScan
                          ? "true" : "false",
                      static_cast<unsigned long>(
                          productSurveyRuntime.scanCycles),
                      static_cast<unsigned long>(
                          productSurveyRuntime.wifiScanCycles),
                      static_cast<unsigned long>(
                          productSurveyRuntime.bleScanCycles),
                      static_cast<unsigned long long>(
                          productSurveyRuntime.startActionUs),
                      static_cast<unsigned long long>(
                          productSurveyRuntime.stopActionUs),
                      selectedLibrary != nullptr && selectedLibrary->simulated
                          ? "true" : "false",
                      libraryController.view() == LibraryView::ExportReady
                          ? "export_ready"
                          : (libraryController.view() == LibraryView::SessionDetail
                                 ? "detail"
                                 : "list"),
                      static_cast<unsigned>(libraryController.size()),
