anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
                      static_cast<unsigned long>(selectedLibrary == nullptr
                                                     ? 0
                                                     : selectedLibrary->generation),
                      selectedLibrary != nullptr && selectedLibrary->persistent
                          ? "true" : "false",
                      leshy1::apps::self_test::selfTestViewName(
                          selfTestController.view()),
                      selfTestController.view() == SelfTestView::VisualCheck
                          ? leshy1::apps::self_test::selfTestVisualStateName(
                                selfTestController.visualState())
                          : "none",
                      leshy1::apps::self_test::selfTestModeName(
                          visibleSelfTestMode),
                      leshy1::apps::self_test::selfTestResultStatusName(
                          selfTestReport.status),
                      static_cast<unsigned>(selfTestReport.checkCount),
                      static_cast<unsigned>(selfTestReport.passed),
                      static_cast<unsigned>(selfTestReport.failed),
                      static_cast<unsigned>(selfTestReport.blocked),
                      static_cast<unsigned>(selfTestReport.notApplicable),
                      selfTestReport.readOnly ? "true" : "false",
                      fullGuidedRfStepName(fullGuidedRfState.step),
                      static_cast<unsigned>(fullGuidedRfState.cc1101Bins),
                      fullGuidedArtifactStepName(
                          fullGuidedArtifactState.step),
                      fullGuidedArtifactState.recoveryComplete
                          ? "true" : "false",
                      fullGuidedArtifactState.libraryComplete
                          ? "true" : "false",
                      fullGuidedArtifactState.captureComplete
                          ? "true" : "false",
                      static_cast<unsigned>(
                          fullGuidedArtifactState.pcapFrames));
    }
    reply.println(line);
}

void emitWifiFrameCaptureState(Stream& reply) {
    const auto stats = wifiFrameCapture.stats();
    const auto& plan = wifiFrameCapture.capture().plan();
    const std::size_t pcapBytes =
        leshy1::apps::capture::radiotapPcapSize(wifiFrameCapture.capture());
    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.wifi_frame.v1\",\"kind\":\"state\","
        "\"state\":\"%s\",\"passive_only\":true,\"rx_only\":true,"
        "\"application_connect_calls\":0,\"application_raw_tx_calls\":0,"
        "\"physical_no_tx_verified\":false,\"storage_written\":%s,"
        "\"volatile_ram\":true,\"immutable_after_stop\":true,"
        "\"persist_state\":\"%s\",\"persist_status\":\"%s\","
        "\"persist_generation\":%lu,"
        "\"channel_plan\":%u,\"current_channel\":%u,"
        "\"duration_ms\":%lu,\"channel_dwell_ms\":%u,"
        "\"snap_length\":%u,\"maximum_frames\":%u,"
        "\"started_us\":%llu,\"ended_us\":%llu,"
        "\"frames_reported\":%lu,\"frames_accepted\":%lu,"
        "\"frames_dropped_capacity\":%lu,"
        "\"frames_dropped_invalid\":%lu,\"payload_bytes\":%lu,"
        "\"driver_error\":%ld,\"pcap_available\":%s,"
        "\"pcap_bytes\":%u,\"pcap_linktype\":127,"
        "\"pcap_timebase\":\"monotonic_us\","
        "\"cleanup_complete\":%s,\"lease_mask\":%lu}",
        leshy1::apps::capture::wifiFrameCaptureStateName(stats.state),
        capturePersistState == CapturePersistState::Saved ? "true" : "false",
        capturePersistStateName(capturePersistState), capturePersistStatus,
        static_cast<unsigned long>(capturePersistGeneration),
        static_cast<unsigned>(plan.channel),
        static_cast<unsigned>(wifiFrameCapture.currentChannel()),
        static_cast<unsigned long>(plan.durationMs),
        static_cast<unsigned>(plan.channelDwellMs),
        static_cast<unsigned>(plan.snapLength),
        static_cast<unsigned>(plan.maximumFrames),
        static_cast<unsigned long long>(stats.startedUs),
        static_cast<unsigned long long>(stats.endedUs),
        static_cast<unsigned long>(stats.framesReported),
        static_cast<unsigned long>(stats.framesAccepted),
        static_cast<unsigned long>(stats.framesDroppedCapacity),
        static_cast<unsigned long>(stats.framesDroppedInvalid),
        static_cast<unsigned long>(stats.payloadBytes),
        static_cast<long>(stats.driverError),
        pcapBytes == 0U ? "false" : "true",
        static_cast<unsigned>(pcapBytes),
        wifiFrameCapture.cleanupComplete() ? "true" : "false",
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

struct StreamPcapSink final {
    Stream* stream = nullptr;
};

bool writePcapBytes(const std::uint8_t* data, std::size_t size,
                    void* context) {
    auto* sink = static_cast<StreamPcapSink*>(context);
    return sink != nullptr && sink->stream != nullptr &&
           sink->stream->write(data, size) == size;
}

void emitWifiFrameCapturePcap(Stream& reply) {
    const auto stats = wifiFrameCapture.stats();
    const std::size_t expected =
        leshy1::apps::capture::radiotapPcapSize(wifiFrameCapture.capture());
    if (stats.state != WifiFrameCaptureState::Complete || expected == 0U) {
        reply.println(
            "{\"schema\":\"leshy.capture.pcap.v1\",\"kind\":\"error\","
            "\"reason\":\"capture_not_complete\"}");
        return;
    }
    char line[320] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.pcap.v1\",\"kind\":\"pcap_begin\","
        "\"bytes\":%u,\"frames\":%u,\"linktype\":127,"
        "\"timebase\":\"monotonic_us\",\"streaming\":true,"
        "\"payload_retained_by_firmware\":true,"
        "\"storage_written\":false}",
        static_cast<unsigned>(expected),
        static_cast<unsigned>(wifiFrameCapture.capture().size()));
    reply.println(line);
    reply.flush();
    StreamPcapSink sink{&reply};
    const PcapExportResult result =
        leshy1::apps::capture::writeRadiotapPcap(
            wifiFrameCapture.capture(), writePcapBytes, &sink);
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.pcap.v1\",\"kind\":\"pcap_end\","
        "\"status\":\"%s\",\"bytes\":%u,\"frames\":%u,"
        "\"storage_written\":false}",
        result.valid ? "valid" : "stream_failed",
        static_cast<unsigned>(result.bytesWritten),
        static_cast<unsigned>(result.framesWritten));
    reply.println(line);
    reply.flush();
}

void emitSubGhzRawCaptureState(Stream& reply) {
    const auto& stats = subGhzRawCapture.stats();
    const auto& plan = subGhzRawCapture.plan();
    const bool noTransmit = cc1101SpectrumReport.txStrobes == 0U &&
        cc1101SpectrumReport.paTableWrites == 0U &&
        cc1101SpectrumReport.fifoWrites == 0U;
    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.subghz_raw.v1\",\"kind\":\"state\","
        "\"state\":\"%s\",\"passive_only\":true,\"rx_only\":true,"
        "\"modulation\":\"ook_envelope\",\"frequency_khz\":%lu,"
        "\"threshold_dbm\":%d,\"wait_timeout_ms\":%lu,"
        "\"maximum_capture_ms\":%lu,"
        "\"debounce_us\":%u,\"end_gap_us\":%u,"
        "\"maximum_pulses\":%u,\"started_us\":%llu,"
        "\"signal_started_us\":%llu,\"ended_us\":%llu,"
        "\"samples\":%lu,\"invalid_samples\":%lu,"
        "\"short_transitions_rejected\":%lu,\"pulses\":%u,"
        "\"start_level\":%s,\"truncated\":%s,"
        "\"driver_error\":%ld,\"csv_available\":%s,"
        "\"application_tx_calls\":0,\"tx_strobes\":%lu,"
        "\"pa_table_writes\":%lu,\"fifo_writes\":%lu,"
        "\"physical_no_tx_verified\":%s,\"cleanup_complete\":%s,"
        "\"storage_written\":%s,\"persist_state\":\"%s\","
        "\"persist_status\":\"%s\",\"persist_generation\":%lu,"
        "\"lease_mask\":%lu}",
        leshy1::apps::capture::subGhzRawCaptureStateName(stats.state),
        static_cast<unsigned long>(plan.frequencyKHz),
        static_cast<int>(plan.thresholdDbm),
        static_cast<unsigned long>(plan.waitTimeoutMs),
        static_cast<unsigned long>(plan.maximumCaptureMs),
        static_cast<unsigned>(plan.debounceUs),
        static_cast<unsigned>(plan.endGapUs),
        static_cast<unsigned>(plan.maximumPulses),
        static_cast<unsigned long long>(stats.startedUs),
        static_cast<unsigned long long>(stats.signalStartedUs),
        static_cast<unsigned long long>(stats.endedUs),
        static_cast<unsigned long>(stats.samples),
        static_cast<unsigned long>(stats.invalidSamples),
        static_cast<unsigned long>(stats.shortTransitionsRejected),
        static_cast<unsigned>(subGhzRawCapture.pulseCount()),
        stats.startLevel ? "true" : "false",
        stats.truncated ? "true" : "false",
        static_cast<long>(stats.driverError),
        stats.state == SubGhzRawCaptureState::Complete ? "true" : "false",
        static_cast<unsigned long>(cc1101SpectrumReport.txStrobes),
        static_cast<unsigned long>(cc1101SpectrumReport.paTableWrites),
        static_cast<unsigned long>(cc1101SpectrumReport.fifoWrites),
        noTransmit && cc1101SpectrumReport.cleanupComplete
            ? "true" : "false",
        cc1101SpectrumReport.cleanupComplete ? "true" : "false",
        subGhzCapturePersistState == CapturePersistState::Saved
            ? "true" : "false",
        capturePersistStateName(subGhzCapturePersistState),
        subGhzCapturePersistStatus,
        static_cast<unsigned long>(subGhzCapturePersistGeneration),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitSubGhzRawCaptureCsv(Stream& reply) {
    const auto& stats = subGhzRawCapture.stats();
    if (stats.state != SubGhzRawCaptureState::Complete ||
        subGhzRawCapture.pulseCount() == 0U) {
        reply.println(
            "{\"schema\":\"leshy.capture.subghz_raw.csv.v1\","
            "\"kind\":\"error\",\"reason\":\"capture_not_complete\"}");
        return;
    }
    char line[160] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.subghz_raw.csv.v1\","
        "\"kind\":\"csv_begin\",\"pulses\":%u,"
        "\"frequency_khz\":%lu,\"modulation\":\"ook_envelope\","
        "\"streaming\":true}",
        static_cast<unsigned>(subGhzRawCapture.pulseCount()),
        static_cast<unsigned long>(subGhzRawCapture.plan().frequencyKHz));
    reply.println(line);
    reply.flush();

    std::size_t bytes = 0;
    const auto header = leshy1::apps::capture::formatSubGhzRawCsvHeader(
        line, sizeof(line));
    bool valid = header.valid &&
        reply.write(reinterpret_cast<const std::uint8_t*>(line),
                    header.bytes) == header.bytes;
    bytes += valid ? header.bytes : 0U;
    for (std::size_t index = 0;
         valid && index < subGhzRawCapture.pulseCount(); ++index) {
        const auto row = leshy1::apps::capture::formatSubGhzRawCsvRow(
            subGhzRawCapture, index, stats.startLevel, line, sizeof(line));
        valid = row.valid &&
            reply.write(reinterpret_cast<const std::uint8_t*>(line),
                        row.bytes) == row.bytes;
        bytes += valid ? row.bytes : 0U;
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.subghz_raw.csv.v1\","
        "\"kind\":\"csv_end\",\"status\":\"%s\",\"bytes\":%u,"
        "\"pulses\":%u}",
        valid ? "valid" : "stream_failed", static_cast<unsigned>(bytes),
        static_cast<unsigned>(subGhzRawCapture.pulseCount()));
    reply.println(line);
    reply.flush();
}

