anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitSurveyBrowser(Stream& reply) {
    const Observation* selected = surveyController.selected();
    const ObservationHistory history = surveyController.selectedHistory();
    char line[768] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.survey.browser.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"filter\":\"%s\",\"draft_filter\":\"%s\","
        "\"filter_focused\":%s,\"total\":%u,\"visible\":%u,"
        "\"selection\":%u,\"selected\":%s,\"selected_radio\":\"%s\","
        "\"history_valid\":%s,\"history_samples\":%u,"
        "\"history_retained\":%u,\"history_min_rssi_dbm\":%d,"
        "\"history_max_rssi_dbm\":%d,\"history_latest_rssi_dbm\":%d,"
        "\"read_only_query\":true,\"radio_touched\":false,"
        "\"storage_touched\":false}",
        leshy1::apps::survey::surveyViewName(surveyController.view()),
        leshy1::apps::survey::surveyFilterName(surveyController.filter()),
        leshy1::apps::survey::surveyFilterName(surveyController.draftFilter()),
        surveyController.filterFocused() ? "true" : "false",
        static_cast<unsigned>(surveySession.size()),
        static_cast<unsigned>(surveyController.visibleSize()),
        static_cast<unsigned>(surveyController.selection()),
        selected == nullptr ? "false" : "true",
        selected == nullptr ? "none"
                            : (selected->radio == RadioKind::Ble ? "ble" : "wifi"),
        history.valid ? "true" : "false",
        static_cast<unsigned>(history.sampleCount),
        static_cast<unsigned>(history.retainedSamples),
        static_cast<int>(history.minimumRssiDbm),
        static_cast<int>(history.maximumRssiDbm),
        static_cast<int>(history.latestRssiDbm));
    reply.println(line);
}

bool selectionCanRepaintInPlace(UiAction action) {
    if (action != UiAction::Up && action != UiAction::Down) return false;
    if (uiController.isRoot()) return true;
    if (uiController.page() == 2) {
        if (rfSpectrumView == RfSpectrumView::Live) return false;
        if (rfSpectrumView == RfSpectrumView::SourceMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzMenu ||
            rfSpectrumView == RfSpectrumView::CcBandMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) return true;
        return surveyWorkflow.state() == SurveyWorkflowState::Setup ||
               (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                (surveyController.view() == SurveyView::List ||
                 surveyController.view() == SurveyView::Filter));
    }
    if (uiController.page() == 3) {
        return libraryController.view() == LibraryView::SessionList;
    }
    if (uiController.page() == 5) return true;
    if (uiController.page() == kDevicePage) return true;
    return uiController.page() == 6 &&
           selfTestController.view() == SelfTestView::ModeMenu;
}

bool applyUiAction(UiAction action, bool render = true) {
    const bool incrementalCandidate = selectionCanRepaintInPlace(action);
    lastUiActionUsedIncrementalRender = false;
    const auto finish = [&](bool changed) {
        lastUiActionUsedIncrementalRender = changed && incrementalCandidate;
        if (changed && render) {
            renderInteractiveScreen(!lastUiActionUsedIncrementalRender);
        }
        return changed;
    };
    if (safetySupervisor.latched()) {
        bool changed = false;
        if (action == UiAction::Select || action == UiAction::Right) {
            if (safetySupervisor.clearPending()) {
                clearSafetyStopAndRestart();
            }
            changed = safetySupervisor.requestClear();
        } else if ((action == UiAction::Back || action == UiAction::Left) &&
                   safetySupervisor.clearPending()) {
            changed = safetySupervisor.cancelClear();
        }
        if (action != UiAction::Unknown) {
            uiController.recordHandledAction(action);
        }
        return finish(changed);
    }
    const AppMenuItem* selected = appCatalog.get(uiController.selection());
    const bool wasRoot = uiController.isRoot();
    if (!wasRoot && uiController.page() == 2) {
        bool handled = false;
        bool changed = false;
        if (rfSpectrumView == RfSpectrumView::SourceMenu) {
            handled = true;
            if (action == UiAction::Up && rfSpectrumSelection != 0) {
                rfSpectrumSelection = 0;
                changed = true;
            } else if (action == UiAction::Down && rfSpectrumSelection != 1) {
                rfSpectrumSelection = 1;
                changed = true;
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       rfSpectrumSelection == 0) {
                changed = startNrf24Spectrum();
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       rfSpectrumSelection == 1) {
                rfCcBandSelection =
                    leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
                rfSpectrumView = RfSpectrumView::CcBandMenu;
                lastRuntimeEvent = "cc1101_spectrum_band_menu";
                changed = true;
            } else if (action == UiAction::Back || action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::None;
                lastRuntimeEvent = "survey_spectrum_plan";
                changed = true;
            }
        } else if (rfSpectrumView == RfSpectrumView::SubGhzMenu) {
            handled = true;
            if (action == UiAction::Up && subGhzModeSelection != 0) {
                subGhzModeSelection = 0;
                changed = true;
            } else if (action == UiAction::Down &&
                       subGhzModeSelection != 1) {
                subGhzModeSelection = 1;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                rfCcBandSelection =
                    leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
                rfSpectrumView = subGhzModeSelection == 0
                    ? RfSpectrumView::CcBandMenu
                    : RfSpectrumView::SubGhzCaptureBandMenu;
                lastRuntimeEvent = subGhzModeSelection == 0
                    ? "cc1101_spectrum_band_menu"
                    : "subghz_raw_band_menu";
                changed = true;
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::None;
                changed = uiController.apply(
                    action, static_cast<std::uint8_t>(appCatalog.size()),
                    true, 2);
                if (changed) appRuntime.stop();
                lastRuntimeEvent = "subghz_home";
            }
        } else if (rfSpectrumView ==
                   RfSpectrumView::SubGhzCaptureBandMenu) {
            handled = true;
            std::uint8_t selection = ccBandSelectionIndex();
            if (action == UiAction::Up && selection != 0) {
                --selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Down && selection != 3) {
                ++selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = startSubGhzRawCapture(rfCcBandSelection);
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::SubGhzMenu;
                lastRuntimeEvent = "subghz_modes";
                changed = true;
            }
        } else if (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive) {
            handled = true;
            if (subGhzRawCapture.stats().state ==
                    SubGhzRawCaptureState::Complete &&
                subGhzCapturePersistState == CapturePersistState::Result &&
                (action == UiAction::Select || action == UiAction::Right)) {
                changed = requestSubGhzRawCapturePersist();
            } else if (subGhzCapturePersistState ==
                           CapturePersistState::Saving) {
                changed = false;
            } else if (action == UiAction::Back || action == UiAction::Left) {
                changed = stopSubGhzRawCapture(true);
                subGhzRawCapture.reset();
                subGhzCapturePersistState = CapturePersistState::Result;
                subGhzCapturePersistStatus = "volatile";
                subGhzCapturePersistGeneration = 0;
            }
        } else if (rfSpectrumView == RfSpectrumView::CcBandMenu) {
            handled = true;
            std::uint8_t selection = ccBandSelectionIndex();
            if (action == UiAction::Up && selection != 0) {
                --selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Down && selection != 3) {
                ++selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = startCc1101Spectrum(rfCcBandSelection);
            } else if (action == UiAction::Back || action == UiAction::Left) {
                const bool direct = std::strcmp(appRuntime.activeApp(),
                                                "subghz") == 0;
                if (direct) {
                    rfSpectrumView = RfSpectrumView::SubGhzMenu;
                    lastRuntimeEvent = "subghz_modes";
                    changed = true;
                } else {
                    rfSpectrumView = RfSpectrumView::SourceMenu;
                    lastRuntimeEvent = "spectrum_source_menu";
                    changed = true;
                }
            }
        } else if (rfSpectrumView == RfSpectrumView::Live) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                const bool directNrf =
                    rfSpectrumKind == RfSpectrumKind::Nrf24 &&
                    std::strcmp(appRuntime.activeApp(), "spectrum24") == 0;
                changed = stopCurrentSpectrum(!directNrf);
                if (changed && directNrf) {
                    changed = uiController.apply(
                        action, static_cast<std::uint8_t>(appCatalog.size()),
                        true, 2);
                    if (changed) appRuntime.stop();
                }
            } else if (action == UiAction::Up || action == UiAction::Down) {
                const bool fault = rfSpectrumKind == RfSpectrumKind::Cc1101
                    ? cc1101SpectrumController.state() ==
                          Cc1101SpectrumViewState::Fault
                    : nrf24SpectrumController.state() ==
                          Nrf24SpectrumViewState::Fault;
                changed = !fault &&
                    (action == UiAction::Up
                         ? spectrumViewport.previousMode()
                         : spectrumViewport.nextMode());
                if (changed) {
                    if (spectrumViewport.mode() ==
                        SpectrumDisplayMode::Waterfall) {
                        const std::size_t bins = activeSpectrumBins();
                        spectrumViewport.reset(bins);
                        spectrumViewport.setMode(
                            SpectrumDisplayMode::Waterfall);
                        resetSpectrumWaterfallTiming();
                        armSpectrumWaterfallForCurrentReceiver();
                    }
                    nextSpectrumUiRefreshUs = 0;
                    lastRuntimeEvent = spectrumViewport.mode() ==
                        SpectrumDisplayMode::Waterfall
                            ? "spectrum_waterfall_view"
                            : "spectrum_bar_view";
                }
            } else if (rfSpectrumKind == RfSpectrumKind::Cc1101) {
                if ((action == UiAction::Select ||
                     action == UiAction::Right) &&
                    cc1101SpectrumController.togglePause()) {
                    changed = true;
                    if (cc1101SpectrumController.state() ==
                        Cc1101SpectrumViewState::Paused) {
                        if (!boardCc1101Spectrum.idle()) {
                            boardCc1101Spectrum.end();
                            cc1101SpectrumController.fail();
                            lastRuntimeEvent =
                                "cc1101_spectrum_pause_failed";
                        } else {
                            lastRuntimeEvent = "cc1101_spectrum_paused";
                        }
                    } else {
                        lastRuntimeEvent = "cc1101_spectrum_running";
                    }
                }
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       nrf24SpectrumController.toggleMetric()) {
                const SpectrumDisplayMode displayMode =
                    spectrumViewport.mode();
                changed = spectrumViewport.reset(
                    Nrf24SpectrumController::kChannelCount);
                if (changed && displayMode ==
                        SpectrumDisplayMode::Waterfall) {
                    changed = spectrumViewport.nextMode();
                }
                resetSpectrumWaterfallTiming();
                armSpectrumWaterfallForCurrentReceiver();
                nextSpectrumUiRefreshUs = 0;
                lastRuntimeEvent = nrf24SpectrumController.metric() ==
                    Nrf24SpectrumMetric::Traffic
                        ? "nrf24_spectrum_traffic"
                        : "nrf24_spectrum_signal";
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
            productSurveySourceUnavailableVisible() &&
            (action == UiAction::Select || action == UiAction::Right ||
             action == UiAction::Up || action == UiAction::Down)) {
            handled = true;
            lastRuntimeEvent = "source_unavailable_waiting_back";
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   surveySourceController.view() ==
                       SurveySetupView::Sources) {
            if (action == UiAction::Up) {
                handled = true;
                changed = surveySourceController.previous();
            } else if (action == UiAction::Down) {
                handled = true;
                changed = surveySourceController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                const SurveySetupActivation activation =
                    surveySourceController.activate();
                changed = activation ==
                    SurveySetupActivation::SourceChanged;
                lastRuntimeEvent = leshy1::apps::survey::
                    surveySetupActivationName(activation);
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                handled = true;
                changed = surveySourceController.back();
                if (changed) lastRuntimeEvent = "survey_source_plan";
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Up || action == UiAction::Down)) {
            handled = true;
            changed = action == UiAction::Up
                ? surveySourceController.previous()
                : surveySourceController.next();
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Select ||
                    action == UiAction::Right)) {
            handled = true;
            const SurveySetupActivation activation =
                surveySourceController.activate();
            lastRuntimeEvent = leshy1::apps::survey::
                surveySetupActivationName(activation);
            if (activation == SurveySetupActivation::OpenedSources) {
                changed = true;
            } else if (activation ==
                       SurveySetupActivation::OpenedSpectrum) {
                const bool available = BoardProfile::kRfShieldDeclared &&
                    !BoardProfile::kGpsDeclared &&
                    !BoardProfile::kPn532Declared;
                if (available) {
                    rfSpectrumView = RfSpectrumView::SourceMenu;
                    rfSpectrumSelection = 0;
                    changed = true;
                }
            } else if (activation ==
                       SurveySetupActivation::StartRequested) {
                if (productSurveyRuntime.selected) {
                    if (productSurveyControl() ==
                        ProductSurveyWorkerControl::Idle) {
                        changed = startProductSurvey();
                    }
                } else {
                    std::uint64_t startedUs =
                        static_cast<std::uint64_t>(esp_timer_get_time());
                    if (startedUs == 0) startedUs = 1;
                    const SurveyPipelineStatus started = surveyPipeline.start(
                        "product-wifi-preview", startedUs);
                    changed = started == SurveyPipelineStatus::Started &&
                              publishGoldenObservations(surveyPipeline);
                    lastRuntimeEvent =
                        leshy1::apps::survey::surveyPipelineStatusName(
                            changed ? surveyPipeline.lastStatus() : started);
                }
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Back || action == UiAction::Left)) {
            if (productSurveyRuntime.selected &&
                productSurveyControl() != ProductSurveyWorkerControl::Idle) {
                handled = true;
                changed = requestProductSurveyWorkerStop(true);
            } else {
                surveyPipeline.cancel();
                if (productSurveyRuntime.selected) {
                    const bool cleanup = closeProductSurveyBackend();
                    productSurveyRuntime.status = cleanup ? "cancelled"
                                                           : "cleanup_failed";
                }
                lastRuntimeEvent =
                    leshy1::apps::survey::surveyPipelineStatusName(
                        surveyPipeline.lastStatus());
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::Filter) {
            handled = true;
            if (action == UiAction::Up) {
                changed = surveyController.previous();
            } else if (action == UiAction::Down) {
                changed = surveyController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = surveyController.activateFilter();
                if (changed) lastRuntimeEvent = "survey_filter_applied";
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = surveyController.back();
                if (changed) lastRuntimeEvent = "survey_filter_cancelled";
            } else {
                handled = false;
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::Detail) {
            if (action == UiAction::Back || action == UiAction::Left) {
                handled = true;
                changed = surveyController.back();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                if (productSurveyRuntime.selected) {
                    changed =
                        productSurveyControl() ==
                                ProductSurveyWorkerControl::Paused
                            ? commitPausedProductSurvey()
                            : requestProductSurveyWorkerStop(false);
                } else {
                    const SurveyPipelineStatus status =
                        surveyPipeline.stopAndCommit(
                            static_cast<std::uint64_t>(esp_timer_get_time()));
                    changed = status == SurveyPipelineStatus::Committed;
                    lastRuntimeEvent =
                        leshy1::apps::survey::surveyPipelineStatusName(status);
                }
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                   surveyController.view() == SurveyView::List) {
            if (action == UiAction::Up) {
                handled = true;
                changed = surveyController.previous();
                if (changed && surveyController.filterFocused() &&
                    productSurveyRuntime.selected &&
                    productSurveyControl() ==
                        ProductSurveyWorkerControl::Running) {
                    changed = requestProductSurveyWorkerPause() || changed;
                }
            } else if (action == UiAction::Down) {
                handled = true;
                changed = surveyController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                changed = surveyController.openSelected();
            } else if ((action == UiAction::Back || action == UiAction::Left) &&
                       surveyWorkflow.state() == SurveyWorkflowState::Running) {
                if (productSurveyRuntime.selected) {
                    handled = true;
                    if (productSurveyControl() ==
                        ProductSurveyWorkerControl::Paused) {
                        releaseProductSurveyAfterTerminal("cancelled", true);
                        changed = true;
                    } else {
                        changed = requestProductSurveyWorkerStop(true);
                    }
                } else {
                    surveyPipeline.cancel();
                    lastRuntimeEvent = "survey_cancelled";
                }
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 3) {
        bool handled = false;
        bool changed = false;
        if (libraryController.view() == LibraryView::ExportReady &&
            (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            changed = libraryController.back();
        } else if (libraryController.view() == LibraryView::SessionDetail &&
            (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            changed = libraryController.back();
        } else if (libraryController.view() == LibraryView::SessionDetail &&
                   (action == UiAction::Select ||
                    action == UiAction::Right)) {
            handled = true;
            changed = libraryController.requestExport();
        } else if (libraryController.view() == LibraryView::SessionList) {
            if (action == UiAction::Up) {
                handled = true;
                changed = libraryController.previous();
            } else if (action == UiAction::Down) {
                handled = true;
