anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
                changed = libraryController.next();
            } else if (action == UiAction::Select || action == UiAction::Right) {
                handled = true;
                changed = libraryController.openSelected();
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 4) {
        const auto state = wifiFrameCapture.stats().state;
        if (state == WifiFrameCaptureState::Idle &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(startWifiFrameCapture());
        }
        if (state == WifiFrameCaptureState::Running &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(stopWifiFrameCapture());
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Result &&
            (action == UiAction::Select || action == UiAction::Right)) {
            capturePersistState = CapturePersistState::Confirm;
            capturePersistStatus = "awaiting_confirmation";
            lastRuntimeEvent = "capture_store_confirm";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(requestWifiFrameCapturePersist());
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm &&
            (action == UiAction::Back || action == UiAction::Left)) {
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            lastRuntimeEvent = "capture_store_cancelled";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Saving) {
            uiController.recordHandledAction(action);
            return finish(false);
        }
        if (action == UiAction::Back || action == UiAction::Left) {
            if (state == WifiFrameCaptureState::Running) {
                stopWifiFrameCapture();
            }
            wifiFrameCapture.reset();
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            capturePersistGeneration = 0;
            nextCaptureUiRefreshUs = 0;
        }
    }
    if (!wasRoot && uiController.page() == kDevicePage) {
        bool handled = false;
        bool changed = false;
        if (action == UiAction::Up && deviceSelection > 0) {
            handled = true;
            --deviceSelection;
            changed = true;
        } else if (action == UiAction::Down &&
                   deviceSelection + 1U < kDeviceItemCount) {
            handled = true;
            ++deviceSelection;
            changed = true;
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            constexpr std::uint8_t pages[kDeviceItemCount] = {
                5, 6, 1, kAboutPage,
            };
            changed = uiController.openChild(pages[deviceSelection]);
            if (changed && deviceSelection == 0) languageController.enter();
            lastRuntimeEvent = changed ? "device_item_opened"
                                       : "device_item_rejected";
        }
        if (handled) {
            if (action == UiAction::Up || action == UiAction::Down) {
                uiController.recordHandledAction(action);
            }
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 5) {
        bool handled = false;
        bool changed = false;
        if (action == UiAction::Up) {
            handled = true;
            changed = languageController.previous();
        } else if (action == UiAction::Down) {
            handled = true;
            changed = languageController.next();
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            const UiLanguage requested = languageController.selected();
            const bool persisted = saveUiLanguage(requested);
            changed = persisted && languageController.apply();
            lastRuntimeEvent = persisted ? "language_persisted"
                                         : "language_persist_failed";
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 6) {
        bool handled = false;
        bool changed = false;
        if (selfTestController.view() == SelfTestView::ModeMenu &&
            action == UiAction::Up) {
            handled = true;
            changed = selfTestController.previousMode();
        } else if (selfTestController.view() == SelfTestView::ModeMenu &&
                   action == UiAction::Down) {
            handled = true;
            changed = selfTestController.nextMode();
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            const std::uint64_t startedUs =
                static_cast<std::uint64_t>(esp_timer_get_time());
            const bool completesFullPlan =
                selfTestController.view() == SelfTestView::VisualCheck &&
                selfTestController.visualState() + 1U >=
                    SelfTestController::kVisualStateCount;
            if (completesFullPlan) runShieldReceiverSelfTestProbe();
            changed = selfTestController.activate(snapshotSelfTestFacts(),
                                                   startedUs);
            if (changed &&
                selfTestController.view() == SelfTestView::ActiveChecks) {
                fullGuidedRfState = {};
                fullGuidedArtifactState = {};
                fullGuidedNrf24Report = {};
                fullGuidedCc1101Report = {};
                fullGuidedRfStartAfterUs = startedUs + 500000ULL;
                lastRuntimeEvent = "self_test_active_rf_pending";
            }
            if (selfTestController.runAwaitingFinish() &&
                selfTestController.view() == SelfTestView::Result) {
                selfTestController.finishRun(
                    static_cast<std::uint64_t>(esp_timer_get_time()));
                lastRuntimeEvent = leshy1::apps::self_test::
                    selfTestResultStatusName(selfTestController.report().status);
            } else if (selfTestController.view() == SelfTestView::VisualCheck) {
                lastRuntimeEvent = "self_test_visual_check";
            } else if (selfTestController.view() ==
                       SelfTestView::ActiveChecks) {
                lastRuntimeEvent = "self_test_active_rf_pending";
            } else if (changed) {
                lastRuntimeEvent = "self_test_preflight";
            }
        } else if (action == UiAction::Back || action == UiAction::Left) {
            bool cleanupReady = true;
            if (selfTestController.view() == SelfTestView::ActiveChecks) {
                cleanupReady = cancelFullGuidedRfChecks();
            }
            changed = cleanupReady && selfTestController.back();
            handled = changed;
            if (changed) {
                lastRuntimeEvent = "self_test_modes";
            } else if (!cleanupReady) {
                handled = true;
                lastRuntimeEvent = "self_test_cancel_cleanup_failed";
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    const bool wantsLaunch = wasRoot && (action == UiAction::Select || action == UiAction::Right);
    bool openable = selected != nullptr && selected->enabled;
    LaunchStatus launchStatus = LaunchStatus::InvalidDescriptor;
    if (wantsLaunch) {
        launchStatus = selected == nullptr
                           ? LaunchStatus::InvalidDescriptor
                           : appRuntime.launch(selected->id, selected->enabled, selected->resources);
        lastRuntimeEvent = leshy1::kernel::runtime::launchStatusName(launchStatus);
        openable = launchStatus == LaunchStatus::Started;
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "language") == 0) {
            languageController.enter();
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "device") == 0) {
            deviceSelection = 0;
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "capture") == 0) {
            wifiFrameCapture.reset();
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            capturePersistGeneration = 0;
            nextCaptureUiRefreshUs = 0;
        }
        const bool surveyApp = selected != nullptr &&
            (std::strcmp(selected->id, "wifi") == 0 ||
             std::strcmp(selected->id, "ble") == 0);
        const bool spectrumApp = selected != nullptr &&
            (std::strcmp(selected->id, "spectrum24") == 0 ||
             std::strcmp(selected->id, "subghz") == 0);
        if (openable && selected != nullptr && (surveyApp || spectrumApp)) {
            if (rfSpectrumView != RfSpectrumView::None ||
                boardNrf24Spectrum.active() ||
                boardCc1101Spectrum.active()) {
                stopCurrentSpectrum(false);
            } else {
                nrf24SpectrumController.reset();
                nrf24SpectrumReport = {};
                cc1101SpectrumController.reset();
                cc1101SpectrumReport = {};
            }
            rfSpectrumKind = RfSpectrumKind::Nrf24;
            rfSpectrumSelection = 0;
            subGhzModeSelection = 0;
            rfCcBandSelection =
                leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
            nextSpectrumUiRefreshUs = 0;
            if (surveyApp) {
                if (surveyWorkflow.state() != SurveyWorkflowState::Setup) {
                    surveyPipeline.resetToSetup();
                }
                closeProductSurveyBackend();
                productSurveyRuntime = {};
                productSurveyRuntime.selected = !selected->simulated;
                productSurveyRuntime.workerReady = productSurveyWorkerReady;
                surveySourceController.rebuild(
                    inventory, selected->simulated,
                    std::strcmp(selected->id, "wifi") == 0
                        ? SurveySourceScope::WifiOnly
                        : SurveySourceScope::BleOnly);
                const SurveyWorkflowStatus configured =
                    surveyWorkflow.configure(productSurveyRuntime.selected,
                                             selected->simulated);
                if (configured != SurveyWorkflowStatus::Ready) {
                    openable = false;
                    lastRuntimeEvent = "survey_config_rejected";
                }
            } else if (std::strcmp(selected->id, "spectrum24") == 0) {
                startNrf24Spectrum();
            } else {
                rfSpectrumKind = RfSpectrumKind::Cc1101;
                rfSpectrumView = RfSpectrumView::SubGhzMenu;
                subGhzRawCapture.reset();
                subGhzCapturePersistState = CapturePersistState::Result;
                subGhzCapturePersistStatus = "volatile";
                subGhzCapturePersistGeneration = 0;
                lastRuntimeEvent = "subghz_modes";
            }
        }
    }
    const bool changed = uiController.apply(
        action, static_cast<std::uint8_t>(appCatalog.size()), openable,
        selected == nullptr ? UiController::kRootPage : selected->page);
    if (wantsLaunch && launchStatus == LaunchStatus::Started && !changed) {
        appRuntime.stop();
        lastRuntimeEvent = "launch_rolled_back";
    } else if (!wasRoot && uiController.isRoot() && changed) {
        appRuntime.stop();
        lastRuntimeEvent = "stopped";
    }
    return finish(changed);
}

struct TouchDispatchTarget final {
    TouchTarget target{};
    std::uint8_t current = 0;
};

TouchDispatchTarget touchDispatchTarget(TouchPoint point) {
    if (uiController.isRoot()) {
        const std::uint8_t first = homeFirstVisible(uiController.selection());
        return {
            leshy1::ui::hitTouchTarget(
                TouchTargetLayout::HomeRows, point, first,
                static_cast<std::uint8_t>(appCatalog.size())),
            uiController.selection(),
        };
    }
    if (uiController.page() == 2) {
        if (rfSpectrumView == RfSpectrumView::SourceMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::TwoChoices, point),
                    rfSpectrumSelection};
        }
        if (rfSpectrumView == RfSpectrumView::SubGhzMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::TwoChoices, point),
                    subGhzModeSelection};
        }
        if (rfSpectrumView == RfSpectrumView::CcBandMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point, 0, 4),
                    ccBandSelectionIndex()};
        }
        if (rfSpectrumView == RfSpectrumView::None &&
            surveyWorkflow.state() == SurveyWorkflowState::Setup &&
            !productSurveySourceUnavailableVisible()) {
            const bool sources = surveySourceController.view() ==
                                 SurveySetupView::Sources;
            return {leshy1::ui::hitTouchTarget(
                        sources ? TouchTargetLayout::TwoChoices
                                : TouchTargetLayout::ThreeChoices,
                        point, 0,
                        sources
                            ? static_cast<std::uint8_t>(
                                  SurveySourceController::kSourceCount)
                            : surveySourceController.planItemCount()),
                    surveySourceController.selection()};
        }
        if (rfSpectrumView == RfSpectrumView::None &&
            surveyWorkflow.state() == SurveyWorkflowState::Running &&
            surveyController.view() == SurveyView::Filter) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::ThreeChoices, point),
                    static_cast<std::uint8_t>(surveyController.draftFilter())};
        }
    }
    if (uiController.page() == 5) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::TwoChoices, point),
                languageController.selection()};
    }
    if (uiController.page() == kDevicePage) {
        const std::uint8_t first = deviceFirstVisible(deviceSelection);
        return {
            leshy1::ui::hitTouchTarget(
                TouchTargetLayout::HomeRows, point, first, kDeviceItemCount),
            deviceSelection,
        };
    }
    if (uiController.page() == 6 &&
        selfTestController.view() == SelfTestView::ModeMenu) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::TwoChoices, point),
                selfTestController.selection()};
    }
    return {};
}

bool dispatchTouchPoint(TouchPoint point, bool synthetic = false) {
    lastTouchPoint = point;
    lastTouchChanged = false;
    if (synthetic) ++syntheticTouchPresses;
    const TouchDispatchTarget dispatch = touchDispatchTarget(point);
    if (!dispatch.target.hit) {
        ++touchMissedPresses;
        return false;
    }

    ++touchHandledPresses;
    std::uint8_t current = dispatch.current;
    bool changed = false;
    while (current > dispatch.target.index) {
        if (!applyUiAction(UiAction::Up, false)) break;
        --current;
        changed = true;
    }
    while (current < dispatch.target.index) {
        if (!applyUiAction(UiAction::Down, false)) break;
        ++current;
        changed = true;
    }
    if (current == dispatch.target.index) {
        changed = applyUiAction(UiAction::Select, false) || changed;
    }
    lastTouchChanged = changed;
    if (changed) renderInteractiveScreen(true);
    return changed;
}

