anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool inspectStoredGeneration(leshy1::storage::SessionStoreIo& io,
                             leshy1::storage::SessionStoreWorkspace& workspace,
                             const SurveySession& expected,
                             std::uint32_t generation,
                             StoredGenerationEvidence* evidence) {
    if (evidence == nullptr) return false;
    *evidence = {};
    if (leshy1::storage::encodeObservationSegment(
            expected, workspace.segment.data(), workspace.segment.size(),
            &evidence->expectedSegmentSize) !=
            leshy1::storage::SessionCodecStatus::Valid ||
        leshy1::storage::encodeSessionManifest(
            expected, workspace.segment.data(), evidence->expectedSegmentSize,
            workspace.manifest.data(), workspace.manifest.size(),
            &evidence->expectedManifestSize) !=
            leshy1::storage::SessionCodecStatus::Valid) {
        return false;
    }
    evidence->expectedSegmentCrc = leshy1::storage::crc32c(
        workspace.segment.data(), evidence->expectedSegmentSize);
    evidence->expectedManifestCrc = leshy1::storage::crc32c(
        workspace.manifest.data(), evidence->expectedManifestSize);

    char segmentPath[leshy1::storage::kSessionStorePathMax] = {};
    char manifestPath[leshy1::storage::kSessionStorePathMax] = {};
    if (!leshy1::storage::formatSessionStorePath(
            leshy1::storage::StoreFileKind::Segment, generation, segmentPath,
            sizeof(segmentPath)) ||
        !leshy1::storage::formatSessionStorePath(
            leshy1::storage::StoreFileKind::Manifest, generation, manifestPath,
            sizeof(manifestPath)) ||
        io.readFile(segmentPath, workspace.segment.data(), workspace.segment.size(),
                    &evidence->observedSegmentSize) !=
            leshy1::storage::SessionStoreIo::ReadStatus::Ok ||
        io.readFile(manifestPath, workspace.manifest.data(), workspace.manifest.size(),
                    &evidence->observedManifestSize) !=
            leshy1::storage::SessionStoreIo::ReadStatus::Ok) {
        return false;
    }
    evidence->observedSegmentCrc = leshy1::storage::crc32c(
        workspace.segment.data(), evidence->observedSegmentSize);
    evidence->observedManifestCrc = leshy1::storage::crc32c(
        workspace.manifest.data(), evidence->observedManifestSize);
    evidence->unchanged =
        evidence->expectedSegmentSize == evidence->observedSegmentSize &&
        evidence->expectedManifestSize == evidence->observedManifestSize &&
        evidence->expectedSegmentCrc == evidence->observedSegmentCrc &&
        evidence->expectedManifestCrc == evidence->observedManifestCrc;
    return evidence->unchanged;
}

void restartAtSessionStoreBoundary(void* rawContext,
                                   leshy1::storage::CommitStage boundary) {
    auto* context = static_cast<ResetBoundaryHookContext*>(rawContext);
    if (context != nullptr && context->reply != nullptr) {
        std::snprintf(
            sdPhysicalEvidence.line, sizeof(sdPhysicalEvidence.line),
            "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
            "\"kind\":\"reset_trigger\",\"status\":\"boundary_reached\","
            "\"run_id\":\"%s\",\"boundary\":%u,\"boundary_name\":\"%s\","
            "\"reset_injection\":true,\"physical_power_cut\":false}",
            context->runId != nullptr ? context->runId : "invalid",
            context->boundaryNumber,
            leshy1::storage::sessionStoreBoundaryName(boundary));
        context->reply->println(sdPhysicalEvidence.line);
        context->reply->flush();
    }
    Serial.flush();
    Serial0.flush();
    delay(10);
    esp_restart();
}

[[noreturn]] void waitForPowerCutAtSessionStoreBoundary(
    void* rawContext, leshy1::storage::CommitStage boundary) {
    auto* context = static_cast<ResetBoundaryHookContext*>(rawContext);
    if (context != nullptr && context->reply != nullptr) {
        std::snprintf(
            sdPhysicalEvidence.line, sizeof(sdPhysicalEvidence.line),
            "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
            "\"kind\":\"reset_trigger\",\"status\":\"boundary_reached\","
            "\"run_id\":\"%s\",\"boundary\":%u,\"boundary_name\":\"%s\","
            "\"reset_injection\":false,\"physical_power_cut\":true}",
            context->runId != nullptr ? context->runId : "invalid",
            context->boundaryNumber,
            leshy1::storage::sessionStoreBoundaryName(boundary));
        context->reply->println(sdPhysicalEvidence.line);
        context->reply->flush();
    }
    Serial.flush();
    Serial0.flush();
    while (true) {
        if (esp_task_wdt_status(nullptr) == ESP_OK) {
            esp_task_wdt_reset();
        }
        delay(50);
    }
}

void restartAtLittleFsSessionStoreBoundary(
    void* rawContext, leshy1::storage::CommitStage boundary) {
    auto* context = static_cast<ResetBoundaryHookContext*>(rawContext);
    if (context != nullptr && context->reply != nullptr) {
        std::snprintf(
            sdPhysicalEvidence.line, sizeof(sdPhysicalEvidence.line),
            "{\"schema\":\"leshy.storage.littlefs.reset.v1\","
            "\"kind\":\"reset_trigger\",\"status\":\"boundary_reached\","
            "\"run_id\":\"%s\",\"boundary\":%u,\"boundary_name\":\"%s\","
            "\"continuity_armed\":true,\"reset_injection\":true,"
            "\"physical_power_cut\":false}",
            context->runId != nullptr ? context->runId : "invalid",
            context->boundaryNumber,
            leshy1::storage::sessionStoreBoundaryName(boundary));
        context->reply->println(sdPhysicalEvidence.line);
        context->reply->flush();
    }
    Serial.flush();
    Serial0.flush();
    delay(10);
    esp_restart();
}

bool parseSdSessionStoreCommand(const char* command, const char* prefix,
                                char* fingerprint,
                                std::size_t fingerprintCapacity, char* runId,
                                std::size_t runIdCapacity) {
    if (command == nullptr || prefix == nullptr || fingerprint == nullptr ||
        runId == nullptr ||
        fingerprintCapacity < 33 || runIdCapacity < 33 ||
        std::strncmp(command, prefix, std::strlen(prefix)) != 0) {
        return false;
    }
    char extra = '\0';
    const int parsed = std::sscanf(
        command + std::strlen(prefix), "%32[0-9A-F] %32[A-Za-z0-9_-] %c",
        fingerprint, runId, &extra);
    return parsed == 2 && std::strlen(fingerprint) == 32 && runId[0] != '\0';
}

bool parseExactFingerprintCommand(const char* command, const char* prefix,
                                  char* fingerprint,
                                  std::size_t fingerprintCapacity) {
    if (command == nullptr || prefix == nullptr || fingerprint == nullptr ||
        fingerprintCapacity < 33 ||
        std::strncmp(command, prefix, std::strlen(prefix)) != 0) {
        return false;
    }
    char extra = '\0';
    const int parsed = std::sscanf(command + std::strlen(prefix),
                                   "%32[0-9A-F] %c", fingerprint, &extra);
    return parsed == 1 && std::strlen(fingerprint) == 32;
}

void emitPhysicalSdReadOnlyMount(Stream& reply,
                                 const char* expectedFingerprint) {
    auto& line = sdPhysicalEvidence.line;
    auto& cidHex = sdPhysicalEvidence.cidHex;
    cidHex[0] = '\0';
    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const bool resourcesAcquired = idleUi && resourceBroker.acquire(
        kSdIdentificationOwner, leshy1::storage::kSdIdentificationResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);

    BoardSdSpiTransport identityTransport;
    const bool identityAdapterBegun = resourcesAcquired && identityTransport.begin();
    leshy1::storage::SdTransportRunResult identity;
    if (identityAdapterBegun) {
        leshy1::storage::SdTransportRunPolicy policy;
        policy.allowPhysical = true;
        policy.explicitlySelected = true;
        policy.identificationOnly = true;
        policy.ownedResources = ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), identityTransport,
            policy);
        identityTransport.end();
    }
    const bool identityCleanup = identityTransport.cleanupComplete();
    for (std::size_t index = 0; index < identity.identity.cid.size(); ++index) {
        std::snprintf(cidHex + index * 2,
                      sizeof(sdPhysicalEvidence.cidHex) - index * 2, "%02X",
                      static_cast<unsigned>(identity.identity.cid[index]));
    }
    const bool fingerprintMatched =
        identity.status == leshy1::storage::SdTransportRunStatus::Valid &&
        std::strcmp(cidHex, expectedFingerprint) == 0;

    BoardSdFilesystem filesystem;
    const bool mountAttempted = fingerprintMatched;
    const bool mounted = fingerprintMatched && filesystem.beginReadOnly();
    const bool readOnlyGuaranteed = mounted && filesystem.readOnlyGuaranteed();
    const std::uint64_t cardCapacity =
        mounted ? filesystem.cardCapacityBytes() : 0;
    const std::uint64_t filesystemCapacity =
        mounted ? filesystem.filesystemCapacityBytes() : 0;
    const std::uint64_t freeBytes = mounted ? filesystem.freeBytes() : 0;
    const bool capacityMatched = mounted &&
        cardCapacity == identity.identity.capacityBytes &&
        filesystemCapacity != 0 && filesystemCapacity <= cardCapacity;
    const bool rootExists =
        mounted && filesystem.exists(leshy1::storage::kProductSessionStoreRoot);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = cidHex;
    media.capacityBytes = cardCapacity;
    media.freeBytes = freeBytes;
    leshy1::storage::ProductStoreRequest request;
    request.operation = leshy1::storage::ProductStoreOperation::RecoverCatalog;
    request.expectedFingerprint = expectedFingerprint;
    request.rootPath = leshy1::storage::kProductSessionStoreRoot;
    request.rootExists = rootExists;
    request.driverReadOnlyGuaranteed = readOnlyGuaranteed;
    request.driverWriteEnabled = false;
    request.ownedResources = ownedDuring;
    const leshy1::storage::ProductStorePermit permit =
        leshy1::storage::authorizeProductStore(media, request);
    const std::uint32_t blockedWritesBeforeEnd =
        filesystem.blockedWriteAttempts();
    filesystem.end();
    const bool mountCleanup = filesystem.cleanupComplete();
    const std::uint32_t blockedWrites = filesystem.blockedWriteAttempts();
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    const bool valid = idleUi && resourcesAcquired && identityAdapterBegun &&
        identity.status == leshy1::storage::SdTransportRunStatus::Valid &&
        identityCleanup && fingerprintMatched && mounted &&
        readOnlyGuaranteed && capacityMatched && blockedWritesBeforeEnd == 0 &&
        blockedWrites == 0 && mountCleanup && ownedAfter == 0;

    std::snprintf(
        line, sizeof(sdPhysicalEvidence.line),
        "{\"schema\":\"leshy.storage.sd.readonly_mount.v1\","
        "\"kind\":\"result\",\"status\":\"%s\","
        "\"expected_fingerprint\":\"%s\",\"cid_hex\":\"%s\","
        "\"fingerprint_matched\":%s,\"mount_attempted\":%s,"
        "\"mounted\":%s,\"read_only_guaranteed\":%s,"
        "\"write_enabled\":false,\"format_allowed\":false,"
        "\"blocked_write_attempts\":%lu,\"card_capacity_bytes\":%llu,"
        "\"filesystem_capacity_bytes\":%llu,\"free_bytes\":%llu,"
        "\"capacity_matched\":%s,\"product_root\":\"%s\","
        "\"root_exists\":%s,\"permit_status\":\"%s\","
        "\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"identity_cleanup\":%s,\"mount_cleanup\":%s,"
        "\"gpio21_stable_high\":%s,\"physical_write_calls\":0}",
        valid ? "valid" : "rejected", expectedFingerprint, cidHex,
        fingerprintMatched ? "true" : "false",
        mountAttempted ? "true" : "false", mounted ? "true" : "false",
        readOnlyGuaranteed ? "true" : "false",
        static_cast<unsigned long>(blockedWrites),
        static_cast<unsigned long long>(cardCapacity),
        static_cast<unsigned long long>(filesystemCapacity),
        static_cast<unsigned long long>(freeBytes),
        capacityMatched ? "true" : "false",
        leshy1::storage::kProductSessionStoreRoot,
        rootExists ? "true" : "false",
        leshy1::storage::productStoreAccessStatusName(permit.status),
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        identityCleanup ? "true" : "false",
        mountCleanup ? "true" : "false",
        filesystem.gpio21StableHigh() ? "true" : "false");
    reply.println(line);
}

bool parseWifiPersistCommand(const char* command, char* fingerprint,
                             std::size_t fingerprintCapacity, char* runId,
                             std::size_t runIdCapacity,
                             unsigned* maximumScans) {
    if (command == nullptr || fingerprint == nullptr || runId == nullptr ||
        maximumScans == nullptr || fingerprintCapacity < 33 ||
        runIdCapacity < 33 ||
        std::strncmp(command, kWifiPersistPrefix,
                     std::strlen(kWifiPersistPrefix)) != 0) {
        return false;
    }
    char extra = '\0';
    unsigned parsedMaximumScans = 0;
    const int parsed = std::sscanf(
        command + std::strlen(kWifiPersistPrefix),
        "%32[0-9A-F] %32[A-Za-z0-9_-] %u %c", fingerprint, runId,
        &parsedMaximumScans, &extra);
    if (parsed != 3 || std::strlen(fingerprint) != 32 ||
        runId[0] == '\0' || parsedMaximumScans == 0 ||
        parsedMaximumScans > kWifiPersistMaxScans) {
        return false;
    }
    *maximumScans = parsedMaximumScans;
    return true;
}

