anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitNrf24SpectrumReport(Stream& reply) {
    const auto& report = nrf24SpectrumReport;
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.nrf24.spectrum.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"display_mode\":\"%s\",\"metric\":\"%s\","
        "\"traffic_semantics\":\"activity_above_baseline\","
        "\"history_rows\":%u,"
        "\"waterfall_cadence\":\"receiver_sweep\","
        "\"waterfall_fill_target_us\":0,"
        "\"waterfall_row_period_us\":0,\"waterfall_full\":%s,"
        "\"waterfall_fill_elapsed_us\":%llu,"
        "\"waterfall_rows_emitted\":%lu,"
        "\"waterfall_measurements_consumed\":%lu,"
        "\"waterfall_measurements_skipped\":%lu,"
        "\"waterfall_source_sweeps\":%lu,"
        "\"timing\":{\"row_interval_total_us\":%llu,"
        "\"row_interval_max_us\":%llu,\"row_push_total_us\":%llu,"
        "\"row_push_max_us\":%llu,\"row_render_total_us\":%llu,"
        "\"row_render_max_us\":%llu,\"row_service_max_us\":%llu,"
        "\"nrf_chunk_max_us\":%llu,\"loop_interval_total_us\":%llu,"
        "\"loop_interval_max_us\":%llu,\"loop_count\":%llu,"
        "\"touch_poll_total_us\":%llu,\"touch_poll_max_us\":%llu,"
        "\"touch_poll_count\":%llu},"
        "\"state\":\"%s\",\"status\":\"%s\","
        "\"range_mhz\":[2402,2484],\"channels\":%u,\"dwell_us\":%u,"
        "\"modules\":%u,\"active_slot_mask\":%u,\"chunks\":%lu,"
        "\"all_available_antennas\":true,"
        "\"slot3_receive_enabled\":%s,"
        "\"sweeps\":%lu,\"total_hits\":%llu,"
        "\"active_bins\":%u,\"peak_channel\":%u,\"peak_mhz\":%u,"
        "\"rx_only\":%s,\"volatile\":true,\"adapter_active\":%s,"
        "\"profile_declared\":%s,\"nrf_slot3_gated\":%s,"
        "\"gpio21_stable_high\":%s,\"cleanup_complete\":%s,"
        "\"wire\":{\"register_reads\":%lu,\"register_writes\":%lu,"
        "\"spi_bytes_clocked\":%lu,\"receive_ce_high_events\":%lu},"
        "\"side_effects\":{\"tx_mode_entries\":%lu,"
        "\"tx_payload_commands\":%lu,\"cc_command_strobes\":%lu,"
        "\"storage_writes\":0},\"read_only_query\":true,"
        "\"current_owner\":\"%s\",\"current_lease_mask\":%lu}",
        rfSpectrumViewName(rfSpectrumView),
        leshy1::apps::spectrum::spectrumDisplayModeName(
            spectrumViewport.mode()),
        leshy1::apps::spectrum::nrf24SpectrumMetricName(
            nrf24SpectrumController.metric()),
        static_cast<unsigned>(spectrumViewport.rowsStored()),
        spectrumWaterfallCompletedUs != 0 ? "true" : "false",
        static_cast<unsigned long long>(spectrumWaterfallFillElapsedUs()),
        static_cast<unsigned long>(spectrumWaterfallRowsEmitted),
        static_cast<unsigned long>(spectrumWaterfallMeasurementsConsumed),
        static_cast<unsigned long>(spectrumWaterfallMeasurementsSkipped),
        static_cast<unsigned long>(
            nrf24SpectrumController.sweeps() >=
                    spectrumWaterfallSourceSweepBaseline
                ? nrf24SpectrumController.sweeps() -
                      spectrumWaterfallSourceSweepBaseline
                : 0U),
        static_cast<unsigned long long>(spectrumWaterfallRowIntervalTotalUs),
        static_cast<unsigned long long>(spectrumWaterfallRowIntervalMaxUs),
        static_cast<unsigned long long>(spectrumWaterfallPushTotalUs),
        static_cast<unsigned long long>(spectrumWaterfallPushMaxUs),
        static_cast<unsigned long long>(spectrumWaterfallRenderTotalUs),
        static_cast<unsigned long long>(spectrumWaterfallRenderMaxUs),
        static_cast<unsigned long long>(spectrumWaterfallServiceMaxUs),
        static_cast<unsigned long long>(nrf24SpectrumChunkMaxUs),
        static_cast<unsigned long long>(spectrumLoopIntervalTotalUs),
        static_cast<unsigned long long>(spectrumLoopIntervalMaxUs),
        static_cast<unsigned long long>(spectrumLoopCount),
        static_cast<unsigned long long>(spectrumTouchPollTotalUs),
        static_cast<unsigned long long>(spectrumTouchPollMaxUs),
        static_cast<unsigned long long>(spectrumTouchPollCount),
        leshy1::apps::spectrum::nrf24SpectrumViewStateName(
            nrf24SpectrumController.state()),
        leshy1::drivers::radio::nrf24PassiveSpectrumStatusName(report.status),
        static_cast<unsigned>(Nrf24SpectrumController::kChannelCount),
        static_cast<unsigned>(
            leshy1::drivers::radio::defaultNrf24PassiveSpectrumPlan().dwellUs),
        static_cast<unsigned>(nrf24SpectrumController.modules()),
        static_cast<unsigned>(report.activeSlotMask),
        static_cast<unsigned long>(report.chunks),
        (report.activeSlotMask & 0x04U) != 0 ? "true" : "false",
        static_cast<unsigned long>(nrf24SpectrumController.sweeps()),
        static_cast<unsigned long long>(nrf24SpectrumController.totalHits()),
        static_cast<unsigned>(nrf24SpectrumController.activeBins()),
        static_cast<unsigned>(nrf24SpectrumController.hottestChannel()),
        static_cast<unsigned>(2400U +
            nrf24SpectrumController.hottestChannel()),
        report.rxOnly ? "true" : "false",
        boardNrf24Spectrum.active() ? "true" : "false",
        report.profileDeclared ? "true" : "false",
        report.nrfSlot3Gated ? "true" : "false",
        report.gpio21StableHigh ? "true" : "false",
        report.cleanupComplete ? "true" : "false",
        static_cast<unsigned long>(report.registerReads),
        static_cast<unsigned long>(report.registerWrites),
        static_cast<unsigned long>(report.spiBytesClocked),
        static_cast<unsigned long>(report.receiveCeHighEvents),
        static_cast<unsigned long>(report.txModeEntries),
        static_cast<unsigned long>(report.txPayloadCommands),
        static_cast<unsigned long>(report.ccCommandStrobes),
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitCc1101SpectrumReport(Stream& reply) {
    const auto& report = cc1101SpectrumReport;
    const Cc1101PassiveSpectrumPlan plan = cc1101SpectrumController.plan();
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.cc1101.spectrum.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"display_mode\":\"%s\",\"history_rows\":%u,"
        "\"waterfall_cadence\":\"receiver_sweep\","
        "\"waterfall_fill_target_us\":0,"
        "\"waterfall_row_period_us\":0,\"waterfall_full\":%s,"
        "\"waterfall_fill_elapsed_us\":%llu,"
        "\"waterfall_rows_emitted\":%lu,"
        "\"waterfall_measurements_consumed\":%lu,"
        "\"waterfall_measurements_skipped\":%lu,"
        "\"waterfall_source_sweeps\":%lu,"
        "\"state\":\"%s\",\"status\":\"%s\","
        "\"band\":\"%s\",\"range_khz\":[%lu,%lu],\"bins\":%u,"
        "\"settle_us\":%u,\"ready_timeout_us\":%u,"
        "\"partnum\":%u,\"version\":%u,\"sweeps\":%lu,"
        "\"samples\":%llu,\"adapter_samples\":%lu,\"next_bin\":%u,"
        "\"latest_rssi_dbm\":%d,\"peak_khz\":%lu,"
        "\"peak_rssi_dbm\":%d,\"rx_only\":%s,\"volatile\":true,"
        "\"adapter_active\":%s,\"profile_declared\":%s,"
        "\"nrf_slot3_gated\":%s,\"gpio21_stable_high\":%s,"
        "\"cleanup_complete\":%s,"
        "\"wire\":{\"register_reads\":%lu,\"register_writes\":%lu,"
        "\"spi_bytes_clocked\":%lu,\"command_strobes\":%lu,"
        "\"reset_strobes\":%lu,\"receive_strobes\":%lu,"
        "\"idle_strobes\":%lu,\"receive_ready_timeouts\":%lu,"
        "\"transient_retries\":%lu,\"select_ready_timeouts\":%lu,"
        "\"recovery_attempts\":%lu,\"recoveries\":%lu},"
        "\"side_effects\":{\"rejected_strobes\":%lu,"
        "\"tx_strobes\":%lu,\"pa_table_writes\":%lu,"
        "\"fifo_writes\":%lu,\"storage_writes\":0},"
        "\"read_only_query\":true,\"current_owner\":\"%s\","
        "\"current_lease_mask\":%lu}",
        rfSpectrumKind == RfSpectrumKind::Cc1101
            ? rfSpectrumViewName(rfSpectrumView) : "none",
        leshy1::apps::spectrum::spectrumDisplayModeName(
            spectrumViewport.mode()),
        static_cast<unsigned>(spectrumViewport.rowsStored()),
        spectrumWaterfallCompletedUs != 0 ? "true" : "false",
        static_cast<unsigned long long>(spectrumWaterfallFillElapsedUs()),
        static_cast<unsigned long>(spectrumWaterfallRowsEmitted),
        static_cast<unsigned long>(spectrumWaterfallMeasurementsConsumed),
        static_cast<unsigned long>(spectrumWaterfallMeasurementsSkipped),
        static_cast<unsigned long>(
            cc1101SpectrumController.sweeps() >=
                    spectrumWaterfallSourceSweepBaseline
                ? cc1101SpectrumController.sweeps() -
                      spectrumWaterfallSourceSweepBaseline
                : 0U),
        leshy1::apps::spectrum::cc1101SpectrumViewStateName(
            cc1101SpectrumController.state()),
        leshy1::drivers::radio::cc1101PassiveSpectrumStatusName(
            report.status),
        leshy1::drivers::radio::cc1101SpectrumBandName(
            cc1101SpectrumController.band()),
        static_cast<unsigned long>(plan.firstKHz),
        static_cast<unsigned long>(plan.lastKHz),
        static_cast<unsigned>(Cc1101SpectrumController::kBinCount),
        static_cast<unsigned>(plan.settleUs),
        static_cast<unsigned>(plan.readyTimeoutUs),
        static_cast<unsigned>(report.partNumber),
        static_cast<unsigned>(report.version),
        static_cast<unsigned long>(cc1101SpectrumController.sweeps()),
        static_cast<unsigned long long>(cc1101SpectrumController.samples()),
        static_cast<unsigned long>(report.samples),
        static_cast<unsigned>(cc1101SpectrumController.nextBin()),
        static_cast<int>(cc1101SpectrumController.latestRssiDbm()),
        static_cast<unsigned long>(cc1101SpectrumController.peakKHz()),
        static_cast<int>(cc1101SpectrumController.peakRssiDbm()),
        report.rxOnly ? "true" : "false",
        boardCc1101Spectrum.active() ? "true" : "false",
        report.profileDeclared ? "true" : "false",
        report.nrfSlot3Gated ? "true" : "false",
        report.gpio21StableHigh ? "true" : "false",
        report.cleanupComplete ? "true" : "false",
        static_cast<unsigned long>(report.registerReads),
        static_cast<unsigned long>(report.registerWrites),
        static_cast<unsigned long>(report.spiBytesClocked),
        static_cast<unsigned long>(report.commandStrobes),
        static_cast<unsigned long>(report.resetStrobes),
        static_cast<unsigned long>(report.receiveStrobes),
        static_cast<unsigned long>(report.idleStrobes),
        static_cast<unsigned long>(report.receiveReadyTimeouts),
        static_cast<unsigned long>(report.transientRetries),
        static_cast<unsigned long>(report.selectReadyTimeouts),
        static_cast<unsigned long>(report.recoveryAttempts),
        static_cast<unsigned long>(report.recoveries),
        static_cast<unsigned long>(report.rejectedStrobes),
        static_cast<unsigned long>(report.txStrobes),
        static_cast<unsigned long>(report.paTableWrites),
        static_cast<unsigned long>(report.fifoWrites),
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

bool commandAllowedDuringSafetyStop(const char* command) {
    if (command == nullptr) return false;
    return std::strncmp(command, "hil.begin ", 10) == 0 ||
           std::strncmp(command, "hil.end ", 8) == 0 ||
           std::strcmp(command, "metrics") == 0 ||
           std::strcmp(command, "inventory") == 0 ||
           std::strcmp(command, "ping") == 0 ||
           std::strcmp(command, "hardware.safe-outputs") == 0 ||
           std::strcmp(command, "safety.state") == 0 ||
           std::strcmp(command, "safety.restart-test confirm") == 0 ||
           std::strcmp(command, "safety.clear confirm") == 0 ||
           std::strcmp(command, "ui.state") == 0 ||
           std::strncmp(command, "ui.key ", 7) == 0 ||
           std::strcmp(command, "ui.capture") == 0 ||
           std::strcmp(command, "input.state") == 0 ||
           std::strcmp(command, "touch.state") == 0 ||
           std::strcmp(command, "storage.product.boot-recovery") == 0;
}

