anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void handleCommand(Stream& reply, const char* command) {
    if (safetySupervisor.latched() &&
        !commandAllowedDuringSafetyStop(command)) {
        reply.println(
            "{\"schema\":\"leshy.safety.v1\",\"kind\":\"blocked\","
            "\"reason\":\"safety_latched\"}");
        return;
    }
    if (std::strncmp(command, "hil.begin ", 10) == 0) {
        emitHilSessionBegin(reply, command);
    } else if (std::strncmp(command, "hil.end ", 8) == 0) {
        emitHilSessionEnd(reply, command);
    } else if (std::strcmp(command, "metrics") == 0) {
        emitMetrics();
    } else if (std::strcmp(command, "inventory") == 0) {
        emitInventory();
    } else if (std::strcmp(command, "hardware.safe-outputs") == 0) {
        emitSafeOutputs(reply);
    } else if (std::strcmp(command, "safety.state") == 0) {
        emitSafetyState(reply);
    } else if (std::strcmp(command,
                           "safety.watchdog-test confirm") == 0) {
        triggerRuntimeSafetyWatchdogTest(reply);
    } else if (std::strcmp(command,
                           "safety.restart-test confirm") == 0) {
        restartLatchedSafetyStopForTest(reply);
    } else if (std::strcmp(command, "safety.clear confirm") == 0) {
        clearSafetyStopFromConsole(reply);
    } else if (std::strcmp(command, "hardware.shield.receivers") == 0) {
        emitShieldReceiverProbeReport(reply);
    } else if (std::strcmp(command, "hardware.nrf24.spectrum") == 0) {
        emitNrf24SpectrumReport(reply);
    } else if (std::strcmp(command, "hardware.cc1101.spectrum") == 0) {
        emitCc1101SpectrumReport(reply);
    } else if (std::strcmp(command, "ping") == 0) {
        broadcast("{\"schema\":\"leshy.boot.v1\",\"kind\":\"pong\"}");
    } else if (std::strcmp(command, "ui.state") == 0) {
        emitUiState(reply, UiAction::Unknown, false);
    } else if (std::strcmp(command, "survey.browser") == 0) {
        emitSurveyBrowser(reply);
    } else if (std::strcmp(command, "capture.state") == 0) {
        emitWifiFrameCaptureState(reply);
    } else if (std::strcmp(command, "capture.export.pcap") == 0) {
        emitWifiFrameCapturePcap(reply);
    } else if (std::strcmp(command, "capture.subghz.state") == 0) {
        emitSubGhzRawCaptureState(reply);
    } else if (std::strcmp(command,
                           "capture.subghz.export.csv") == 0) {
        emitSubGhzRawCaptureCsv(reply);
    } else if (std::strcmp(command, "input.state") == 0) {
        emitInputState(reply);
    } else if (std::strcmp(command, "touch.state") == 0) {
        emitTouchState(reply);
    } else if (std::strcmp(command, "touch.calibrate confirm") == 0) {
        calibrateTouch(reply);
    } else if (std::strncmp(command, "ui.touch ", 9) == 0) {
        handleSyntheticTouch(reply, command);
    } else if (std::strcmp(command, "self-test.report") == 0) {
        emitSelfTestReport(reply);
    } else if (std::strcmp(command, "self-test.active-rf") == 0) {
        emitFullGuidedRfReport(reply);
    } else if (std::strcmp(command, "self-test.active-artifact") == 0) {
        emitFullGuidedArtifactReport(reply);
    } else if (std::strncmp(command, "ui.language ", 12) == 0) {
        UiLanguage requested = UiLanguage::English;
        if (!leshy1::ui::uiLanguageFromName(command + 12, &requested)) {
            reply.println("{\"schema\":\"leshy.ui.language.v1\","
                          "\"kind\":\"error\",\"reason\":\"invalid_language\"}");
        } else if (!saveUiLanguage(requested)) {
            reply.println("{\"schema\":\"leshy.ui.language.v1\","
                          "\"kind\":\"error\",\"reason\":\"persist_failed\"}");
        } else {
            const bool changed = languageController.active() != requested;
            languageController.restore(requested);
            lastRuntimeEvent = "language_persisted";
            renderInteractiveScreen();
            emitUiState(reply, UiAction::Unknown, changed);
        }
    } else if (std::strncmp(command, "ui.key ", 7) == 0) {
        const UiAction action = leshy1::ui::uiActionFromName(command + 7);
        if (action == UiAction::Unknown) {
            reply.println("{\"schema\":\"leshy.ui.v1\",\"kind\":\"error\","
                          "\"reason\":\"unknown_action\"}");
        } else {
            emitUiState(reply, action, applyUiAction(action));
        }
    } else if (std::strcmp(command, "ui.capture") == 0) {
        captureDisplay(reply);
    } else if (std::strcmp(command, "storage.contract") == 0) {
        emitStorageContract(reply);
    } else if (std::strcmp(command, "storage.guard") == 0) {
        emitStorageGuard(reply);
    } else if (std::strcmp(command, "storage.discovery") == 0) {
        emitStorageDiscovery(reply);
    } else if (std::strcmp(command, "storage.mount.policy") == 0) {
        emitStorageMountPolicy(reply);
    } else if (std::strcmp(command, "storage.product.boot-recovery") == 0) {
        emitProductBootRecovery(reply);
    } else if (std::strcmp(
                   command,
                   "storage.product.boot-watchdog-test confirm") == 0) {
        triggerProductBootWatchdogTest(reply);
    } else if (std::strcmp(command, "storage.product.unenroll confirm") == 0) {
        emitProductUnenrollment(reply);
    } else if (std::strcmp(command, "survey.product.admission") == 0) {
        emitProductSurveyAdmission(reply);
    } else if (std::strncmp(
                   command, "survey.product.test-source-unavailable ", 39) == 0) {
        emitProductSurveySourceUnavailableTest(reply, command);
    } else if (std::strncmp(
                   command, "survey.product.test-runtime-unavailable ", 40) == 0) {
        emitProductSurveyRuntimeUnavailableTest(reply, command);
    } else if (std::strncmp(command, kLittleFsParityPrefix,
                            std::strlen(kLittleFsParityPrefix)) == 0) {
        char fingerprint[65] = {};
        char runId[33] = {};
        if (parseLittleFsParityCommand(
                command, fingerprint, sizeof(fingerprint), runId,
                sizeof(runId))) {
            emitLittleFsParity(reply, fingerprint, runId);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.littlefs.parity.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(
                   command, kLittleFsResetRecoverPrefix,
                   std::strlen(kLittleFsResetRecoverPrefix)) == 0) {
        char fingerprint[65] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseLittleFsResetCommand(
                command, kLittleFsResetRecoverPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitLittleFsResetRecovery(
                reply, fingerprint, runId, boundaryNumber);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.littlefs.reset.v1\","
                "\"kind\":\"error\",\"mode\":\"recovery\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kLittleFsResetPrefix,
                            std::strlen(kLittleFsResetPrefix)) == 0) {
        char fingerprint[65] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseLittleFsResetCommand(
                command, kLittleFsResetPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitLittleFsResetArm(reply, fingerprint, runId, boundaryNumber);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.littlefs.reset.v1\","
                "\"kind\":\"error\",\"mode\":\"arm\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strcmp(command, "storage.sd.protocol") == 0) {
        emitSdReadOnlyProtocol(reply);
    } else if (std::strcmp(command, "storage.sd.identification.fixture") == 0) {
        emitSdIdentificationFixture(reply);
    } else if (std::strcmp(command, "storage.sd.transport.fixture") == 0) {
        emitSdTransportFixture(reply);
    } else if (std::strcmp(command, "storage.sd.wire") == 0) {
        emitSdWireContract(reply);
    } else if (std::strcmp(command,
                           "storage.sd.identify disposable-read-only") == 0) {
        emitPhysicalSdIdentification(reply);
    } else if (std::strcmp(command,
                           "storage.sd.inspect-lba0 disposable-read-only") == 0) {
        emitPhysicalSdSector0(reply);
    } else if (std::strcmp(command,
                           "storage.sd.inspect-boot disposable-read-only") == 0) {
        emitPhysicalSdBoot(reply);
    } else if (std::strcmp(command,
                           "storage.sd.inspect-fsinfo disposable-read-only") == 0) {
        emitPhysicalSdFsInfo(reply);
    } else if (std::strcmp(
                   command,
                   "storage.sd.inspect-fat-reserved disposable-read-only") == 0) {
        emitPhysicalSdFatReserved(reply);
    } else if (std::strcmp(
                   command,
                   "storage.sd.inspect-root-cluster disposable-read-only") == 0) {
        emitPhysicalSdRootMetadata(reply);
    } else if (std::strncmp(command, kSdReadOnlyMountPrefix,
                            std::strlen(kSdReadOnlyMountPrefix)) == 0) {
        char fingerprint[33] = {};
        if (parseExactFingerprintCommand(
                command, kSdReadOnlyMountPrefix, fingerprint,
                sizeof(fingerprint))) {
            emitPhysicalSdReadOnlyMount(reply, fingerprint);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.readonly_mount.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kProductBootstrapPrefix,
                            std::strlen(kProductBootstrapPrefix)) == 0) {
        char fingerprint[33] = {};
        if (parseExactFingerprintCommand(
                command, kProductBootstrapPrefix, fingerprint,
                sizeof(fingerprint))) {
            emitProductStoreBootstrap(reply, fingerprint);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.product_bootstrap.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kProductEnrollPrefix,
                            std::strlen(kProductEnrollPrefix)) == 0) {
        char fingerprint[33] = {};
        if (parseExactFingerprintCommand(
                command, kProductEnrollPrefix, fingerprint,
                sizeof(fingerprint))) {
            emitProductEnrollment(reply, fingerprint);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.product_enrollment.v1\","
                "\"kind\":\"error\",\"mode\":\"enroll\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionPowerCutPrefix,
                            std::strlen(kSdSessionPowerCutPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseSdSessionResetCommand(
                command, kSdSessionPowerCutPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitPhysicalSdSessionResetArm(reply, fingerprint, runId,
                                          boundaryNumber, true);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
                "\"kind\":\"error\",\"mode\":\"power_cut_arm\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionPowerCutRecoverPrefix,
                            std::strlen(kSdSessionPowerCutRecoverPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseSdSessionResetCommand(
                command, kSdSessionPowerCutRecoverPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitPhysicalSdSessionResetRecovery(reply, fingerprint, runId,
                                               boundaryNumber, true);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
                "\"kind\":\"error\",\"mode\":\"power_cut_recovery\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionResetPrefix,
                            std::strlen(kSdSessionResetPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseSdSessionResetCommand(
                command, kSdSessionResetPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitPhysicalSdSessionResetArm(reply, fingerprint, runId,
                                          boundaryNumber, false);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
                "\"kind\":\"error\",\"mode\":\"arm\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionRecoverPrefix,
                            std::strlen(kSdSessionRecoverPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseSdSessionResetCommand(
                command, kSdSessionRecoverPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitPhysicalSdSessionResetRecovery(reply, fingerprint, runId,
                                               boundaryNumber, false);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
                "\"kind\":\"error\",\"mode\":\"recovery\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionBatchThroughputPrefix,
                            std::strlen(kSdSessionBatchThroughputPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        if (parseSdSessionStoreCommand(
                command, kSdSessionBatchThroughputPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId))) {
            emitPhysicalSdSessionStore(reply, fingerprint, runId, true, true,
                                       false, 0);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_batch_throughput.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionThroughputPrefix,
                            std::strlen(kSdSessionThroughputPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        if (parseSdSessionStoreCommand(
                command, kSdSessionThroughputPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId))) {
            emitPhysicalSdSessionStore(reply, fingerprint, runId, true, false,
                                       false, 0);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_throughput.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionStorePrefix,
                            std::strlen(kSdSessionStorePrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        if (parseSdSessionStoreCommand(
                command, kSdSessionStorePrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId))) {
            emitPhysicalSdSessionStore(reply, fingerprint, runId, false, false,
                                       false, 0);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kWifiPersistPrefix,
                            std::strlen(kWifiPersistPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        unsigned maximumScans = 0;
        if (parseWifiPersistCommand(
                command, fingerprint, sizeof(fingerprint), runId,
                sizeof(runId), &maximumScans)) {
            emitPhysicalSdSessionStore(reply, fingerprint, runId, false,
                                       false, true, maximumScans);
        } else {
            reply.println(
                "{\"schema\":\"leshy.survey.wifi_passive_persist.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kWifiIngressPrefix,
                            std::strlen(kWifiIngressPrefix)) == 0) {
        unsigned samples = 0;
        if (parseWifiIngressCommand(command, &samples)) {
            emitPhysicalWifiPassiveIngress(reply, samples);
        } else {
            reply.println(
                "{\"schema\":\"leshy.survey.wifi_passive_ingress.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strcmp(command, "survey.contract") == 0) {
        emitSurveyContract(reply);
    } else if (std::strcmp(command, "session.fixture") == 0) {
        emitSessionFixture(reply);
    } else if (std::strcmp(command, "session.store.fixture") == 0) {
        emitSessionStoreFixture(reply);
    } else if (std::strcmp(command, "library.fixture") == 0) {
        emitLibraryFixture(reply);
    } else if (std::strcmp(command, "library.export") == 0) {
        emitLibraryExport(reply);
    } else if (std::strcmp(command, "library.capture") == 0) {
        emitLibraryCaptureMetadata(reply);
    } else if (std::strcmp(command, "library.export.csv") == 0) {
        emitLibraryCsvExport(reply);
    } else if (std::strcmp(command, "library.export.pcap") == 0) {
        emitLibraryPcapStatus(reply);
    } else if (command[0] != '\0') {
        reply.println("{\"schema\":\"leshy.boot.v1\",\"kind\":\"error\","
                      "\"reason\":\"unknown_command\"}");
    }
}

